{"page":1,"tags":["Chapitre I","Règle 1"],"text":"**Provider.** Gouvernement français\n**Title.** Loi NIS-1 FR\n**Description.** Arrêté du 14 septembre 2018 fixant les règles de sécurité et les délais mentionnés à l'article 10 du décret n° 2018-384 du 23 mai 2018 relatif à la sécurité des réseaux et systèmes d'information des opérateurs de services essentiels et des fournisseurs de service numérique\nhttps:\/\/www.legifrance.gouv.fr\/loda\/id\/JORFTEXT000037444012\/\n\n# Chapitre I\n\n## Règle 1\n\nL'opérateur de services essentiels effectue et tient à jour, dans le cadre de l'homologation de sécurité prévue à la règle 3, une analyse de risque de ses systèmes d'information essentiels (SIE).\n\nCette analyse de risque prend notamment en compte l'analyse que l'opérateur a menée pour identifier ses systèmes d'information en tant que SIE."}
{"page":1,"tags":["Chapitre I","Règle 2"],"text":"**Provider.** Gouvernement français\n**Title.** Loi NIS-1 FR\n**Description.** Arrêté du 14 septembre 2018 fixant les règles de sécurité et les délais mentionnés à l'article 10 du décret n° 2018-384 du 23 mai 2018 relatif à la sécurité des réseaux et systèmes d'information des opérateurs de services essentiels et des fournisseurs de service numérique\nhttps:\/\/www.legifrance.gouv.fr\/loda\/id\/JORFTEXT000037444012\/\n\n# Chapitre I\n\n## Règle 2\n\nL'opérateur de services essentiels élabore, tient à jour et met en œuvre une politique de sécurité des réseaux et systèmes d'information (PSSI).\n\nLa PSSI décrit l'ensemble des procédures et des moyens organisationnels et techniques mis en œuvre par l'opérateur afin d'assurer la sécurité de ses systèmes d'information essentiels (SIE).\n\n- les objectifs et les orientations stratégiques en matière de sécurité des SIE ;\n\n- l'organisation de la gouvernance de la sécurité et notamment les rôles et les responsabilités du personnel interne et du personnel externe (prestataires, fournisseurs, etc.) à l'égard de la sécurité des SIE ;\n\n- les plans de sensibilisation à la sécurité des SIE au profit de l'ensemble du personnel ainsi que des plans de formation à la sécurité des SIE au profit des personnes ayant des responsabilités particulières, notamment les personnes en charge de l'administration et de la sécurité des SIE et les utilisateurs disposant de droits d'accès privilégiés aux SIE ;\n\n- la procédure d'homologation de sécurité des SIE ;\n\n- les procédures de contrôle et d'audit de la sécurité des SIE, notamment celles mises en œuvre dans le cadre de l'homologation de sécurité.\n\n- les mesures de sécurité générales, notamment en matière de gestion et de sécurité des ressources matérielles et logicielles des SIE, de contrôle d'accès aux SIE, d'exploitation et d'administration des SIE et de sécurité des réseaux, des postes de travail et des données ;\n\n- les procédures et les mesures de sécurité physique et environnementale applicables aux SIE ;\n\n- la procédure de maintien en conditions de sécurité des ressources des SIE.\n\n- la procédure de détection des incidents de sécurité ;\n\n- la procédure de traitement des incidents de sécurité.\n\n- la procédure de gestion de crises en cas d'incidents de sécurité ayant un impact majeur sur les services essentiels de l'opérateur ;\n\n- les procédures de continuité et de reprise d'activité.\n\nL'opérateur élabore au profit de sa direction, au moins annuellement, un rapport sur la mise en œuvre de la PSSI et de ses documents d'application.\n\nCe rapport précise notamment l'état des lieux des risques, le niveau de sécurité des SIE et les actions de sécurisation menées et prévues.\n\nL'opérateur tient à la disposition de l'Agence nationale de la sécurité des systèmes d'information la PSSI, ses documents d'application et les rapports sur leur mise en œuvre."}
{"page":1,"tags":["Chapitre I","Règle 3"],"text":"**Provider.** Gouvernement français\n**Title.** Loi NIS-1 FR\n**Description.** Arrêté du 14 septembre 2018 fixant les règles de sécurité et les délais mentionnés à l'article 10 du décret n° 2018-384 du 23 mai 2018 relatif à la sécurité des réseaux et systèmes d'information des opérateurs de services essentiels et des fournisseurs de service numérique\nhttps:\/\/www.legifrance.gouv.fr\/loda\/id\/JORFTEXT000037444012\/\n\n# Chapitre I\n\n## Règle 3\n\nL'opérateur de services essentiels procède à l'homologation de sécurité de chaque système d'information essentiel (SIE), en mettant en œuvre la procédure d'homologation prévue par sa politique de sécurité des réseaux et systèmes d'information.\n\nL'homologation d'un système est une décision formelle prise par l'opérateur qui atteste que les risques pesant sur la sécurité de ce système ont été identifiés et que les mesures nécessaires pour le protéger sont mises en œuvre. Elle atteste également que les éventuels risques résiduels ont été identifiés et acceptés par l'opérateur.\n\nDans le cadre de l'homologation, un audit de la sécurité du SIE doit être réalisé conformément à la règle 5.\n\n- l'analyse de risques et les objectifs de sécurité du SIE ;\n\n- les procédures et les mesures de sécurité appliquées au SIE ;\n\n- les rapports d'audit de la sécurité du SIE ;\n\n- les risques résiduels et les raisons justifiant leur acceptation.\n\nChaque réexamen de l'homologation est consigné dans le dossier d'homologation.\n\nL'opérateur procède au renouvellement de l'homologation dès qu'elle n'est plus valide.\n\nL'opérateur tient à la disposition de l'Agence nationale de la sécurité des systèmes d'information les décisions et dossiers d'homologation."}
{"page":1,"tags":["Chapitre I","Règle  4"],"text":"**Provider.** Gouvernement français\n**Title.** Loi NIS-1 FR\n**Description.** Arrêté du 14 septembre 2018 fixant les règles de sécurité et les délais mentionnés à l'article 10 du décret n° 2018-384 du 23 mai 2018 relatif à la sécurité des réseaux et systèmes d'information des opérateurs de services essentiels et des fournisseurs de service numérique\nhttps:\/\/www.legifrance.gouv.fr\/loda\/id\/JORFTEXT000037444012\/\n\n# Chapitre I\n\n## Règle  4\n\ndes indicateurs relatifs au maintien en conditions de sécurité des ressources :\n\nle pourcentage de postes utilisateurs dont les ressources systèmes ne sont pas installées dans une version supportée par le fournisseur ou le fabricant ;\n\nle pourcentage de serveurs dont les ressources systèmes ne sont pas installées dans une version supportée par le fournisseur ou le fabricant ;\n\ndes indicateurs relatifs aux droits d'accès des utilisateurs et à l'authentification des accès aux ressources :\n\nle pourcentage d'utilisateurs accédant au SIE au moyen de comptes privilégiés ;\n\nle pourcentage de ressources dont les éléments secrets d'authentification ne peuvent pas être modifiés par l'opérateur ;\n\ndes indicateurs relatifs à l'administration des ressources :\n\nle pourcentage de ressources administrées dont l'administration est effectuée à partir d'un compte non spécifique d'administration ;\n\nle pourcentage de ressources administrées dont l'administration ne peut pas être effectuée au travers d'une liaison réseau physique ou d'une interface d'administration physique.\n\nLorsqu'un indicateur évolue de façon significative par rapport à l'évaluation précédente, l'opérateur en précise les raisons.\n\nL'opérateur communique à l'Agence nationale de la sécurité des systèmes d'information, à sa demande, les indicateurs mis à jour sur un support électronique."}
{"page":1,"tags":["Chapitre I","Règle  5"],"text":"**Provider.** Gouvernement français\n**Title.** Loi NIS-1 FR\n**Description.** Arrêté du 14 septembre 2018 fixant les règles de sécurité et les délais mentionnés à l'article 10 du décret n° 2018-384 du 23 mai 2018 relatif à la sécurité des réseaux et systèmes d'information des opérateurs de services essentiels et des fournisseurs de service numérique\nhttps:\/\/www.legifrance.gouv.fr\/loda\/id\/JORFTEXT000037444012\/\n\n# Chapitre I\n\n## Règle  5\n\nL'audit doit aussi être réalisé lors de chaque renouvellement de l'homologation en prenant notamment en compte les résultats de la mise à jour de l'analyse de risque du SIE.\n\nIl doit permettre d'évaluer le niveau de sécurité du SIE au regard des menaces et des vulnérabilités connues et comporte notamment la réalisation d'un audit d'architecture, d'un audit de configuration et d'un audit organisationnel et physique.\n\nL'opérateur ou le prestataire mandaté à cet effet réalise cet audit en s'appuyant sur les exigences du référentiel en matière d'audit de sécurité des systèmes d'information pris en application de l'article 10 du décret n° 2015-350 du 27 mars 2015 modifié relatif à la qualification des produits de sécurité et des prestataires de service de confiance pour les besoins de la sécurité des systèmes d'information.\n\nLe rapport précise si le niveau de sécurité atteint est conforme aux objectifs de sécurité, compte tenu des menaces et des vulnérabilités connues.\n\nIl formule des recommandations pour remédier aux éventuelles non-conformités et vulnérabilités découvertes."}
{"page":1,"tags":["Chapitre I","Règle 6"],"text":"**Provider.** Gouvernement français\n**Title.** Loi NIS-1 FR\n**Description.** Arrêté du 14 septembre 2018 fixant les règles de sécurité et les délais mentionnés à l'article 10 du décret n° 2018-384 du 23 mai 2018 relatif à la sécurité des réseaux et systèmes d'information des opérateurs de services essentiels et des fournisseurs de service numérique\nhttps:\/\/www.legifrance.gouv.fr\/loda\/id\/JORFTEXT000037444012\/\n\n# Chapitre I\n\n## Règle 6\n\nles noms et les fonctions des applications, supportant les activités de l'opérateur, installées sur le SIE ;\n\nle cas échéant, les plages d'adresses IP de sortie du SIE vers internet ou un réseau tiers, ou accessibles depuis ces réseaux ;\n\nle cas échéant, les plages d'adresses IP associées aux différents sous-réseaux composant le SIE ;\n\nla description fonctionnelle et les lieux d'installation du SIE et de ses différents sous-réseaux ;\n\nla description fonctionnelle des points d'interconnexion du SIE et de ses différents sous-réseaux avec des réseaux tiers, notamment la description des équipements et des fonctions de filtrage et de protection mis en œuvre au niveau de ces interconnexions ;\n\nl'inventaire et l'architecture des dispositifs d'administration du SIE permettant de réaliser notamment les opérations d'installation à distance, de mise à jour, de supervision, de gestion des configurations, d'authentification ainsi que de gestion des comptes et des droits d'accès ;\n\nla liste des comptes disposant de droits d'accès privilégiés au SIE (appelés « comptes privilégiés »). Cette liste précise pour chaque compte le niveau et le périmètre des droits d'accès associés, notamment les comptes sur lesquels portent ces droits (comptes d'utilisateurs, comptes de messagerie, comptes de processus, etc.) ;\n\nl'inventaire, l'architecture et le positionnement des services de résolution de noms d'hôte, de messagerie, de relais internet et d'accès distant mis en œuvre par le SIE.\n\nL'opérateur communique à l'Agence nationale de la sécurité des systèmes d'information, à sa demande, les éléments de cartographie mis à jour sur un support électronique."}
{"page":1,"tags":["Chapitre II","Section II.1","Règle 7"],"text":"**Provider.** Gouvernement français\n**Title.** Loi NIS-1 FR\n**Description.** Arrêté du 14 septembre 2018 fixant les règles de sécurité et les délais mentionnés à l'article 10 du décret n° 2018-384 du 23 mai 2018 relatif à la sécurité des réseaux et systèmes d'information des opérateurs de services essentiels et des fournisseurs de service numérique\nhttps:\/\/www.legifrance.gouv.fr\/loda\/id\/JORFTEXT000037444012\/\n\n# Chapitre II\n\n## Section II.1\n\n### Règle 7\n\nIl désactive les services et les fonctionnalités qui ne sont pas indispensables, notamment ceux installés par défaut, et les désinstalle si cela est possible.\n\nLorsque la désinstallation n'est pas possible, l'opérateur le mentionne dans le dossier d'homologation du SIE concerné en précisant les services et fonctionnalités concernés et les mesures de réduction du risque mises en œuvre ;\n\n- l'opérateur ne connecte à ses SIE que des équipements, matériels périphériques et supports amovibles dont il assure la gestion et qui sont indispensables au fonctionnement ou à la sécurité de ses SIE ;\n\n- les supports amovibles inscriptibles connectés aux SIE sont utilisés exclusivement pour le fonctionnement, y compris la maintenance et l'administration, ou la sécurité des SIE ;\n\nL'opérateur met en place, sur les équipements auxquels sont connectés ces supports amovibles, des mécanismes de protection contre les risques d'exécution de code malveillant provenant de ces supports."}
{"page":1,"tags":["Chapitre II","Section II.1","Règle 8"],"text":"**Provider.** Gouvernement français\n**Title.** Loi NIS-1 FR\n**Description.** Arrêté du 14 septembre 2018 fixant les règles de sécurité et les délais mentionnés à l'article 10 du décret n° 2018-384 du 23 mai 2018 relatif à la sécurité des réseaux et systèmes d'information des opérateurs de services essentiels et des fournisseurs de service numérique\nhttps:\/\/www.legifrance.gouv.fr\/loda\/id\/JORFTEXT000037444012\/\n\n# Chapitre II\n\n## Section II.1\n\n### Règle 8\n\n- chaque SIE est cloisonné physiquement ou logiquement vis-à-vis des autres systèmes d'information de l'opérateur et des systèmes d'information de tiers ;\n\n- lorsqu'un SIE est lui-même constitué de sous-systèmes, ceux-ci sont cloisonnés entre eux physiquement ou logiquement. Un sous-système peut être constitué pour assurer une fonctionnalité ou un ensemble homogène de fonctionnalités d'un SIE ou encore pour isoler des ressources d'un SIE nécessitant un même besoin de sécurité ;\n\n- seules les interconnexions strictement nécessaires au bon fonctionnement et à la sécurité d'un SIE sont mises en place entre le SIE et les autres systèmes ou entre les sous-systèmes du SIE.\n\nDans le cas particulier d'une interconnexion entre internet et un SIE nécessaire à la fourniture de services d'hébergement de noms de domaine, d'hébergement de zones de premier niveau, de résolution de noms de domaine ou d'interconnexion par appairage pour l'échange de trafic internet, l'opérateur n'est pas tenu d'assurer un cloisonnement physique ou logique au niveau de cette interconnexion mais met en œuvre des mesures de protection appropriées telles que celles préconisées par l'Agence nationale de la sécurité des systèmes d'information.\n\n- un premier sous-système correspondant à la partie du SIE directement accessible via ce réseau public, auquel l'opérateur applique des mesures de cloisonnement appropriées telles que celles préconisées par l'Agence nationale de la sécurité des systèmes d'information ;\n\n- un deuxième sous-système correspondant à la partie interne du SIE auquel l'opérateur applique la présente règle sur le cloisonnement.\n\nL'opérateur décrit dans le dossier d'homologation de chaque SIE les mécanismes de cloisonnement qu'il met en place."}
{"page":1,"tags":["Chapitre II","Section II.1","Règle 9"],"text":"**Provider.** Gouvernement français\n**Title.** Loi NIS-1 FR\n**Description.** Arrêté du 14 septembre 2018 fixant les règles de sécurité et les délais mentionnés à l'article 10 du décret n° 2018-384 du 23 mai 2018 relatif à la sécurité des réseaux et systèmes d'information des opérateurs de services essentiels et des fournisseurs de service numérique\nhttps:\/\/www.legifrance.gouv.fr\/loda\/id\/JORFTEXT000037444012\/\n\n# Chapitre II\n\n## Section II.1\n\n### Règle 9\n\nL'opérateur de services essentiels protège les accès à ses systèmes d'information essentiels (SIE) effectués à travers des systèmes d'information tiers.\n\nEn particulier, lorsqu'un service essentiel nécessite que le SIE nécessaire à sa fourniture soit accessible via un réseau public, l'opérateur protège cet accès au moyen de mécanismes cryptographiques conformes aux règles préconisées par l'Agence nationale de la sécurité des systèmes d'information.\n\n- l'accès au SIE est protégé par des mécanismes de chiffrement et d'authentification conformes aux règles préconisées par l'Agence nationale de la sécurité des systèmes d'information ;\n\n- lorsque l'accès au SIE est effectué depuis un site extérieur à celui de l'opérateur, le mécanisme d'authentification est renforcé en mettant en œuvre une authentification à double facteur (authentification impliquant à la fois un élément secret et un autre élément propre à l'utilisateur), sauf si des raisons techniques ou opérationnelles, précisées dans le dossier d'homologation du SIE, ne le permettent pas ;\n\nLorsque l'accès au SIE est effectué depuis un site extérieur à celui de l'opérateur, les mémoires de masse de ces équipements sont en permanence protégées par des mécanismes de chiffrement et d'authentification conformes aux règles préconisées par l'Agence nationale de la sécurité des systèmes d'information.\n\nL'opérateur décrit dans le dossier d'homologation de chaque SIE les mécanismes de protection des accès au SIE qu'il met en place."}
{"page":1,"tags":["Chapitre II","Section II.1","Règle 10"],"text":"**Provider.** Gouvernement français\n**Title.** Loi NIS-1 FR\n**Description.** Arrêté du 14 septembre 2018 fixant les règles de sécurité et les délais mentionnés à l'article 10 du décret n° 2018-384 du 23 mai 2018 relatif à la sécurité des réseaux et systèmes d'information des opérateurs de services essentiels et des fournisseurs de service numérique\nhttps:\/\/www.legifrance.gouv.fr\/loda\/id\/JORFTEXT000037444012\/\n\n# Chapitre II\n\n## Section II.1\n\n### Règle 10\n\n- l'opérateur définit les règles de filtrage des flux de données (filtrage sur les adresses réseau, sur les protocoles, sur les numéros de port, etc.) permettant de limiter la circulation des flux aux seuls flux de données nécessaires au fonctionnement et à la sécurité de ses SIE ;\n\n- les flux entrants et sortants des SIE ainsi que les flux entre sous-systèmes des SIE sont filtrés au niveau de leurs interconnexions de manière à ne permettre la circulation que des seuls flux strictement nécessaires au fonctionnement et à la sécurité des SIE. Les flux qui ne sont pas conformes aux règles de filtrage sont bloqués par défaut ;\n\n- l'opérateur établit et tient à jour une liste des règles de filtrage mentionnant l'ensemble des règles en vigueur ou supprimées depuis moins d'un an. Cette liste précise pour chaque règle :\n\n- le motif et la date de la mise en œuvre, de la modification ou de la suppression de la règle ;\n\n- les modalités techniques de mise en œuvre de la règle.\n\nDans le cas particulier d'un SIE nécessaire à la fourniture de service d'interconnexion par appairage pour l'échange de trafic internet, l'opérateur ne met en place de mécanismes de filtrage que pour les flux de données autres que ceux correspondant au trafic internet proprement dit.\n\nL'opérateur décrit dans le dossier d'homologation de chaque SIE les mécanismes de filtrage qu'il met en place."}
{"page":1,"tags":["Chapitre II","Section II.2","Règle 11"],"text":"**Provider.** Gouvernement français\n**Title.** Loi NIS-1 FR\n**Description.** Arrêté du 14 septembre 2018 fixant les règles de sécurité et les délais mentionnés à l'article 10 du décret n° 2018-384 du 23 mai 2018 relatif à la sécurité des réseaux et systèmes d'information des opérateurs de services essentiels et des fournisseurs de service numérique\nhttps:\/\/www.legifrance.gouv.fr\/loda\/id\/JORFTEXT000037444012\/\n\n# Chapitre II\n\n## Section II.2\n\n### Règle 11\n\nL'opérateur de services essentiels crée des comptes (appelés « comptes d'administration ») destinés aux seules personnes (appelées « administrateurs ») chargées d'effectuer les opérations d'administration (installation, configuration, gestion, maintenance, supervision, etc.) des ressources de ses systèmes d'information essentiels (SIE).\n\n- l'attribution des droits aux administrateurs respecte le principe du moindre privilège (seuls les droits strictement nécessaires sont accordés). En particulier, afin de limiter la portée des droits individuels, ils sont attribués à chaque administrateur en les restreignant autant que possible au périmètre fonctionnel et technique dont cet administrateur est responsable ;\n\n- un compte d'administration est utilisé exclusivement pour se connecter à un système d'information d'administration (système d'information utilisé pour les opérations d'administration des ressources) ou à une ressource administrée ;\n\n- les opérations d'administration sont effectuées exclusivement à partir de comptes d'administration, et inversement, les comptes d'administration sont utilisés exclusivement pour les opérations d'administration ;\n\nIl décrit dans le dossier d'homologation du SIE concerné ces mesures ainsi que les raisons techniques ayant empêché l'utilisation d'un compte d'administration ;\n\n- l'opérateur établit et tient à jour la liste des comptes d'administration de ses SIE et les gère en tant que comptes privilégiés."}
{"page":1,"tags":["Chapitre II","Section II.2","Règle 12"],"text":"**Provider.** Gouvernement français\n**Title.** Loi NIS-1 FR\n**Description.** Arrêté du 14 septembre 2018 fixant les règles de sécurité et les délais mentionnés à l'article 10 du décret n° 2018-384 du 23 mai 2018 relatif à la sécurité des réseaux et systèmes d'information des opérateurs de services essentiels et des fournisseurs de service numérique\nhttps:\/\/www.legifrance.gouv.fr\/loda\/id\/JORFTEXT000037444012\/\n\n# Chapitre II\n\n## Section II.2\n\n### Règle 12\n\n- les ressources matérielles et logicielles des systèmes d'information d'administration sont gérées et configurées par l'opérateur ou, le cas échéant, par le prestataire qu'il a mandaté pour réaliser les opérations d'administration ;\n\nCependant, lorsque des raisons techniques ou organisationnelles le justifient, le poste de travail physique de l'administrateur peut être utilisé pour réaliser des opérations autres que des opérations d'administration. Dans ce cas, des mécanismes de durcissement du système d'exploitation du poste de travail et de cloisonnement doivent être mis en place pour permettre d'isoler l'environnement logiciel utilisé pour ces autres opérations de l'environnement logiciel utilisé pour les opérations d'administration ;\n\n- un environnement logiciel utilisé pour effectuer des opérations d'administration ne doit pas être utilisé à d'autres fins, comme l'accès à des sites ou serveurs de messagerie sur internet ;\n\n- un utilisateur ne doit pas se connecter à un système d'information d'administration au moyen d'un environnement logiciel utilisé pour d'autres fonctions que des opérations d'administration ;\n\n- les flux de données associés à des opérations autres que des opérations d'administration doivent, lorsqu'ils transitent sur les systèmes d'information d'administration, être cloisonnés au moyen de mécanismes de chiffrement et d'authentification conformes aux règles préconisées par l'Agence nationale de la sécurité des systèmes d'information ;\n\nCes ressources sont administrées au travers de leur interface d'administration physique.\n\nLorsque des raisons techniques empêchent d'administrer une ressource au travers d'une liaison réseau physique ou de son interface d'administration physique, l'opérateur met en œuvre des mesures de réduction du risque telles que des mesures de sécurité logique.\n\nDans ce cas, il décrit ces mesures et leurs justifications dans le dossier d'homologation du SIE concerné ;\n\nSi le chiffrement et l'authentification de ces flux ne sont pas possibles pour des raisons techniques, l'opérateur met en œuvre des mesures permettant de protéger la confidentialité et l'intégrité de ces flux et de renforcer le contrôle et la traçabilité des opérations d'administration.\n\nDans ce cas, il décrit ces mesures et leurs justifications dans le dossier d'homologation du SIE concerné ;\n\n- les journaux enregistrant les événements générés par les ressources des systèmes d'information d'administration ne contiennent aucun mot de passe ou autre élément secret d'authentification en clair ou sous forme d'empreinte cryptographique."}
{"page":1,"tags":["Chapitre II","Section II.3","Règle 13"],"text":"**Provider.** Gouvernement français\n**Title.** Loi NIS-1 FR\n**Description.** Arrêté du 14 septembre 2018 fixant les règles de sécurité et les délais mentionnés à l'article 10 du décret n° 2018-384 du 23 mai 2018 relatif à la sécurité des réseaux et systèmes d'information des opérateurs de services essentiels et des fournisseurs de service numérique\nhttps:\/\/www.legifrance.gouv.fr\/loda\/id\/JORFTEXT000037444012\/\n\n# Chapitre II\n\n## Section II.3\n\n### Règle 13\n\nL'opérateur de services essentiels crée des comptes individuels pour tous les utilisateurs (y compris les utilisateurs ayant des comptes privilégiés ou des comptes d'administration) et pour les processus automatiques accédant aux ressources de ses systèmes d'information essentiels (SIE).\n\nDans ce cas, l'opérateur décrit ces mesures dans le dossier d'homologation du SIE concerné et les raisons justifiant le recours à des comptes partagés.\n\nPar ailleurs, lorsqu'un service essentiel nécessite de diffuser de l'information au public, l'opérateur n'est pas tenu de créer de comptes pour l'accès du public à cette information.\n\nL'opérateur désactive sans délai les comptes qui ne sont plus nécessaires."}
{"page":1,"tags":["Chapitre II","Section II.3","Règle  14"],"text":"**Provider.** Gouvernement français\n**Title.** Loi NIS-1 FR\n**Description.** Arrêté du 14 septembre 2018 fixant les règles de sécurité et les délais mentionnés à l'article 10 du décret n° 2018-384 du 23 mai 2018 relatif à la sécurité des réseaux et systèmes d'information des opérateurs de services essentiels et des fournisseurs de service numérique\nhttps:\/\/www.legifrance.gouv.fr\/loda\/id\/JORFTEXT000037444012\/\n\n# Chapitre II\n\n## Section II.3\n\n### Règle  14\n\nL'opérateur de services essentiels protège les accès aux ressources de ses systèmes d'information essentiels (SIE), que ce soit par un utilisateur ou par un processus automatique, au moyen d'un mécanisme d'authentification impliquant un élément secret.\n\nL'opérateur définit, conformément à sa politique de sécurité des réseaux et systèmes d'information, les règles de gestion des éléments secrets d'authentification mis en œuvre dans ses SIE.\n\n- l'opérateur doit modifier les éléments secrets d'authentification lorsqu'ils ont été installés par le fabricant ou le fournisseur de la ressource, avant sa mise en service. A cet effet, l'opérateur s'assure auprès du fabricant ou du fournisseur qu'il dispose des moyens et des droits permettant de réaliser ces opérations ;\n\n- l'élément secret d'authentification d'un compte partagé doit être renouvelé régulièrement et à chaque retrait d'un utilisateur de ce compte ;\n\n- les utilisateurs qui n'en ont pas la responsabilité, ne peuvent pas modifier les éléments secrets d'authentification. Ils ne peuvent pas non plus accéder à ces éléments en clair ;\n\n- lorsque les éléments secrets d'authentification sont des mots de passe, les utilisateurs ne doivent pas les réutiliser entre comptes privilégiés ou entre un compte privilégié et un compte non privilégié ;\n\n- lorsque les éléments secrets d'authentification sont des mots de passe, ceux-ci sont conformes aux règles de l'art telles que celles préconisées par l'Agence nationale de la sécurité des systèmes d'information, en matière de complexité (longueur du mot de passe et types de caractères), en tenant compte du niveau de complexité maximal permis par la ressource concernée, et en matière de renouvellement.\n\nL'opérateur décrit dans le dossier d'homologation du SIE concerné ces mesures et les raisons techniques ayant empêché la modification de l'élément secret d'authentification.\n\nPar ailleurs, lorsqu'un service essentiel nécessite de diffuser de l'information au public, l'opérateur n'est pas tenu de mettre en place de mécanismes d'authentification pour l'accès du public à cette information."}
{"page":1,"tags":["Chapitre II","Section II.3","Règle 15"],"text":"**Provider.** Gouvernement français\n**Title.** Loi NIS-1 FR\n**Description.** Arrêté du 14 septembre 2018 fixant les règles de sécurité et les délais mentionnés à l'article 10 du décret n° 2018-384 du 23 mai 2018 relatif à la sécurité des réseaux et systèmes d'information des opérateurs de services essentiels et des fournisseurs de service numérique\nhttps:\/\/www.legifrance.gouv.fr\/loda\/id\/JORFTEXT000037444012\/\n\n# Chapitre II\n\n## Section II.3\n\n### Règle 15\n\n- l'opérateur n'attribue à un utilisateur ou à un processus automatique les droits d'accès à une ressource que si cet accès est strictement nécessaire à l'exercice des missions de l'utilisateur ou au fonctionnement du processus automatique ;\n\n- l'opérateur définit les accès aux différentes fonctionnalités de chaque ressource et en attribue les droits uniquement aux utilisateurs et aux processus automatiques qui en ont strictement le besoin ;\n\n- les droits d'accès sont révisés périodiquement, au moins tous les ans, par l'opérateur. Cette révision porte sur les liens entre les comptes, les droits d'accès associés et les ressources ou les fonctionnalités qui en font l'objet ;\n\nToute modification d'un compte privilégié (ajout, suppression, suspension ou modification des droits associés) fait l'objet d'un contrôle formel de l'opérateur destiné à vérifier que les droits d'accès aux ressources et fonctionnalités sont attribués selon le principe du moindre privilège (seuls les droits strictement nécessaires sont accordés) et en cohérence avec les besoins d'utilisation du compte."}
{"page":1,"tags":["Chapitre II","Section II.4","Règle 16"],"text":"**Provider.** Gouvernement français\n**Title.** Loi NIS-1 FR\n**Description.** Arrêté du 14 septembre 2018 fixant les règles de sécurité et les délais mentionnés à l'article 10 du décret n° 2018-384 du 23 mai 2018 relatif à la sécurité des réseaux et systèmes d'information des opérateurs de services essentiels et des fournisseurs de service numérique\nhttps:\/\/www.legifrance.gouv.fr\/loda\/id\/JORFTEXT000037444012\/\n\n# Chapitre II\n\n## Section II.4\n\n### Règle 16\n\nL'opérateur de services essentiels élabore, tient à jour et met en œuvre une procédure de maintien en conditions de sécurité des ressources matérielles et logicielles de ses systèmes d'information essentiels (SIE), conformément à sa politique de sécurité des réseaux et systèmes d'information.\n\n- l'opérateur se tient informé des vulnérabilités et des mesures correctrices de sécurité susceptibles de concerner les ressources matérielles et logicielles de ses SIE, qui sont diffusées notamment par les fournisseurs ou les fabricants de ces ressources ou par des centres de prévention et d'alerte en matière de cyber sécurité tels que le CERT-FR (centre gouvernemental de veille, d'alerte et de réponse aux attaques informatiques) ;\n\n- sauf en cas de difficultés techniques ou opérationnelles justifiées, l'opérateur installe et maintient toutes les ressources matérielles et logicielles de ses SIE dans des versions supportées par leurs fournisseurs ou leurs fabricants et comportant les mises à jour de sécurité ;\n\n- préalablement à l'installation de toute nouvelle version, l'opérateur s'assure de l'origine de cette version et de son intégrité, et en analyse l'impact sur le SIE concerné d'un point de vue technique et opérationnel ;\n\n- dès qu'il a connaissance d'une mesure correctrice de sécurité concernant une de ses ressources, et sauf en cas de difficultés techniques ou opérationnelles justifiées, l'opérateur en planifie l'installation après avoir effectué les vérifications mentionnées à l'alinéa précédent, et procède à cette installation dans les délais prévus par la procédure de maintien en conditions de sécurité ;\n\nL'opérateur décrit dans le dossier d'homologation du SIE concerné ces mesures de réduction des risques et les raisons techniques ou opérationnelles ayant empêché l'installation d'une version supportée ou d'une mesure correctrice de sécurité."}
{"page":1,"tags":["Chapitre II","Section II.5","Règle  17"],"text":"**Provider.** Gouvernement français\n**Title.** Loi NIS-1 FR\n**Description.** Arrêté du 14 septembre 2018 fixant les règles de sécurité et les délais mentionnés à l'article 10 du décret n° 2018-384 du 23 mai 2018 relatif à la sécurité des réseaux et systèmes d'information des opérateurs de services essentiels et des fournisseurs de service numérique\nhttps:\/\/www.legifrance.gouv.fr\/loda\/id\/JORFTEXT000037444012\/\n\n# Chapitre II\n\n## Section II.5\n\n### Règle  17\n\nCes procédures et mesures portent notamment sur le contrôle du personnel interne et du personnel externe, le contrôle d'accès physique aux SIE et, le cas échéant, la protection des SIE contre les risques environnementaux tels que les catastrophes naturelles."}
{"page":1,"tags":["Chapitre III","Section III.1","Règle 18"],"text":"**Provider.** Gouvernement français\n**Title.** Loi NIS-1 FR\n**Description.** Arrêté du 14 septembre 2018 fixant les règles de sécurité et les délais mentionnés à l'article 10 du décret n° 2018-384 du 23 mai 2018 relatif à la sécurité des réseaux et systèmes d'information des opérateurs de services essentiels et des fournisseurs de service numérique\nhttps:\/\/www.legifrance.gouv.fr\/loda\/id\/JORFTEXT000037444012\/\n\n# Chapitre III\n\n## Section III.1\n\n### Règle 18\n\nL'opérateur de services essentiels élabore, tient à jour et met en œuvre, conformément à sa politique de sécurité des réseaux et systèmes d'information, une procédure de détection des incidents de sécurité affectant ses systèmes d'information essentiels (SIE).\n\nLes mesures organisationnelles comprennent les modalités d'exploitation des dispositifs de détection et décrivent la chaîne de traitement des événements de sécurité identifiés par ces dispositifs.\n\nLes mesures techniques précisent la nature et le positionnement des dispositifs de détection.\n\n- collectent les données pertinentes sur le fonctionnement de chaque SIE (notamment des données « réseau » ou des données « système ») à partir de capteurs positionnés de manière à identifier les événements de sécurité liés à l'ensemble des flux de données échangés entre les SIE et les systèmes d'information tiers à ceux de l'opérateur ;\n\n- analysent les données issues des capteurs notamment en recherchant des marqueurs techniques d'attaques connus, dans le but d'identifier les événements de sécurité et de les caractériser ;\n\n- archivent les métadonnées des événements identifiés afin de permettre une recherche a posteriori de marqueurs techniques d'attaques ou de compromission sur une durée d'au moins six mois.\n\nDans le cas particulier d'un SIE nécessaire à la fourniture de service d'interconnexion par appairage pour l'échange de trafic internet, l'opérateur ne met en œuvre de dispositifs de détection que pour les flux de données autres que ceux correspondant au trafic internet proprement dit.\n\nL'opérateur ou le prestataire mandaté à cet effet exploite les dispositifs de détection en s'appuyant sur les exigences du référentiel en matière de détection des incidents de sécurité pris en application de l'article 10 du décret n° 2015-350 du 27 mars 2015 modifié relatif à la qualification des produits de sécurité et des prestataires de service de confiance pour les besoins de la sécurité des systèmes d'information.\n\nL'opérateur veille en particulier à ce que l'installation et l'exploitation des dispositifs de détection n'affectent pas la sécurité et le fonctionnement de ses SIE."}
{"page":1,"tags":["Chapitre III","Section III.1","Règle 19"],"text":"**Provider.** Gouvernement français\n**Title.** Loi NIS-1 FR\n**Description.** Arrêté du 14 septembre 2018 fixant les règles de sécurité et les délais mentionnés à l'article 10 du décret n° 2018-384 du 23 mai 2018 relatif à la sécurité des réseaux et systèmes d'information des opérateurs de services essentiels et des fournisseurs de service numérique\nhttps:\/\/www.legifrance.gouv.fr\/loda\/id\/JORFTEXT000037444012\/\n\n# Chapitre III\n\n## Section III.1\n\n### Règle 19\n\nL'opérateur de services essentiels met en œuvre sur chaque système d'information essentiel (SIE) un système de journalisation qui enregistre les événements relatifs à l'authentification des utilisateurs, à la gestion des comptes et des droits d'accès, à l'accès aux ressources, aux modifications des règles de sécurité du SIE ainsi qu'au fonctionnement du SIE. Le système de journalisation contribue à la détection d'incidents de sécurité en collectant les données de journalisation.\n\nles serveurs applicatifs supportant les services essentiels ;\n\nles serveurs d'infrastructure système ;\n\nles serveurs d'infrastructure réseau ;\n\nles équipements de sécurité ;\n\nles postes d'ingénierie et de maintenance des systèmes industriels ;\n\nles équipements réseau ;\n\nles postes d'administration.\n\nIls sont, pour chaque SIE, centralisés et archivés pendant une durée d'au moins six mois.\n\nLe format d'archivage des événements permet de réaliser des recherches automatisées sur ces événements."}
{"page":1,"tags":["Chapitre III","Section III.1","Règle  20"],"text":"**Provider.** Gouvernement français\n**Title.** Loi NIS-1 FR\n**Description.** Arrêté du 14 septembre 2018 fixant les règles de sécurité et les délais mentionnés à l'article 10 du décret n° 2018-384 du 23 mai 2018 relatif à la sécurité des réseaux et systèmes d'information des opérateurs de services essentiels et des fournisseurs de service numérique\nhttps:\/\/www.legifrance.gouv.fr\/loda\/id\/JORFTEXT000037444012\/\n\n# Chapitre III\n\n## Section III.1\n\n### Règle  20\n\nL'opérateur de services essentiels met en œuvre un système de corrélation et d'analyse de journaux qui exploite les événements enregistrés par le système de journalisation installé sur chacun des systèmes d'information essentiels (SIE), afin de détecter des événements susceptibles d'affecter la sécurité des SIE. Le système de corrélation et d'analyse de journaux contribue à la détection d'incidents de sécurité en analysant les données de journalisation.\n\nLe système de corrélation et d'analyse de journaux est installé et exploité sur un système d'information mis en place exclusivement à des fins de détection d'événements susceptibles d'affecter la sécurité des systèmes d'information.\n\nL'opérateur ou le prestataire mandaté à cet effet installe et exploite ce système de corrélation et d'analyse de journaux en s'appuyant sur les exigences du référentiel en matière de détection des incidents de sécurité pris en application de l'article 10 du décret n° 2015-350 du 27 mars 2015 modifié relatif à la qualification des produits de sécurité et des prestataires de service de confiance pour les besoins de la sécurité des systèmes d'information."}
{"page":1,"tags":["Chapitre III","Section III.2","Règle 21"],"text":"**Provider.** Gouvernement français\n**Title.** Loi NIS-1 FR\n**Description.** Arrêté du 14 septembre 2018 fixant les règles de sécurité et les délais mentionnés à l'article 10 du décret n° 2018-384 du 23 mai 2018 relatif à la sécurité des réseaux et systèmes d'information des opérateurs de services essentiels et des fournisseurs de service numérique\nhttps:\/\/www.legifrance.gouv.fr\/loda\/id\/JORFTEXT000037444012\/\n\n# Chapitre III\n\n## Section III.2\n\n### Règle 21\n\nL'opérateur de services essentiels élabore, tient à jour et met en œuvre, conformément à sa politique de sécurité des réseaux et systèmes d'information, une procédure de traitement des incidents de sécurité affectant ses systèmes d'information essentiels (SIE).\n\nL'opérateur ou le prestataire mandaté à cet effet procède au traitement des incidents en s'appuyant sur les exigences du référentiel en matière de réponse aux incidents de sécurité pris en application de l'article 10 du décret n° 2015-350 du 27 mars 2015 modifié relatif à la qualification des produits de sécurité et des prestataires de service de confiance pour les besoins de la sécurité des systèmes d'information.\n\nUn système d'information spécifique doit être mis en place pour traiter les incidents, notamment pour stocker les relevés techniques relatifs aux analyses des incidents. Ce système est cloisonné vis-à-vis du SIE concerné par l'incident.\n\nL'opérateur conserve les relevés techniques relatifs aux analyses des incidents pendant une durée d'au moins six mois. Il tient ces relevés techniques à la disposition de l'Agence nationale de la sécurité des systèmes d'information."}
{"page":1,"tags":["Chapitre III","Section III.2","Règle 22"],"text":"**Provider.** Gouvernement français\n**Title.** Loi NIS-1 FR\n**Description.** Arrêté du 14 septembre 2018 fixant les règles de sécurité et les délais mentionnés à l'article 10 du décret n° 2018-384 du 23 mai 2018 relatif à la sécurité des réseaux et systèmes d'information des opérateurs de services essentiels et des fournisseurs de service numérique\nhttps:\/\/www.legifrance.gouv.fr\/loda\/id\/JORFTEXT000037444012\/\n\n# Chapitre III\n\n## Section III.2\n\n### Règle 22\n\nIl met en œuvre une procédure pour traiter les informations ainsi reçues et le cas échéant prendre les mesures de sécurité nécessaires à la protection de ses systèmes d'information essentiels (SIE).\n\nL'opérateur communique à l'Agence nationale de la sécurité des systèmes d'information les coordonnées (nom du service, numéro de téléphone et adresse électronique) tenues à jour du service prévu à l'alinéa précédent."}
{"page":1,"tags":["Chapitre IV","Règle  23"],"text":"**Provider.** Gouvernement français\n**Title.** Loi NIS-1 FR\n**Description.** Arrêté du 14 septembre 2018 fixant les règles de sécurité et les délais mentionnés à l'article 10 du décret n° 2018-384 du 23 mai 2018 relatif à la sécurité des réseaux et systèmes d'information des opérateurs de services essentiels et des fournisseurs de service numérique\nhttps:\/\/www.legifrance.gouv.fr\/loda\/id\/JORFTEXT000037444012\/\n\n# Chapitre IV\n\n## Règle  23\n\nL'opérateur de services essentiels élabore, tient à jour et met en œuvre, conformément à sa politique de sécurité des réseaux et systèmes d'information, une procédure de gestion de crises en cas d'incidents de sécurité ayant un impact majeur sur les services essentiels de l'opérateur.\n\n- à proscrire l'utilisation de supports de stockage amovibles ou la connexion d'équipements nomades aux SIE ;\n\n- à installer une mesure correctrice de sécurité sur un SIE particulier ;\n\n- à restreindre le routage ;\n\n- à effectuer des restrictions d'accès sous forme de listes blanches et de listes noires d'utilisateurs ;\n\n- à bloquer les échanges de fichiers d'un type particulier ;\n\n- à isoler de tout réseau des sites internet, des applications, ou des équipements informatiques de l'opérateur ;\n\n- isoler du réseau internet les SIE de l'opérateur. Cette mesure impose de déconnecter physiquement ou logiquement les interfaces réseau des SIE concernés.\n\nLa procédure précise les conditions dans lesquelles ces mesures peuvent être appliquées compte tenu des contraintes techniques et organisationnelles de mise en œuvre."}
