{"page":1,"tags":["IDENTIFY-P","Inventory and Mapping"],"text":"Systems\/products\/services that process data are inventoried."}
{"page":1,"tags":["IDENTIFY-P","Inventory and Mapping"],"text":"Owners or operators (e.g., the organization or third parties such as service providers, partners, customers, and developers) and their roles with respect to the systems\/products\/services and components (e.g., internal or external) that process data are inventoried."}
{"page":1,"tags":["IDENTIFY-P","Inventory and Mapping"],"text":"Categories of individuals (e.g., customers, employees or prospective employees, consumers) whose data are being processed are inventoried."}
{"page":1,"tags":["IDENTIFY-P","Inventory and Mapping"],"text":"Data actions of the systems\/products\/services are inventoried."}
{"page":1,"tags":["IDENTIFY-P","Inventory and Mapping"],"text":"The purposes for the data actions are inventoried."}
{"page":1,"tags":["IDENTIFY-P","Inventory and Mapping"],"text":"Data elements within the data actions are inventoried."}
{"page":1,"tags":["IDENTIFY-P","Inventory and Mapping"],"text":"The data processing environment is identified (e.g., geographic location, internal, cloud, third parties)."}
{"page":1,"tags":["IDENTIFY-P","Inventory and Mapping"],"text":"Data processing is mapped, illustrating the data actions and associated data elements for systems\/products\/services, including components; roles of the component owners\/operators; and interactions of individuals or third parties with the systems\/products\/services."}
{"page":1,"tags":["IDENTIFY-P","Business Environment"],"text":"The organization’s role(s) in the data processing ecosystem are identified and communicated."}
{"page":1,"tags":["IDENTIFY-P","Business Environment"],"text":"Priorities for organizational mission, objectives, and activities are established and communicated."}
{"page":1,"tags":["IDENTIFY-P","Business Environment"],"text":"Systems\/products\/services that support organizational priorities are identified and key requirements communicated."}
{"page":1,"tags":["IDENTIFY-P","Risk Assessment"],"text":"Contextual factors related to the systems\/products\/services and the data actions are identified (e.g., individuals’ demographics and privacy interests or perceptions, data sensitivity and\/or types, visibility of data processing to individuals and third parties)."}
{"page":1,"tags":["IDENTIFY-P","Risk Assessment"],"text":"Data analytic inputs and outputs are identified and evaluated for bias."}
{"page":1,"tags":["IDENTIFY-P","Risk Assessment"],"text":"Potential problematic data actions and associated problems are identified."}
{"page":1,"tags":["IDENTIFY-P","Risk Assessment"],"text":"Problematic data actions, likelihoods, and impacts are used to determine and prioritize risk."}
{"page":1,"tags":["IDENTIFY-P","Risk Assessment"],"text":"Risk responses are identified, prioritized, and implemented."}
{"page":1,"tags":["IDENTIFY-P","Data Processing Ecosystem Risk Management"],"text":"Data processing ecosystem risk management policies, processes, and procedures are identified, established, assessed, managed, and agreed to by organizational stakeholders."}
{"page":1,"tags":["IDENTIFY-P","Data Processing Ecosystem Risk Management"],"text":"Data processing ecosystem parties (e.g., service providers, customers, partners, product manufacturers, application developers) are identified, prioritized, and assessed using a privacy risk assessment process."}
{"page":1,"tags":["IDENTIFY-P","Data Processing Ecosystem Risk Management"],"text":"Contracts with data processing ecosystem parties are used to implement appropriate measures designed to meet the objectives of an organization’s privacy program."}
{"page":1,"tags":["IDENTIFY-P","Data Processing Ecosystem Risk Management"],"text":"Interoperability frameworks or similar multi-party approaches are used to manage data processing ecosystem privacy risks."}
{"page":1,"tags":["IDENTIFY-P","Data Processing Ecosystem Risk Management"],"text":"Data processing ecosystem parties are routinely assessed using audits, test results, or other forms of evaluations to confirm they are meeting their contractual, interoperability framework, or other obligations."}
{"page":1,"tags":["GOVERN-P","Governance Policies, Processes, and Procedures"],"text":"Organizational privacy values and policies (e.g., conditions on data processing such as data uses or retention periods, individuals’ prerogatives with respect to data processing) are established and communicated."}
{"page":1,"tags":["GOVERN-P","Governance Policies, Processes, and Procedures"],"text":"Processes to instill organizational privacy values within system\/product\/service development and operations are established and in place."}
{"page":1,"tags":["GOVERN-P","Governance Policies, Processes, and Procedures"],"text":"Roles and responsibilities for the workforce are established with respect to privacy."}
{"page":1,"tags":["GOVERN-P","Governance Policies, Processes, and Procedures"],"text":"Privacy roles and responsibilities are coordinated and aligned with third-party stakeholders (e.g., service providers, customers, partners)."}
{"page":1,"tags":["GOVERN-P","Governance Policies, Processes, and Procedures"],"text":"Legal, regulatory, and contractual requirements regarding privacy are understood and managed."}
{"page":1,"tags":["GOVERN-P","Governance Policies, Processes, and Procedures"],"text":"Governance and risk management policies, processes, and procedures address privacy risks."}
{"page":1,"tags":["GOVERN-P","Risk Management Strategy"],"text":"Risk management processes are established, managed, and agreed to by organizational stakeholders."}
{"page":1,"tags":["GOVERN-P","Risk Management Strategy"],"text":"Organizational risk tolerance is determined and clearly expressed."}
{"page":1,"tags":["GOVERN-P","Risk Management Strategy"],"text":"The organization’s determination of risk tolerance is informed by its role(s) in the data processing ecosystem."}
{"page":1,"tags":["GOVERN-P","Awareness and Training"],"text":"The workforce is informed and trained on its roles and responsibilities."}
{"page":1,"tags":["GOVERN-P","Awareness and Training"],"text":"Senior executives understand their roles and responsibilities."}
{"page":1,"tags":["GOVERN-P","Awareness and Training"],"text":"Privacy personnel understand their roles and responsibilities."}
{"page":1,"tags":["GOVERN-P","Awareness and Training"],"text":"Third parties (e.g., service providers, customers, partners) understand their roles and responsibilities."}
{"page":1,"tags":["GOVERN-P","Monitoring and Review"],"text":"Privacy risk is re-evaluated on an ongoing basis and as key factors, including the organization’s business environment (e.g., introduction of new technologies), governance (e.g., legal obligations, risk tolerance), data processing, and systems\/products\/services change."}
{"page":1,"tags":["GOVERN-P","Monitoring and Review"],"text":"Privacy values, policies, and training are reviewed and any updates are communicated."}
{"page":1,"tags":["GOVERN-P","Monitoring and Review"],"text":"Policies, processes, and procedures for assessing compliance with legal requirements and privacy policies are established and in place."}
{"page":1,"tags":["GOVERN-P","Monitoring and Review"],"text":"Policies, processes, and procedures for communicating progress on managing privacy risks are established and in place."}
{"page":1,"tags":["GOVERN-P","Monitoring and Review"],"text":"Policies, processes, and procedures are established and in place to receive, analyze, and respond to problematic data actions disclosed to the organization from internal and external sources (e.g., internal discovery, privacy researchers, professional events)."}
{"page":1,"tags":["GOVERN-P","Monitoring and Review"],"text":"Policies, processes, and procedures incorporate lessons learned from problematic data actions."}
{"page":1,"tags":["GOVERN-P","Monitoring and Review"],"text":"Policies, processes, and procedures for receiving, tracking, and responding to complaints, concerns, and questions from individuals about organizational privacy practices are established and in place."}
{"page":1,"tags":["CONTROL-P","Data Processing Policies, Processes, and Procedures"],"text":"Policies, processes, and procedures for authorizing data processing (e.g., organizational decisions, individual consent), revoking authorizations, and maintaining authorizations are established and in place."}
{"page":1,"tags":["CONTROL-P","Data Processing Policies, Processes, and Procedures"],"text":"Policies, processes, and procedures for enabling data review, transfer, sharing or disclosure, alteration, and deletion are established and in place (e.g., to maintain data quality, manage data retention)."}
{"page":1,"tags":["CONTROL-P","Data Processing Policies, Processes, and Procedures"],"text":"Policies, processes, and procedures for enabling individuals’ data processing preferences and requests are established and in place."}
{"page":1,"tags":["CONTROL-P","Data Processing Policies, Processes, and Procedures"],"text":"A data life cycle to manage data is aligned and implemented with the system development life cycle to manage systems."}
{"page":1,"tags":["CONTROL-P","Data Processing Management"],"text":"Data elements can be accessed for review."}
{"page":1,"tags":["CONTROL-P","Data Processing Management"],"text":"Data elements can be accessed for transmission or disclosure."}
{"page":1,"tags":["CONTROL-P","Data Processing Management"],"text":"Data elements can be accessed for alteration."}
{"page":1,"tags":["CONTROL-P","Data Processing Management"],"text":"Data elements can be accessed for deletion."}
{"page":1,"tags":["CONTROL-P","Data Processing Management"],"text":"Data are destroyed according to policy."}
{"page":1,"tags":["CONTROL-P","Data Processing Management"],"text":"Data are transmitted using standardized formats."}
{"page":1,"tags":["CONTROL-P","Data Processing Management"],"text":"Mechanisms for transmitting processing permissions and related data values with data elements are established and in place."}
{"page":1,"tags":["CONTROL-P","Data Processing Management"],"text":"Audit\/log records are determined, documented, implemented, and reviewed in accordance with policy and incorporating the principle of data minimization."}
{"page":1,"tags":["CONTROL-P","Data Processing Management"],"text":"Technical measures implemented to manage data processing are tested and assessed."}
{"page":1,"tags":["CONTROL-P","Data Processing Management"],"text":"Stakeholder privacy preferences are included in algorithmic design objectives and outputs are evaluated against these preferences."}
{"page":1,"tags":["CONTROL-P","Disassociated Processing"],"text":"Data are processed to limit observability and linkability (e.g., data actions take place on local devices, privacy-preserving cryptography)."}
{"page":1,"tags":["CONTROL-P","Disassociated Processing"],"text":"Data are processed to limit the identification of individuals (e.g., de-identification privacy techniques, tokenization)."}
{"page":1,"tags":["CONTROL-P","Disassociated Processing"],"text":"Data are processed to limit the formulation of inferences about individuals’ behavior or activities (e.g., data processing is decentralized, distributed architectures)."}
{"page":1,"tags":["CONTROL-P","Disassociated Processing"],"text":"System or device configurations permit selective collection or disclosure of data elements."}
{"page":1,"tags":["CONTROL-P","Disassociated Processing"],"text":"Attribute references are substituted for attribute values."}
{"page":1,"tags":["COMMUNICATE-P","Communication Policies, Processes, and Procedures"],"text":"Transparency policies, processes, and procedures for communicating data processing purposes, practices, and associated privacy risks are established and in place."}
{"page":1,"tags":["COMMUNICATE-P","Communication Policies, Processes, and Procedures"],"text":"Roles and responsibilities (e.g., public relations) for communicating data processing purposes, practices, and associated privacy risks are established."}
{"page":1,"tags":["COMMUNICATE-P","Data Processing Awareness"],"text":"Mechanisms (e.g., notices, internal or public reports) for communicating data processing purposes, practices, associated privacy risks, and options for enabling individuals’ data processing preferences and requests are established and in place."}
{"page":1,"tags":["COMMUNICATE-P","Data Processing Awareness"],"text":"Mechanisms for obtaining feedback from individuals (e.g., surveys or focus groups) about data processing and associated privacy risks are established and in place."}
{"page":1,"tags":["COMMUNICATE-P","Data Processing Awareness"],"text":"System\/product\/service design enables data processing visibility."}
{"page":1,"tags":["COMMUNICATE-P","Data Processing Awareness"],"text":"Records of data disclosures and sharing are maintained and can be accessed for review or transmission\/disclosure."}
{"page":1,"tags":["COMMUNICATE-P","Data Processing Awareness"],"text":"Data corrections or deletions can be communicated to individuals or organizations (e.g., data sources) in the data processing ecosystem."}
{"page":1,"tags":["COMMUNICATE-P","Data Processing Awareness"],"text":"Data provenance and lineage are maintained and can be accessed for review or transmission\/disclosure."}
{"page":1,"tags":["COMMUNICATE-P","Data Processing Awareness"],"text":"Impacted individuals and organizations are notified about a privacy breach or event."}
{"page":1,"tags":["COMMUNICATE-P","Data Processing Awareness"],"text":"Individuals are provided with mitigation mechanisms (e.g., credit monitoring, consent withdrawal, data alteration or deletion) to address impacts of problematic data actions."}
{"page":1,"tags":["PROTECT-P","Data Protection Policies, Processes, and Procedures"],"text":"A baseline configuration of information technology is created and maintained incorporating security principles (e.g., concept of least functionality)."}
{"page":1,"tags":["PROTECT-P","Data Protection Policies, Processes, and Procedures"],"text":"Configuration change control processes are established and in place."}
{"page":1,"tags":["PROTECT-P","Data Protection Policies, Processes, and Procedures"],"text":"Backups of information are conducted, maintained, and tested."}
{"page":1,"tags":["PROTECT-P","Data Protection Policies, Processes, and Procedures"],"text":"Policy and regulations regarding the physical operating environment for organizational assets are met."}
{"page":1,"tags":["PROTECT-P","Data Protection Policies, Processes, and Procedures"],"text":"Protection processes are improved."}
{"page":1,"tags":["PROTECT-P","Data Protection Policies, Processes, and Procedures"],"text":"Effectiveness of protection technologies is shared."}
{"page":1,"tags":["PROTECT-P","Data Protection Policies, Processes, and Procedures"],"text":"Response plans (Incident Response and Business Continuity) and recovery plans (Incident Recovery and Disaster Recovery) are established, in place, and managed."}
{"page":1,"tags":["PROTECT-P","Data Protection Policies, Processes, and Procedures"],"text":"Response and recovery plans are tested."}
{"page":1,"tags":["PROTECT-P","Data Protection Policies, Processes, and Procedures"],"text":"Privacy procedures are included in human resources practices (e.g., deprovisioning, personnel screening)."}
{"page":1,"tags":["PROTECT-P","Data Protection Policies, Processes, and Procedures"],"text":"A vulnerability management plan is developed and implemented."}
{"page":1,"tags":["PROTECT-P","Identity Management, Authentication, and Access Control"],"text":"Identities and credentials are issued, managed, verified, revoked, and audited for authorized individuals, processes, and devices."}
{"page":1,"tags":["PROTECT-P","Identity Management, Authentication, and Access Control"],"text":"Physical access to data and devices is managed."}
{"page":1,"tags":["PROTECT-P","Identity Management, Authentication, and Access Control"],"text":"Remote access is managed."}
{"page":1,"tags":["PROTECT-P","Identity Management, Authentication, and Access Control"],"text":"Access permissions and authorizations are managed, incorporating the principles of least privilege and separation of duties."}
{"page":1,"tags":["PROTECT-P","Identity Management, Authentication, and Access Control"],"text":"Network integrity is protected (e.g., network segregation, network segmentation)."}
{"page":1,"tags":["PROTECT-P","Identity Management, Authentication, and Access Control"],"text":"Individuals and devices are proofed and bound to credentials, and authenticated commensurate with the risk of the transaction (e.g., individuals’ security and privacy risks and other organizational risks)."}
{"page":1,"tags":["PROTECT-P","Data Security"],"text":"Data-at-rest are protected."}
{"page":1,"tags":["PROTECT-P","Data Security"],"text":"Data-in-transit are protected."}
{"page":1,"tags":["PROTECT-P","Data Security"],"text":"Systems\/products\/services and associated data are formally managed throughout removal, transfers, and disposition."}
{"page":1,"tags":["PROTECT-P","Data Security"],"text":"Adequate capacity to ensure availability is maintained."}
{"page":1,"tags":["PROTECT-P","Data Security"],"text":"Protections against data leaks are implemented."}
{"page":1,"tags":["PROTECT-P","Data Security"],"text":"Integrity checking mechanisms are used to verify software, firmware, and information integrity."}
{"page":1,"tags":["PROTECT-P","Data Security"],"text":"The development and testing environment(s) are separate from the production environment."}
{"page":1,"tags":["PROTECT-P","Data Security"],"text":"Integrity checking mechanisms are used to verify hardware integrity."}
{"page":1,"tags":["PROTECT-P","Maintenance"],"text":"Maintenance and repair of organizational assets are performed and logged, with approved and controlled tools."}
{"page":1,"tags":["PROTECT-P","Maintenance"],"text":"Remote maintenance of organizational assets is approved, logged, and performed in a manner that prevents unauthorized access."}
{"page":1,"tags":["PROTECT-P","Protective Technology"],"text":"Removable media is protected and its use restricted according to policy."}
{"page":1,"tags":["PROTECT-P","Protective Technology"],"text":"The principle of least functionality is incorporated by configuring systems to provide only essential capabilities."}
{"page":1,"tags":["PROTECT-P","Protective Technology"],"text":"Communications and control networks are protected."}
{"page":1,"tags":["PROTECT-P","Protective Technology"],"text":"Mechanisms (e.g., failsafe, load balancing, hot swap) are implemented to achieve resilience requirements in normal and adverse situations."}
