{"page":1,"tags":["Access Control","Account Management"],"text":"a.\tDefine the types of system accounts allowed and prohibited.\nb.\tCreate, enable, modify, disable, and remove system accounts in accordance with policy, procedures, prerequisites, and criteria.\nc.\tSpecify:\n1.\tAuthorized users of the system,\n2.\tGroup and role membership, and\n3.\tAccess authorizations (i.e., privileges) for each account.\nd.\tAuthorize access to the system based on:\n1.\tA valid access authorization and\n2.\tIntended system usage.\ne.\tMonitor the use of system accounts.\nf.\tDisable system accounts when: \n1.\tThe accounts have expired,\n2.\tThe accounts have been inactive for [Assignment: organization-defined time period],\n3.\tThe accounts are no longer associated with a user or individual,\n4.\tThe accounts are in violation of organizational policy, or\n5.\tSignificant risks associated with individuals are discovered.\ng.\tNotify account managers and designated personnel or roles within:\n1.\t[Assignment: organization-defined time period] when accounts are no longer required.\n2.\t[Assignment: organization-defined time period] when users are terminated or transferred.\n3.\t[Assignment: organization-defined time period] when system usage or the need-to-know changes for an individual.\nh.\tRequire that users log out of the system after [Assignment: organization-defined time period] of expected inactivity or when [Assignment: organization-defined circumstances]."}
{"page":1,"tags":["Access Control","Access Enforcement"],"text":"Enforce approved authorizations for logical access to CUI and system resources in accordance with applicable access control policies."}
{"page":1,"tags":["Access Control","Information Flow Enforcement"],"text":"Enforce approved authorizations for controlling the flow of CUI within the system and between connected systems."}
{"page":1,"tags":["Access Control","Separation of Duties"],"text":"a.\tIdentify the duties of individuals requiring separation.\nb.\tDefine system access authorizations to support separation of duties."}
{"page":1,"tags":["Access Control","Least Privilege"],"text":"a.\tAllow only authorized system access for users (or processes acting on behalf of users) that is necessary to accomplish assigned organizational tasks.\nb.\tAuthorize access to [Assignment: organization-defined security functions] and [Assignment: organization-defined security-relevant information].\nc.\tReview the privileges assigned to roles or classes of users [Assignment: organization-defined frequency] to validate the need for such privileges.\nd.\tReassign or remove privileges, as necessary."}
{"page":1,"tags":["Access Control","Least Privilege – Privileged Accounts"],"text":"a.\tRestrict privileged accounts on the system to [Assignment: organization-defined personnel or roles].\nb.\tRequire that users (or roles) with privileged accounts use non-privileged accounts when accessing non-security functions or non-security information."}
{"page":1,"tags":["Access Control","Least Privilege – Privileged Functions"],"text":"a.\tPrevent non-privileged users from executing privileged functions.\nb.\tLog the execution of privileged functions."}
{"page":1,"tags":["Access Control","Unsuccessful Logon Attempts"],"text":"a.\tEnforce a limit of [Assignment: organization-defined number] consecutive invalid logon attempts by a user during a [Assignment: organization-defined time period].\nb.\tAutomatically [Selection (one or more): lock the account or node for an [Assignment: organization-defined time period]; lock the account or node until released by an administrator; delay next logon prompt; notify system administrator; take other action] when the maximum number of unsuccessful attempts is exceeded."}
{"page":1,"tags":["Access Control","System Use Notification"],"text":"Display a system use notification message with privacy and security notices consistent with applicable CUI rules before granting access to the system."}
{"page":1,"tags":["Access Control","Device Lock"],"text":"a.\tPrevent access to the system by [Selection (one or more): initiating a device lock after [Assignment: organization-defined time period] of inactivity; requiring the user to initiate a device lock before leaving the system unattended].\nb.\tRetain the device lock until the user reestablishes access using established identification and authentication procedures.\nc.\tConceal, via the device lock, information previously visible on the display with a publicly viewable image."}
{"page":1,"tags":["Access Control","Session Termination"],"text":"Terminate a user session automatically after [Assignment: organization-defined conditions or trigger events requiring session disconnect]."}
{"page":1,"tags":["Access Control","Remote Access"],"text":"a.\tEstablish usage restrictions, configuration requirements, and connection requirements for each type of allowable remote system access.\nb.\tAuthorize each type of remote system access prior to establishing such connections.\nc.\tRoute remote access to the system through authorized and managed access control points.\nd.\tAuthorize the remote execution of privileged commands and remote access to security-relevant information."}
{"page":1,"tags":["Access Control","Wireless Access"],"text":"a.\tEstablish usage restrictions, configuration requirements, and connection requirements for each type of wireless access to the system.\nb.\tAuthorize each type of wireless access to the system prior to establishing such connections.\nc.\tDisable, when not intended for use, wireless networking capabilities prior to issuance and deployment.\nd.\tProtect wireless access to the system using authentication and encryption."}
{"page":1,"tags":["Access Control","Access Control for Mobile Devices"],"text":"a.\tEstablish usage restrictions, configuration requirements, and connection requirements for mobile devices.\nb.\tAuthorize the connection of mobile devices to the system.\nc.\tImplement full-device or container-based encryption to protect the confidentiality of CUI on mobile devices."}
{"page":1,"tags":["Access Control","Use of External Systems"],"text":"a.\tProhibit the use of external systems unless the systems are specifically authorized.\nb.\tEstablish the following security requirements to be satisfied on external systems prior to allowing use of or access to those systems by authorized individuals: [Assignment: organization-defined security requirements].\nc.\tPermit authorized individuals to use external systems to access the organizational system or to process, store, or transmit CUI only after:\n1.\tVerifying that the security requirements on the external systems as specified in the organization’s system security plans have been satisfied and\n2.\tRetaining approved system connection or processing agreements with the organizational entities hosting the external systems.\nd.\tRestrict the use of organization-controlled portable storage devices by authorized individuals on external systems."}
{"page":1,"tags":["Access Control","Publicly Accessible Content"],"text":"a.\tTrain authorized individuals to ensure that publicly accessible information does not contain CUI.\nb.\tReview the content on publicly accessible systems for CUI and remove such information, if discovered."}
{"page":1,"tags":["Awareness and Training","Literacy Training and Awareness"],"text":"a.\tProvide security literacy training to system users:\n1.\tAs part of initial training for new users and [Assignment: organization-defined frequency] thereafter,\n2.\tWhen required by system changes or following [Assignment: organization-defined events], and\n3.\tOn recognizing and reporting indicators of insider threat, social engineering, and social mining.\nb.\tUpdate security literacy training content [Assignment: organization-defined frequency] and following [Assignment: organization-defined events]. "}
{"page":1,"tags":["Awareness and Training","Role-Based Training"],"text":"a.\tProvide role-based security training to organizational personnel:\n1.\tBefore authorizing access to the system or CUI, before performing assigned duties, and [Assignment: organization-defined frequency] thereafter.\n2.\tWhen required by system changes or following [Assignment: organization-defined events].\nb.\tUpdate role-based training content [Assignment: organization-defined frequency] and following [Assignment: organization-defined events]."}
{"page":1,"tags":["Audit and Accountability","Event Logging"],"text":"a.\tSpecify the following event types selected for logging within the system: [Assignment: organization-defined event types].\nb.\tReview and update the event types selected for logging [Assignment: organization-defined frequency]. "}
{"page":1,"tags":["Audit and Accountability","Audit Record Content"],"text":"a.\tInclude the following content in audit records: \n1.\tWhat type of event occurred\n2.\tWhen the event occurred\n3.\tWhere the event occurred\n4.\tSource of the event\n5.\tOutcome of the event\n6.\tIdentity of the individuals, subjects, objects, or entities associated with the event\nb.\tProvide additional information for audit records as needed."}
{"page":1,"tags":["Audit and Accountability","Audit Record Generation"],"text":"a.\tGenerate audit records for the selected event types and audit record content specified in 03.03.01 and 03.03.02.\nb.\tRetain audit records for a time period consistent with the records retention policy."}
{"page":1,"tags":["Audit and Accountability","Response to Audit Logging Process Failures"],"text":"a.\tAlert organizational personnel or roles within [Assignment: organization-defined time period] in the event of an audit logging process failure.\nb.\tTake the following additional actions: [Assignment: organization-defined additional actions]."}
{"page":1,"tags":["Audit and Accountability","Audit Record Review, Analysis, and Reporting"],"text":"a.\tReview and analyze system audit records [Assignment: organization-defined frequency] for indications and the potential impact of inappropriate or unusual activity.\nb.\tReport findings to organizational personnel or roles.\nc.\tAnalyze and correlate audit records across different repositories to gain organization-wide situational awareness."}
{"page":1,"tags":["Audit and Accountability","Audit Record Reduction and Report Generation"],"text":"a.\tImplement an audit record reduction and report generation capability that supports audit record review, analysis, reporting requirements, and after-the-fact investigations of incidents.\nb.\tPreserve the original content and time ordering of audit records."}
{"page":1,"tags":["Audit and Accountability","Time Stamps"],"text":"a.\tUse internal system clocks to generate time stamps for audit records.\nb.\tRecord time stamps for audit records that meet [Assignment: organization-defined granularity of time measurement] and that use Coordinated Universal Time (UTC), have a fixed local time offset from UTC, or include the local time offset as part of the time stamp."}
{"page":1,"tags":["Audit and Accountability","Protection of Audit Information"],"text":"a.\tProtect audit information and audit logging tools from unauthorized access, modification, and deletion.\nb.\tAuthorize access to management of audit logging functionality to only a subset of privileged users or roles."}
{"page":1,"tags":["Configuration Management","Baseline Configuration"],"text":"a.\tDevelop and maintain under configuration control, a current baseline configuration of the system.\nb.\tReview and update the baseline configuration of the system [Assignment: organization-defined frequency] and when system components are installed or modified."}
{"page":1,"tags":["Configuration Management","Configuration Settings"],"text":"a.\tEstablish, document, and implement the following configuration settings for the system that reflect the most restrictive mode consistent with operational requirements: [Assignment: organization-defined configuration settings].\nb.\tIdentify, document, and approve any deviations from established configuration settings."}
{"page":1,"tags":["Configuration Management","Configuration Change Control"],"text":"a.\tDefine the types of changes to the system that are configuration-controlled.\nb.\tReview proposed configuration-controlled changes to the system, and approve or disapprove such changes with explicit consideration for security impacts.\nc.\tImplement and document approved configuration-controlled changes to the system.\nd.\tMonitor and review activities associated with configuration-controlled changes to the system."}
{"page":1,"tags":["Configuration Management","Impact Analyses "],"text":"a.\tAnalyze changes to the system to determine potential security impacts prior to change implementation.\nb.\tVerify that the security requirements for the system continue to be satisfied after the system changes have been implemented."}
{"page":1,"tags":["Configuration Management","Access Restrictions for Change"],"text":"Define, document, approve, and enforce physical and logical access restrictions associated with changes to the system."}
{"page":1,"tags":["Configuration Management","Least Functionality"],"text":"a.\tConfigure the system to provide only mission-essential capabilities.\nb.\tProhibit or restrict use of the following functions, ports, protocols, connections, and services: [Assignment: organization-defined functions, ports, protocols, connections, and services].\nc.\tReview the system [Assignment: organization-defined frequency] to identify unnecessary or nonsecure functions, ports, protocols, connections, and services.\nd.\tDisable or remove functions, ports, protocols, connections, and services that are unnecessary or nonsecure."}
{"page":1,"tags":["Configuration Management","Authorized Software – Allow by Exception"],"text":"a.\tIdentify software programs authorized to execute on the system.\nb.\tImplement a deny-all, allow-by-exception policy for the execution of authorized software programs on the system.\nc.\tReview and update the list of authorized software programs [Assignment: organization-defined frequency]."}
{"page":1,"tags":["Configuration Management","System Component Inventory"],"text":"a.\tDevelop and document an inventory of system components.\nb.\tReview and update the system component inventory [Assignment: organization-defined frequency].\nc.\tUpdate the system component inventory as part of installations, removals, and system updates."}
{"page":1,"tags":["Configuration Management","Information Location"],"text":"a.\tIdentify and document the location of CUI and the system components on which the information is processed and stored.\nb.\tDocument changes to the system or system component location where CUI is processed and stored."}
{"page":1,"tags":["Configuration Management","System and Component Configuration for High-Risk Areas"],"text":"a.\tIssue systems or system components with the following configurations to individuals traveling to high-risk locations: [Assignment: organization-defined system configurations].\nb.\tApply the following security requirements to the systems or components when the individuals return from travel: [Assignment: organization-defined security requirements]. "}
{"page":1,"tags":["Identification and Authentication","User Identification, Authentication, and Re-Authentication"],"text":"a.\tUniquely identify and authenticate system users, and associate that unique identification with processes acting on behalf of those users.\nb.\tRe-authenticate users when [Assignment: organization-defined circumstances or situations requiring re-authentication]."}
{"page":1,"tags":["Identification and Authentication","Device Identification and Authentication"],"text":"Uniquely identify and authenticate [Assignment: organization-defined devices or types of devices] before establishing a system connection."}
{"page":1,"tags":["Identification and Authentication","Multi-Factor Authentication"],"text":"Implement multi-factor authentication for access to privileged and non-privileged accounts."}
{"page":1,"tags":["Identification and Authentication","Replay-Resistant Authentication"],"text":"Implement replay-resistant authentication mechanisms for access to privileged and non-privileged accounts."}
{"page":1,"tags":["Identification and Authentication","Identifier Management"],"text":"a.\tReceive authorization from organizational personnel or roles to assign an individual, group, role, service, or device identifier.\nb.\tSelect and assign an identifier that identifies an individual, group, role, service, or device.\nc.\tPrevent the reuse of identifiers for [Assignment: organization-defined time period].\nd.\tManage individual identifiers by uniquely identifying each individual as [Assignment: organization-defined characteristic identifying individual status]."}
{"page":1,"tags":["Identification and Authentication","Password Management"],"text":"a.\tMaintain a list of commonly-used, expected, or compromised passwords, and update the list [Assignment: organization-defined frequency] and when organizational passwords are suspected to have been compromised.\nb.\tVerify that passwords are not found on the list of commonly used, expected, or compromised passwords when users create or update passwords.\nc.\tTransmit passwords only over cryptographically protected channels.\nd.\tStore passwords in a cryptographically protected form.\ne.\tSelect a new password upon first use after account recovery.\nf.\tEnforce the following composition and complexity rules for passwords: [Assignment: organization-defined composition and complexity rules]."}
{"page":1,"tags":["Identification and Authentication","Authentication Feedback"],"text":"Obscure feedback of authentication information during the authentication process. "}
{"page":1,"tags":["Identification and Authentication","Authenticator Management"],"text":"a.\tVerify the identity of the individual, group, role, service, or device receiving the authenticator as part of the initial authenticator distribution.\nb.\tEstablish initial authenticator content for any authenticators issued by the organization.\nc.\tEstablish and implement administrative procedures for initial authenticator distribution; for lost, compromised, or damaged authenticators; and for revoking authenticators.\nd.\tChange default authenticators at first use.\ne.\tChange or refresh authenticators [Assignment: organization-defined frequency] or when the following events occur: [Assignment: organization-defined events].\nf.\tProtect authenticator content from unauthorized disclosure and modification."}
{"page":1,"tags":["Incident response","Incident Handling"],"text":"Implement an incident-handling capability that is consistent with the incident response plan and includes preparation, detection and analysis, containment, eradication, and recovery."}
{"page":1,"tags":["Incident response","Incident Monitoring, Reporting, and Response Assistance"],"text":"a.\tTrack and document system security incidents. \nb.\tReport suspected incidents to the organizational incident response capability within [Assignment: organization-defined time period].\nc.\tReport incident information to [Assignment: organization-defined authorities].\nd.\tProvide an incident response support resource that offers advice and assistance to system users on handling and reporting incidents."}
{"page":1,"tags":["Incident response","Incident Response Testing"],"text":"Test the effectiveness of the incident response capability [Assignment: organization-defined frequency]."}
{"page":1,"tags":["Incident response","Incident Response Training"],"text":"a.\tProvide incident response training to system users consistent with assigned roles and responsibilities:\n1.\tWithin [Assignment: organization-defined time period] of assuming an incident response role or responsibility or acquiring system access,\n2.\tWhen required by system changes, and\n3.\t[Assignment: organization-defined frequency] thereafter.\nb.\tReview and update incident response training content [Assignment: organization-defined frequency] and following [Assignment: organization-defined events]."}
{"page":1,"tags":["Incident response","Incident Response Plan"],"text":"a.\tDevelop an incident response plan that:\n1.\tProvides the organization with a roadmap for implementing its incident response capability,\n2.\tDescribes the structure and organization of the incident response capability,\n3.\tProvides a high-level approach for how the incident response capability fits into the overall organization,\n4.\tDefines reportable incidents,\n5.\tAddresses the sharing of incident information, and\n6.\tDesignates responsibilities to organizational entities, personnel, or roles.\nb.\tDistribute copies of the incident response plan to designated incident response personnel (identified by name and\/or by role) and organizational elements.\nc.\tUpdate the incident response plan to address system and organizational changes or problems encountered during plan implementation, execution, or testing.\nd.\tProtect the incident response plan from unauthorized disclosure."}
{"page":1,"tags":["Maintenance","Maintenance Tools"],"text":"a.\tApprove, control, and monitor the use of system maintenance tools.\nb.\tCheck media with diagnostic and test programs for malicious code before it is used in the system.\nc.\tPrevent the removal of system maintenance equipment containing CUI by verifying that there is no CUI on the equipment, sanitizing or destroying the equipment, or retaining the equipment within the facility."}
{"page":1,"tags":["Maintenance","Nonlocal Maintenance"],"text":"a.\tApprove and monitor nonlocal maintenance and diagnostic activities.\nb.\tImplement multi-factor authentication and replay resistance in the establishment of nonlocal maintenance and diagnostic sessions.\nc.\tTerminate session and network connections when nonlocal maintenance is completed."}
{"page":1,"tags":["Maintenance","Maintenance Personnel"],"text":"a.\tEstablish a process for maintenance personnel authorization.\nb.\tMaintain a list of authorized maintenance organizations or personnel.\nc.\tVerify that non-escorted personnel who perform maintenance on the system possess the required access authorizations.\nd.\tDesignate organizational personnel with required access authorizations and technical competence to supervise the maintenance activities of personnel who do not possess the required access authorizations."}
{"page":1,"tags":["Media Protection","Media Storage"],"text":"Physically control and securely store system media that contain CUI."}
{"page":1,"tags":["Media Protection","Media Access"],"text":"Restrict access to CUI on system media to authorized personnel or roles."}
{"page":1,"tags":["Media Protection","Media Sanitization"],"text":"Sanitize system media that contain CUI prior to disposal, release out of organizational control, or release for reuse."}
{"page":1,"tags":["Media Protection","Media Marking"],"text":"Mark system media that contain CUI to indicate distribution limitations, handling caveats, and applicable CUI markings."}
{"page":1,"tags":["Media Protection","Media Transport"],"text":"a.\tProtect and control system media that contain CUI during transport outside of controlled areas.\nb.\tMaintain accountability of system media that contain CUI during transport outside of controlled areas.\nc.\tDocument activities associated with the transport of system media that contain CUI."}
{"page":1,"tags":["Media Protection","Media Use"],"text":"a.\tRestrict or prohibit the use of [Assignment: organization-defined types of system media]. \nb.\tProhibit the use of removable system media without an identifiable owner."}
{"page":1,"tags":["Media Protection","System Backup – Cryptographic Protection"],"text":"a.\tProtect the confidentiality of backup information.\nb.\tImplement cryptographic mechanisms to prevent the unauthorized disclosure of CUI at backup storage locations."}
{"page":1,"tags":["Personnel Security","Personnel Screening"],"text":"a.\tScreen individuals prior to authorizing access to the system.\nb.\tRescreen individuals in accordance with [Assignment: organization-defined conditions requiring rescreening]."}
{"page":1,"tags":["Personnel Security","Personnel Termination and Transfer"],"text":"a.\tWhen individual employment is terminated:\n1.\tDisable system access within [Assignment: organization-defined time period],\n2.\tTerminate or revoke authenticators and credentials associated with the individual, and\n3.\tRetrieve security-related system property.\nb.\tWhen individuals are reassigned or transferred to other positions in the organization:\n1.\tReview and confirm the ongoing operational need for current logical and physical access authorizations to the system and facility, and\n2.\tModify access authorization to correspond with any changes in operational need."}
{"page":1,"tags":["Physical Protection","Physical Access Authorizations"],"text":"a.\tDevelop, approve, and maintain a list of individuals with authorized access to the facility where the system resides.\nb.\tIssue authorization credentials for facility access.\nc.\tReview the facility access list [Assignment: organization-defined frequency].\nd.\tRemove individuals from the facility access list when access is no longer required."}
{"page":1,"tags":["Physical Protection","Monitoring Physical Access"],"text":"a.\tMonitor physical access to the facility where the system resides to detect and respond to physical security incidents.\nb.\tReview physical access logs [Assignment: organization-defined frequency] and upon occurrence of [Assignment: organization-defined events or potential indications of events]."}
{"page":1,"tags":["Physical Protection","Alternate Work Site"],"text":"a.\tDetermine alternate work sites allowed for use by employees.\nb.\tEmploy the following security requirements at alternate work sites: [Assignment: organization-defined security requirements]."}
{"page":1,"tags":["Physical Protection","Physical Access Control"],"text":"a.\tEnforce physical access authorizations at entry and exit points to the facility where the system resides by:\n1.\tVerifying individual physical access authorizations before granting access to the facility and\n2.\tControlling ingress and egress with physical access control systems, devices, or guards.\nb.\tMaintain physical access audit logs for entry or exit points.\nc.\tEscort visitors, and control visitor activity.\nd.\tSecure keys, combinations, and other physical access devices.\ne.\tControl physical access to output devices to prevent unauthorized individuals from obtaining access to CUI."}
{"page":1,"tags":["Physical Protection","Access Control for Transmission  "],"text":"Control physical access to system distribution and transmission lines within organizational facilities."}
{"page":1,"tags":["Risk Assessment","Risk Assessment"],"text":"a.\tAssess the risk (including supply chain risk) of unauthorized disclosure resulting from the processing, storage, or transmission of CUI. \nb.\tUpdate risk assessments [Assignment: organization-defined frequency]."}
{"page":1,"tags":["Risk Assessment","Vulnerability Monitoring and Scanning"],"text":"a.\tMonitor and scan the system for vulnerabilities [Assignment: organization-defined frequency] and when new vulnerabilities affecting the system are identified.\nb.\tRemediate system vulnerabilities within [Assignment: organization-defined response times].\nc.\tUpdate system vulnerabilities to be scanned [Assignment: organization-defined frequency] and when new vulnerabilities are identified and reported."}
{"page":1,"tags":["Risk Assessment","Risk Response"],"text":"Respond to findings from security assessments, monitoring, and audits."}
{"page":1,"tags":["Security Assessment","Security Assessment"],"text":"Assess the security requirements for the system and its environment of operation [Assignment: organization-defined frequency] to determine if the requirements have been satisfied."}
{"page":1,"tags":["Security Assessment","Plan of Action and Milestones"],"text":"a.\tDevelop a plan of action and milestones for the system:\n1.\tTo document the planned remediation actions to correct weaknesses or deficiencies noted during security assessments and\n2.\tTo reduce or eliminate known system vulnerabilities.\nb.\tUpdate the existing plan of action and milestones based on the findings from:\n1.\tSecurity assessments,\n2.\tAudits or reviews, and\n3.\tContinuous monitoring activities."}
{"page":1,"tags":["Security Assessment","Continuous Monitoring"],"text":"Develop and implement a system-level continuous monitoring strategy that includes ongoing monitoring and security assessments."}
{"page":1,"tags":["Security Assessment","Information Exchange"],"text":"a.\tApprove and manage the exchange of CUI between the system and other systems using [Selection (one or more): interconnection security agreements; information exchange security agreements; memoranda of understanding or agreement; service-level agreements; user agreements; non-disclosure agreements; other types of agreements].\nb.\tDocument interface characteristics, security requirements, and responsibilities for each system as part of the exchange agreements.\nc.\tReview and update the exchange agreements [Assignment: organization-defined frequency]."}
{"page":1,"tags":["System and Communications Protection","Boundary Protection"],"text":"a.\tMonitor and control communications at external managed interfaces to the system and key internal managed interfaces within the system.\nb.\tImplement subnetworks for publicly accessible system components that are physically or logically separated from internal networks.\nc.\tConnect to external systems only through managed interfaces that consist of boundary protection devices arranged in accordance with an organizational security architecture."}
{"page":1,"tags":["System and Services Acquisition"],"text":"No description available"}
{"page":1,"tags":["System and Communications Protection","Information in Shared System Resources"],"text":"Prevent unauthorized and unintended information transfer via shared system resources."}
{"page":1,"tags":["System and Communications Protection","Network Communications – Deny by Default – Allow by Exception"],"text":"Deny network communications traffic by default, and allow network communications traffic by exception."}
{"page":1,"tags":["System and Communications Protection","Transmission and Storage Confidentiality"],"text":"Implement cryptographic mechanisms to prevent the unauthorized disclosure of CUI during transmission and while in storage."}
{"page":1,"tags":["System and Communications Protection","Network Disconnect"],"text":"Terminate the network connection associated with a communications session at the end of the session or after [Assignment: organization-defined time period] of inactivity."}
{"page":1,"tags":["System and Communications Protection","Cryptographic Key Establishment and Management"],"text":"Establish and manage cryptographic keys in the system in accordance with the following key management requirements: [Assignment: organization-defined requirements for key generation, distribution, storage, access, and destruction]."}
{"page":1,"tags":["System and Communications Protection","Cryptographic Protection"],"text":"Implement the following types of cryptography to protect the confidentiality of CUI: [Assignment: organization-defined types of cryptography]. "}
{"page":1,"tags":["System and Communications Protection","Collaborative Computing Devices and Applications"],"text":"a.\tProhibit the remote activation of collaborative computing devices and applications with the following exceptions: [Assignment: organization-defined exceptions where remote activation is to be allowed].\nb.\tProvide an explicit indication of use to users physically present at the devices."}
{"page":1,"tags":["System and Communications Protection","Mobile Code"],"text":"a.\tDefine acceptable mobile code and mobile code technologies.\nb.\tAuthorize, monitor, and control the use of mobile code."}
{"page":1,"tags":["System and Communications Protection","Session Authenticity"],"text":"Protect the authenticity of communications sessions. "}
{"page":1,"tags":["System and Information Integrity","Flaw Remediation"],"text":"a.\tIdentify, report, and correct system flaws.\nb.\tInstall security-relevant software and firmware updates within [Assignment: organization-defined time period] of the release of the updates."}
{"page":1,"tags":["System and Information Integrity","Malicious Code Protection"],"text":"a.\tImplement malicious code protection mechanisms at system entry and exit points to detect and eradicate malicious code.\nb.\tUpdate malicious code protection mechanisms as new releases are available in accordance with configuration management policies and procedures.\nc.\tConfigure malicious code protection mechanisms to:\n1.\tPerform scans of the system [Assignment: organization-defined frequency] and real-time scans of files from external sources at endpoints or system entry and exit points as the files are downloaded, opened, or executed; and\n2.\tBlock malicious code, quarantine malicious code, or take other mitigation actions in response to malicious code detection."}
{"page":1,"tags":["System and Information Integrity","Security Alerts, Advisories, and Directives"],"text":"a.\tReceive system security alerts, advisories, and directives from external organizations on an ongoing basis.\nb.\tGenerate and disseminate internal system security alerts, advisories, and directives, as necessary."}
{"page":1,"tags":["System and Information Integrity","System Monitoring"],"text":"a.\tMonitor the system to detect:\n1.\tAttacks and indicators of potential attacks and\n2.\tUnauthorized connections.\nb.\tIdentify unauthorized use of the system.\nc.\tMonitor inbound and outbound communications traffic to detect unusual or unauthorized activities or conditions."}
{"page":1,"tags":["System and Information Integrity","Information Management and Retention"],"text":"Manage and retain CUI within the system and CUI output from the system in accordance with applicable laws, Executive Orders, directives, regulations, policies, standards, guidelines, and operational requirements."}
{"page":1,"tags":["Planning ","Policy and Procedures"],"text":"a.\tDevelop, document, and disseminate to organizational personnel or roles the policies and procedures needed to satisfy the security requirements for the protection of CUI.\nb.\tReview and update policies and procedures [Assignment: organization-defined frequency]."}
{"page":1,"tags":["Planning ","System Security Plan"],"text":"a.\tDevelop a system security plan that:\n1.\tDefines the constituent system components;\n2.\tIdentifies the information types processed, stored, and transmitted by the system;\n3.\tDescribes specific threats to the system that are of concern to the organization;\n4.\tDescribes the operational environment for the system and any dependencies on or connections to other systems or system components;\n5.\tProvides an overview of the security requirements for the system;\n6.\tDescribes the safeguards in place or planned for meeting the security requirements;\n7.\tIdentifies individuals that fulfill system roles and responsibilities; and\n8.\tIncludes other relevant information necessary for the protection of CUI.\nb.\tReview and update the system security plan [Assignment: organization-defined frequency].\nc.\tProtect the system security plan from unauthorized disclosure."}
{"page":1,"tags":["Planning ","Rules of Behavior"],"text":"a.\tEstablish rules that describe the responsibilities and expected behavior for system usage and protecting CUI.\nb.\tProvide rules to individuals who require access to the system.\nc.\tReceive a documented acknowledgement from individuals indicating that they have read, understand, and agree to abide by the rules of behavior before authorizing access to CUI and the system.\nd.\tReview and update the rules of behavior [Assignment: organization-defined frequency]."}
{"page":1,"tags":["System and Services Acquisition","Security Engineering Principles"],"text":"Apply the following systems security engineering principles to the development or modification of the system and system components: [Assignment: organization-defined systems security engineering principles]."}
{"page":1,"tags":["System and Services Acquisition","Unsupported System Components"],"text":"a.\tReplace system components when support for the components is no longer available from the developer, vendor, or manufacturer.\nb.\tProvide options for risk mitigation or alternative sources for continued support for unsupported components that cannot be replaced."}
{"page":1,"tags":["System and Services Acquisition","External System Services"],"text":"a.\tRequire the providers of external system services used for the processing, storage, or transmission of CUI to comply with the following security requirements: [Assignment: organization-defined security requirements].\nb.\tDefine and document user roles and responsibilities with regard to external system services, including shared responsibilities with external service providers.\nc.\tImplement processes, methods, and techniques to monitor security requirement compliance by external service providers on an ongoing basis."}
{"page":1,"tags":["Supply Chain Risk Management","Supply Chain Risk Management Plan"],"text":"a.\tDevelop a plan for managing supply chain risks associated with the research and development, design, manufacturing, acquisition, delivery, integration, operations, maintenance, and disposal of the system, system components, or system services.\nb.\tReview and update the supply chain risk management plan [Assignment: organization-defined frequency].\nc.\tProtect the supply chain risk management plan from unauthorized disclosure."}
{"page":1,"tags":["Supply Chain Risk Management","Acquisition Strategies, Tools, and Methods"],"text":"Develop and implement acquisition strategies, contract tools, and procurement methods to identify, protect against, and mitigate supply chain risks."}
{"page":1,"tags":["Supply Chain Risk Management","Supply Chain Requirements and Processes"],"text":"a.\tEstablish a process for identifying and addressing weaknesses or deficiencies in the supply chain elements and processes.\nb.\tEnforce the following security requirements to protect against supply chain risks to the system, system components, or system services and to limit the harm or consequences from supply chain-related events: [Assignment: organization-defined security requirements]."}
