{"page":1,"tags":["Gouvernance et interactions entre équipes mobilisées"],"text":"Les fonctions décisionnelles de l'organisation sont-elles sensibilisées aux enjeux cyber ?\n\nNiveau 0 : Les fonctions décisionnelles de l'organisation ne sont pas sensibilisées aux enjeux cyber.\n\nNiveau 1 : Une partie des fonctions décisionnelles est sensibilisée aux enjeux cyber. Un dispositif de gestion de crise est présent.\n\nNiveau 2 : Les fonctions décisionnelles de l’organisation sont sensibilisées aux enjeux cyber. Un dispositif de crise est présent. Les fonctions cyber et IT sont systématiquement représentées dans la gouvernance de crise cyber. \n\nNiveau 3 : Les fonctions décisionnelles de l’organisation sont sensibilisées aux enjeux cyber. Les fonctions cyber et IT sont systématiquement représentées dans la gouvernance de crise (cyber et hors cyber).\n\nQuelle est la stratégie d'entraînement de gestion de crise au niveau stratégique ?\n\nNiveau 0 : Aucun entraînement à la gestion de crise n'est organisé.\n\nNiveau 1 : Des exercices testant des scénarios cyber sont organisés au niveau stratégique.\n\nNiveau 2 : Une stratégie d’entraînement de gestion de crise est définie et des exercices testant des scénarios cyber sont régulièrement organisés au niveau stratégique. Les exercices impliquent des périmètres d’impacts et des scénarios en ligne avec la cartographie des risques et l'état de la menace. \n\nNiveau 3 : Une stratégie d’entraînement de gestion de crise est définie et des exercices testant des scénarios cyber sont régulièrement organisés au niveau stratégique. Les exercices impliquent des périmètres d’impacts et des scénarios en ligne avec la cartographie des risques et l'état de la menace. La cellule stratégique s'entraîne à prendre des décisions dans l'incertitude. \n\nLa stratégie d'exercice intègre le sujet de la coordination avec son écosystème et prend en compte l'articulation avec les exercices opérationnels.\n\nLa stratégie est alignée avec un plan de montée en compétence sur les savoir-faire liés à la gestion de crise cyber.\n\nQuelle est la stratégie d'entraînement de gestion de crise au niveau opérationnel ?\n\nNiveau 0 : Aucun entraînement à la gestion de crise cyber n'est organisé.\n\nNiveau 1 : Des exercices testant des scénarios cyber sont organisés au niveau opérationnel.\n\nNiveau 2 : Des exercices testant des scénarios cyber sont organisés au niveau opérationnel. Certains exercices testent l’articulation entre les volets opérationnel et stratégique.\n\nNiveau 3 : Des exercices testant des scénarios cyber sont organisés. Certains exercices testent l’articulation entre les volets opérationnel et stratégique.\n\nLa complexité technique des exercices est adaptée à la maturité de l’organisation. Ils tendent progressivement vers plus de réalisme pour entraîner les équipes d’investigation (type entraînement sur Cyber Range).\n\nL'ensemble du dispositif de crise est-il formalisé dans un référentiel de management (politique globale) ?\n\nNiveau 0 : Il n'existe pas de référentiel de management des crises cyber.\n\nNiveau 1 : Un référentiel de management des crises intégrant une description de l’ensemble du dispositif de crise (organisation, gouvernance, ressources, outils, annuaire) existe mais n'intègre pas le volet cyber.\n\nNiveau 2 : Un référentiel de management des crises contenant d'un volet cyber intégrant une description de l’ensemble du dispositif de crise (organisation, gouvernance, ressources, outils, annuaire) est formalisé et validé. Il est lié aux autres dispositifs de crise existant.\n\nNiveau 3 : Un référentiel de management des crises cyber intégrant une description de l’ensemble du dispositif de crise (organisation, gouvernance, ressources, outils, annuaire) est formalisé, promu, maintenu à jour et testé. Il est lié aux autres dispositifs de crise existant.\n\nComment le processus de gestion de crise prévoit-il l'organisation des équipes cyber ? \n\nNiveau 0 : La gestion des équipes est identique à la normale. \n\nNiveau 1 : Le roulement des équipes est anticipé et l'activité opérationnelle des collaborateurs (en particulier l'intervention en heures non ouvrées) est suivie afin de préserver leur capacité à opérer dans la durée et de régulariser leur temps de travail.\n\nNiveau 2 : Le roulement des équipes est anticipé et l'activité opérationnelle des collaborateurs (en particulier l'intervention en heures non ouvrées) est suivie afin de préserver leur capacité à opérer dans la durée et de régulariser leur temps de travail.  Les prestataires mobilisés font également un suivi équivalent pour les ressources utilisées. Les collaborateurs sans activité peuvent être mobilisés pour fournir de l’aide sur les différentes actions à réaliser. \n\nNiveau 3 : Le roulement des équipes est anticipé et l'activité opérationnelle des collaborateurs (en particulier l'intervention en heures non ouvrées) est suivie afin de préserver leur capacité à opérer dans la durée et de régulariser leur temps de travail.  Les prestataires mobilisés font également un suivi équivalent pour les ressources utilisées. Les collaborateurs sans activité peuvent être mobilisés pour fournir de l’aide sur les différentes actions à réaliser. \n\nLe travail est organisé sous forme d’équipes-projet, afin de répondre à plusieurs objectifs dans un délai réduit.\n\nComment est formée la cellule de crise stratégique ?\n\nNiveau 0 : Les membres de la cellule de crise ne sont pas identifiés.\n\nNiveau 1 : Les membres de la cellule de crise sont identifiés et sont informés de leur nomination au dispositif. \n\nNiveau 2 : Les membres de la cellule de crise sont identifiés et sont informés de leur nomination au dispositif. Ils sont informés de leur rôle, leurs missions et leur périmètre d'action, qui ont été définis en amont. \n\nDes suppléants sont identifiés.\n\nNiveau 3 : Les membres de la cellule de crise sont identifiés et sont informés de leur nomination au dispositif. Ils sont informés de leur rôle, leurs missions et leur périmètre d'action, qui ont été définis en amont, et y sont formés. Ils participent à au moins un exercice par an. Des suppléants sont identifiés et intégrés aux formations et aux exercices.\n\nComment s'organisent les équipes opérationnelles en cas de crise ?\n\nNiveau 0 : Les membres de la cellule de crise opérationnelle ne sont pas identifiés. L'organisation usuelle est maintenue. \n\nNiveau 1 : Les membres de la cellule de crise opérationnelle sont identifiés et sont informés de leur nomination au dispositif. Une organisation alternative des équipes est mise en place. \n\nNiveau 2 : Les membres de la cellule de crise opérationnelle sont identifiés et sont informés de leur nomination au dispositif. Ils sont informés de leur rôle, leurs missions et leur périmètre d'action, qui ont été définis en amont. L'organisation des équipes est pensée pour être la plus efficace possible. \n\nDes suppléants sont identifiés.\n\nNiveau 3 : Les membres de la cellule de crise opérationnelle sont identifiés et sont informés de leur nomination au dispositif. Ils sont informés de leur rôle, leurs missions et leur périmètre d'action, qui ont été définis en amont, et y sont formés.\n\nDes suppléants sont identifiés et intégrés aux formations et aux exercices.\n\n La cellule intègre des experts clés capables de fournir des orientations ainsi qu’un relais pour la communication de crise. L'organisation des équipes est pensée pour être la plus efficace possible de manière à réaliser les actions d’investigation\/endiguement, de durcissement\/remédiation et de reconstruction.\n\nQuelles sont les expertises identifiées au niveau stratégique?\n\nNiveau 0 : Aucune expertise en matière de crise n'a été pré-identifiée. \n\nNiveau 1 : Des expertises sont identifiées, et couvrent au moins l'un des domaines suivants : \n\n- gestion et conduite de crise ;\n\n- communication de crise cyber ;\n\n- gestion de projet.\n\nNiveau 2 : Des expertises sont identifiées et mises à jour. Elles couvrent les domaines suivants :\n\n- gestion et conduite de crise ;\n\n- communication de crise cyber.\n\nEn cas d'externalisation, des accords de non divulgation sont mis en place pour l’ensemble des experts sollicités.\n\nNiveau 3 : Des expertises sont identifiées et mises à jour. Elles couvrent les domaines suivants :\n\n- gestion et conduite de crise ;\n\n- communication de crise cyber ;\n\n- gestion de projet ;\n\n- expertise juridique.\n\nEn cas d'externalisation, des accords de non divulgation sont mis en place pour l’ensemble des experts sollicités.\n\nQuelles sont les expertises identifiées au niveau opérationnel?\n\nNiveau 0 : Aucune expertise en matière de crise n'a été pré-identifiée. \n\nNiveau 1 : Des expertises sont identifiées, et couvrent certains des domaines suivants : \n\n- réponse à incidents ;\n\n- supervision de sécurité ;\n\n- remédiation technique\n\n- infrastructure informatique.\n\n\n\nNiveau 2 : Des expertises sont identifiées et mises à jour. Elles couvrent les domaines suivants :\n\n- réponse à incidents ;\n\n- supervision de sécurité ;\n\n- remédiation technique ;\n\n- infrastructure informatique ;\n\n- annuaires et accès privilégiés (souvent Active Directory) ;\n\n- restauration de données ;\n\n- recouvrement de données.\n\nEn cas d'externalisation, des accords de non divulgation sont mis en place pour l’ensemble des experts sollicités.\n\nNiveau 3 : Des expertises sont identifiées et mises à jour. Elles couvrent les domaines suivants :\n\n- réponse à incidents ;\n\n- supervision de sécurité ;\n\n- remédiation technique ;\n\n- infrastructure informatique ;\n\n- annuaires et accès privilégiés (souvent Active Directory) ;\n\n- restauration de données ;\n\n- recouvrement de données ;\n\n- solutions nuagiques ;\n\n- réseaux ;\n\n- administration Linux\/Windows ; \n\n- pare-feu.\n\nEn cas d'externalisation, des accords de non divulgation sont mis en place pour l’ensemble des experts sollicités.\n\nTous les prestataires mobilisés travaillent ensemble, sous la coordination de la cellule opérationnelle, avec des objectifs et des périmètres clairement définis.\n\nComment la cellule de crise stratégique communique-t-elle avec les équipes opérationnelles cyber et IT ?\n\nNiveau 0 : Les différents rôles des interlocuteurs  des cellules opérationnelles et de la cellule stratégique et leur manière de se réunir ne sont pas définis.\n\nNiveau 1 : Les différents rôles des interlocuteurs des cellules opérationnelles et de la cellule stratégique sont définis et se réunissent ponctuellement. \n\nNiveau 2 : Les différents interlocuteurs des cellules opérationnelles et de la cellule stratégique connaissent leurs rôles et se réunissent en respectant un rythme régulier défini en amont. \n\nNiveau 3 : Les différents interlocuteurs des cellules opérationnelles et de la cellule stratégique connaissent leurs rôles et se réunissent en respectant un rythme régulier défini en amont. Des coordinateurs sont désignés pour permettre une meilleure circulation de l'information.\n\nComment sont anticipées les interactions entre les équipes techniques et les cellules opérationnelles ? \n\nNiveau 0 : Il n'y a pas de comitologie définie entre les équipes techniques et les autres cellules. \n\nNiveau 1 : Il est prévu que les équipes techniques communiquent avec les autres cellules sur la base de réunions ad-hoc. \n\nNiveau 2 : Le rythme des remontées d’information adapté à la crise est formalisée et partagée. \n\nDes éléments de langages vulgarisés sont préparés en amont afin de s'adapter à des publics non experts.\n\nNiveau 3 : Le rythme des remontées d’information adapté à la crise est formalisée et partagée. \n\nEn particulier, leurs réunions servent à partager l’avancement, les priorités, les difficultés et incertitudes et les besoins. Les éléments techniques sont vulgarisés afin de s'adapter à des publics non-experts. Des collaborateurs des équipes techniques travaillent avec les équipes de communication afin de participer à la rédaction des communications internes ou externes.\n\nComment sont prises en compte les problématiques internationales ? (si non applicable, ne pas répondre)\n\nNiveau 0 : Les problématiques internationales ne sont pas prises en compte. \n\nNiveau 1 : Les problématiques internationales sont prises en compte de manière informelle.\n\nNiveau 2 : Des processus dédiés aux problématiques internationales sont définis, validés et couvrent la majorité des aspects, par exemple la gestion des fuseaux horaires. \n\nNiveau 3 : Des processus dédiés aux problématiques internationales sont mis en place et couvrent tous les aspects, y compris les questions culturelles. Des relais de communication sont identifiés. Ces processus sont stockés hors-ligne et mis à jour régulièrement.\n\nComment l'anticipation est-elle intégrée à la cellule de crise stratégique?\n\nNiveau 0 : L'anticipation n'est pas intégré danse les fonctions de la cellule de crise stratégique.\n\nNiveau 1 : Une équipe est en charge du volet anticipation dans la cellule de crise.\n\nNiveau 2 : Une équipe est en charge du volet anticipation dans la cellule de crise. Elle s'appuie sur une méthodologie d'anticipation qui prend en compte les spécificités des attaques cyber. Ses travaux sont pris en compte dans la résolution de la crise.\n\nUne fiche de poste précise son rôle.\n\nNiveau 3 : Une équipe est en charge du volet anticipation dans la cellule de crise. Elle s'appuie sur une méthodologie d'anticipation qui prend en compte les spécificités des attaques cyber ainsi que sur des modèles de restitution des travaux. Ses travaux sont pris en compte dans la résolution de la crise. L'équipe est régulièrement entrainée via des exercices de crise.\n\n Une fiche de poste précise son rôle.\n\nComment l'anticipation et la connaissance de la menace est-elle intégrée au niveau opérationnel?\n\nNiveau 0 : Les équipes cyber et IT ne travaillent pas sur la connaissance de la menace cyber.\n\nNiveau 1 : Une fonction CTI existe au sein des équipes cyber. Elle n'est pas prise en compte en prévision ou durant les crises.\n\nNiveau 2 : Une fonction CTI existe au sein des équipes cyber. Elle est contribue à l'identification des scénarios de menace à couvrir et à la définition des fiches réflexes.\n\nNiveau 3 : Une fonction CTI existe au sein des équipes cyber. Elle est contribue à l'identification des scénarios de menace à couvrir et à la définition des fiches réflexes.\n\nLa fonction CTI est mobilisée durant les entrainements et durant les crises pour identifier les comportements possibles de l'attaquant et pour identifier les actions de durcissement et de remédiation à mettre en place.\n\nComment est organisé la phase de RETEX de crise?\n\nNiveau 0 : Aucun processus n'est mis en place pour le RETEX.\n\nNiveau 1 : L'équipe en charge du RETEX est identifiée. Cette équipe identifie les acteurs à interroger, la grille d'entretien et organise les aspects pratiques du RETEX. \n\nNiveau 2 : L'équipe en charge du RETEX est identifiée. Cette équipe identifie les acteurs à interroger, la grille d'entretien et organise les aspects pratiques du RETEX. \n\nLe processus de RETEX est prévu pour se terminer maximum 30 jours après la fin de la crise. \n\nUn rapport d'investigation numérique est demandé aux prestataires mobilisés.\n\nNiveau 3 : L'équipe en charge du RETEX est identifiée. Cette équipe identifie les acteurs à interroger, la grille d'entretien et organise les aspects pratiques du RETEX, pour le volet stratégique et opérationnel. \n\nLe processus de RETEX est prévu pour se terminer maximum 30 jours après la fin de la crise. \n\nUn rapport d'investigation numérique est demandé aux prestataires mobilisés.\n\nLes axes d'amélioration identifiés à l'issue de la restitution font l'objet d'un suivi spécifique."}
{"page":1,"tags":["Processus et outillage"],"text":"Un dispositif d'astreinte est-il existant?\n\nNiveau 0 : Aucun moyen d'astreinte n'existe pour la gestion de crise cyber.\n\nNiveau 1 : Des personnes sont identifiées pour intervenir en heures non-ouvrées, de manière informelle.\n\nNiveau 2 : Des personnes sont identifiées au niveau opérationnel et stratégique pour intervenir en heures non-ouvrées, et sont informées qu'elles pourraient être jointes. La politique est celle du \"meilleur effort\".\n\nNiveau 3 : Des personnes sont identifiées au niveau opérationnel et stratégique pour intervenir en heures non-ouvrées, et sont informées qu'elles pourraient être jointes. La politique d'astreintes est cadrée et formalisée, et est testé une fois par an.\n\nLa cellule de crise dispose-t-elle d'outils numériques dédiés à la gestion de crise?\n\nNiveau 0 : La cellule de crise ne possède pas d'outils numériques dédiés à la gestion de crise. \n\nNiveau 1 : La cellule de crise possède des outils numériques dédiés. \n\nNiveau 2 : La cellule de crise possède des outils numériques dédiés accessibles hors ligne.\n\nNiveau 3 : La cellule de crise possède des outils numériques dédiés accessibles hors ligne, maintenus en conditions opérationnelles et de sécurité. Ces outils sont utilisés et testés lors d'exercices de crise.\n\nComment circule l'information au sein de la cellule de crise ?\n\nNiveau 0 : La cellule de crise ne dispose pas de moyens (outils) pour faire circuler l'information.\n\nNiveau 1 : La cellule de crise communique à l'aide de différents moyens (outils) de communications. \n\nNiveau 2 : L'information circule au sein de la cellule de crise à l'aide d'un moyen de communication défini. \n\nNiveau 3 : La cellule de crise dispose d'une interface unique (type tableau de bord) pour uniformiser la circulation de l’information. Une communication descendante est mise en place pour fournir de la visibilité sur l'évolution de la situation.\n\nLes critères d'activation de la cellule stratégique sont-ils formalisés ?\n\nNiveau 0 : Les critères d'activation de la cellule stratégique ne sont pas définis. \n\nNiveau 1 : Les critères d'activation de la cellule stratégique sont définis de manière informelle. \n\nNiveau 2 : Les critères d'activation sont formalisés et validés. Des objectifs et des critères de sortie de crise atteignables sont pré-identifiés. lls sont connus des membres du dispositif. Ils prennent en compte les besoins de notification d'incidents vers les autorités.\n\nNiveau 3 : Les critères d'activation et de désactivation de la cellule stratégique sont validés. Des objectifs et des critères de sortie de crise atteignables sont pré-identifiés, en lien avec les équipes métiers, cyber et IT. lls sont connus des membres du dispositif. Ils prennent en compte les besoins de notification d'incidents vers les autorités.\n\nComment sont définis les critères d'activation et de désactivation du dispositif opérationnel ?\n\nNiveau 0 : Les critères d'activation et de désactivation des dispositifs opérationnels ne sont pas définis. \n\nNiveau 1 : Les critères d'activation et de désactivation des dispositifs opérationnels prévoient en particulier l’activation par effet de seuil (par le bas) et l’activation sur décision du dispositif stratégique (par le haut).\n\nNiveau 2 : Les critères d'activation et de désactivation des dispositifs opérationnels prévoient en particulier l’activation par effet de seuil (par le bas) et l’activation sur décision du dispositif stratégique (par le haut). Ils sont connus des membres du dispositif de crise et des équipes de gestion d’incident. Ils prennent en compte les besoins de notification d'incidents vers les autorités et font lien avec la politique de réponse à incident numérique de sécurité.\n\nNiveau 3 : Les critères d’activation et de désactivation du dispositif opérationnel sont définis en fonction des scénarios cyber de référence. Ils prévoient en particulier l’activation par effet de seuil (par le bas) et l’activation sur décision du dispositif stratégique (par le haut). Ils sont connus des membres du dispositif de crise et des équipes de gestion d’incident. Ils permettent d’objectiver la mobilisation et la démobilisation d’une cellule stratégique.\n\nIls prennent en compte les besoins de notification d'incidents vers les autorités et font lien avec la politique de réponse à incident numérique de sécurité.\n\nComment le processus de gestion de crise prévoit-il le premier état des lieux de la situation ?\n\nNiveau 0 : Il n'existe aucun document de préparation de la réunion de lancement de crise.\n\nNiveau 1 : Les personnes conviées au lancement de crise sont définies en amont d'une crise.\n\nNiveau 2 : Les personnes conviées au lancement de crise sont définies en amont d'une crise. L'organisation dispose d'un modèle de présentation (fonctionnement du dispositif rappel des rôles et responsabilités, premières orientations \/ priorités, etc.). \n\nNiveau 3 : Les personnes conviées au lancement de crise sont définies en amont d'une crise. L'organisation dispose d'un modèle de présentation modèle de présentation (fonctionnement du dispositif rappel des rôles et responsabilités, premières orientations \/ priorités, etc.) ainsi que d'autres modèles utiles à la gestion de crise (points de situation, graphique de résolution, présentation de suivi de crise, etc.).\n\nUn suivi de crise est-il mis en place ?\n\nNiveau 0 : Les décisions prises pendant la crise ne font pas l'objet d'un suivi.\n\nNiveau 1 : Les décisions prises pendant la crise font l'objet d'un suivi informel.\n\nNiveau 2 : Un registre (type main courante) est mis en place pour suivre les décisions prises pendant la crise.\n\nNiveau 3 : Un registre (type main courante) est mis en place pour suivre les risques, les dérogations, et les communications internes et externes, y compris les sollicitations des clients, des partenaires et des autorités.\n\nLes conditions de sortie de crise sont-elles pré définies et évaluées durant la crise ?\n\nNiveau 0 : Aucun processus d'évaluation des critères de sortie de crise n'est mis en place.\n\nNiveau 1 : Les processus prévoient l'évaluation des critères de sortie de crise au démarrage de la crise.\n\nNiveau 2 : Les processus prévoient une réévaluation des critères de sortie de crise pendant la crise. \n\nNiveau 3 : Le processus de réévaluation des critères de sortie de crise  prend en compte, en particulier, les connaissances sur l’attaque, le rétablissement des services et la remise en production des systèmes affectés.\n\nQuels sont les moyens logistiques prévus pour une gestion de crise cyber ?\n\nNiveau 0 : La logistique de crise n'a pas été formalisée.\n\nNiveau 1 : Des salles de réunions permettant aux différentes cellules de crise de se retrouver et de travailler ensemble sont identifiées et mobilisables.\n\nNiveau 2 : Des salles de réunions permettant aux différentes cellules de crise de se retrouver et de travailler ensemble sont mises à disposition. Si des prestataires sont mobilisés, une liste nominative des personnes est communiquée aux équipes logistiques pour fournir des badges et un accès aux locaux. \n\nUne personne est dédiée au suivi RH.\n\nNiveau 3 : Des salles de réunions permettant aux différentes cellules de crise de se retrouver et de travailler ensemble sont mises à disposition. Si des prestataires sont mobilisés, une liste nominative des personnes est communiquée aux équipes logistiques pour fournir des badges et un accès aux locaux. \n\nUne personne est dédiée au suivi RH. Des moyens de restauration, de logement, de transport sont mis à disposition des équipes impliquées, y compris en dehors du temps de travail habituel. Les besoins familiaux sont pris en compte voire solutionnés.\n\nLes besoins en assurance en cas de crise cyber sont-ils correctement couverts ?\n\nNiveau 0 : Les besoins d'assurance en cas de crise cyber ne sont pas identifiés. L'étendue de la couverture d'assurance n'est pas clairement identifiée. \n\nNiveau 1 :  Les besoins en cas de crise cyber sont identifiés pour compléter les dispositifs opérationnels existants (expertise, couverture des frais, etc.). Un état des lieux est mené pour identifier la couverture et les polices existantes au sein de l’organisation.\n\nNiveau 2 : Les besoins en cas de crise cyber sont identifiés pour compléter les dispositifs opérationnels existants (expertise, couverture des frais, etc.). Un état des lieux est mené pour identifier la couverture et les polices existantes au sein de l’organisation.  \n\nUn seuil d’activation des polices d’assurance est défini. Sa mise en œuvre est testée dans le cadre d’un exercice de gestion de crise cyber.\n\nUne fiche de bonnes pratiques est formalisée pour faciliter l’utilisation de la police d’assurance en cas de crise : contacts de l’assureur, conservation des justificatifs etc.\n\nNiveau 3 :  Un état des lieux est mené pour identifier la couverture et les polices existantes au sein de l’organisation.\n\nCes besoins en cas de crise cyber sont identifiés pour compléter les dispositifs opérationnels existants (expertise, couverture des frais, etc.).\n\nUne fiche de bonnes pratiques est formalisée pour faciliter l’utilisation de la police d’assurance en cas de crise : contacts de l’assureur, conservation des justificatifs etc.\n\nUn seuil d’activation des polices d’assurance est défini. Sa mise en œuvre est testée dans le cadre d’exercice de gestion de crise cyber avec le cyber assureur.\n\nL’utilisation du contrat d’assurance fait l’objet d’un retour d’expérience après chaque activation."}
{"page":1,"tags":["Communication de crise et relations externes"],"text":"Comment est activée l'assurance cyber ?\n\nNiveau 0 : Il n'existe pas de processus pour activer l'assurance cyber.\n\nNiveau 1 : L’assurance cyber est activée sur décision de la cellule stratégique.\n\nNiveau 2 : L’assurance cyber est activée sur décision de la cellule stratégique, selon les critères préétablis.\n\nNiveau 3 : L’assurance cyber est activée sur décision de la cellule stratégique, selon les critères préétablis. Une synthèse des évènements et de la situation actuelle est formalisée pour la partager avec l’assureur.\n\nLes parties prenantes à contacter ou tenir informées en cas de crise sont-elles identifiées ?\n\nNiveau 0 : La liste des parties prenantes à contacter ou tenir informées n'est pas formalisée. \n\nNiveau 1 : La liste des parties prenantes est pré-identifiée avec leurs contacts.\n\nLes contacts suivants sont notamment identifiés:\n\n- contacts internes\n\n- autorités\n\nNiveau 2 : La liste des parties prenantes est pré-identifiée avec leurs contacts, avec une contribution des équipes IT.\n\nLes contacts suivants sont notamment identifiés:\n\n- contacts internes\n\n- autorités\n\n- public \/ média\n\nNiveau 3 : La liste des parties prenantes est pré-identifiée avec leurs contacts avec une contribution des équipes IT. Le contact d'urgence ainsi que le moyen de communication de secours des clients et fournisseurs les plus critiques est prévu dans les contrats. Un fichier presse (liste des contacts des journalistes ainsi que les supports pour lesquels ils rédigent) est disponible et stocké hors ligne. \n\nLes contacts suivants sont notamment identifiés:\n\n- contacts internes\n\n- autorités\n\n- public \/ média\n\n- clients importants\n\n- fournisseurs\n\n- partenaires techniques (CSIRT, etc.)\n\nL'organisation dispose-t-elle de moyens de communication alternatifs ?\n\nNiveau 0 : L'organisation ne possède pas de moyens de communication alternatifs.\n\nNiveau 1 : L'organisation possède des moyens de communication alternatifs internes.\n\nNiveau 2 : L'organisation possède des moyens de communication alternatifs internes et externes.\n\nNiveau 3 : Des moyens de communication alternatifs internes et externes sont identifiés. Ils peuvent servir à atteindre les différentes cibles de la communication de crise. Ces solutions sont maintenues en conditions opérationnelles et de sécurité, et testées une fois par an.\n\nLa stratégie de communication cyber est-elle formalisée ?\n\nNiveau 0 : La stratégie de communication de crise en cas d'incident cyber n'est pas formalisée. \n\nNiveau 1 : Une stratégie de  crise en cas d'incident cyber est établie de manière informelle.\n\nNiveau 2 : Une stratégie de communication de crise en cas d'incident cyber est formalisée et validée sur la base de scénarios de référence cyber sont disponibles. Des éléments de langage sont formalisés en fonction des scénarios cyber de référence identifiés. Plusieurs sujets médiatiques spécifiques sont anticipés (e.g. attribution de l'attaque).\n\nNiveau 3 : Une stratégie de communication de crise en cas d'incident cyber est formalisée et validée et testée lors d'exercices de crise cyber. Les équipes sont familiarisées et entraînées à la communication de crise cyber et assurent une formation régulière auprès des agents et des responsables de l’entité.  Des scénarios de référence cyber sont disponibles. Des éléments de langage sont formalisés en fonction des scénarios cyber de référence identifiés. Plusieurs sujets médiatiques spécifiques sont anticipés (e.g. attribution de l'attaque).\n\nUn porte-parole de crise a été pré-identifié.\n\nComment est réalisée l'analyse de risque communicationnelle  (pour identifier les risques provenant de communications de médias, de salariés, de concurrents, d'autorités, etc.) ?\n\nNiveau 0 : Aucune méthode d'analyse de risque communicationnelle  n'est disponible. \n\nNiveau 1 : Les grandes orientations permettant d'identifier les risques communicationnelles sont identifiées mais non formalisées.\n\nNiveau 2 : Les grandes orientations permettant d'identifier les risques communicationnelles définis dans un document (procédure, méthode, etc.). L'analyse de risque médiatique s'appuie sur les scénarios de référence cyber. \n\nNiveau 3 : Une veille médiatique est mise en place pour alerter en cas de sujets crisogènes dans les médias ou sur les réseaux sociaux. Une méthode d'analyse de risque communicationnelle est disponible.\n\nComment est préparée l'équipe juridique à une crise cyber ?\n\nNiveau 0 : L'équipe juridique n'est pas mobilisée dans la gestion de la crise cyber. \n\nNiveau 1 : L'équipe juridique est mobilisée dans la gestion de crise cyber afin d'identifier les obligations qui ne pourront pas être respectées auprès des partenaires, clients et fournisseurs.\n\nNiveau 2 : L'équipe juridique est mobilisée dans la gestion de crise cyber afin d'identifier les obligations qui ne pourront pas être respectées auprès des partenaires, clients et fournisseurs. Elle s'assure en lien avec les équipes communication, achats et commerciales de la transmission des informations nécessaires aux partenaires.\n\nNiveau 3 : L'équipe juridique est mobilisée dans la gestion de crise cyber afin d'identifier les obligations qui ne pourront pas être respectées auprès des partenaires, clients et fournisseurs. Elle s'assure en lien avec les équipes  communication, achats et commerciales de la transmission des informations nécessaires aux partenaires. Les délais et informations à transmettre sont prévus dans tous les contrats critiques.\n\nComment sont anticipées les actions de déclaration d'incident ?\n\nNiveau 0 : Les déclarations obligatoires ne sont pas prévues.\n\nNiveau 1 : Les déclarations obligatoires sont anticipées dans un processus informel.\n\nNiveau 2 : Les actions de déclaration d’incident (ANSSI, CNIL, autorités judiciaires) sont centralisées et coordonnées par la cellule stratégique. En cas de violation des données personnelles (règlement général sur la protection des données), une notification de l’incident est réalisée par le délégué à la protection des données.\n\nNiveau 3 : Les actions de déclaration d’incident (ANSSI, CNIL, autorités judiciaires) sont centralisées et coordonnées par la cellule stratégique. En cas de violation des données personnelles (règlement général sur la protection des données), une notification de l’incident est réalisée par le délégué à la protection des données. Dans le cadre d’une crise d’ampleur internationale, les équipes juridiques prennent en compte la législation en vigueur et coordonnent la notification d’incident aux autorités locales. En lien avec les équipes juridiques, un dépôt de plainte est envisagé.\n\nQuelle est la procédure de déclaration d'incident ?\n\nNiveau 0 : Aucun processus de déclaration d'incident cyber n'est mis en place.\n\nNiveau 1 : Les équipes cyber et SI partagent les informations nécessaires à la déclaration selon un processus informel.\n\nNiveau 2 : Les équipes cyber et SI partagent les informations nécessaires à la déclaration selon un processus formalisé et validé. En fonction des obligations légales, une déclaration d’incident est réalisée et les éléments de compromission sont partagés avec l’ANSSI.\n\nNiveau 3 : Les équipes cyber et SI partagent les informations nécessaires à la déclaration selon un processus validé, stocké hors ligne et mis à jour régulièrement. En fonction des obligations légales, une déclaration d’incident est réalisée et les éléments de compromission sont partagés avec l’ANSSI.\n\nLes preuves de compromission (serveurs, données) sont conservées pour la justice (si judiciarisation) et pour l’assureur (si activation d’un contrat d’assurance). En cas de judiciarisation, un huissier spécialisé est sollicité pour établir le constat."}
{"page":1,"tags":["Détection et réponse à incidents"],"text":"Les modalités d'escalade d'une alerte vers la cellule stratégique sont-elles formalisées ?\n\nNiveau 0 : Les modalités d’escalade de l’alerte vers le niveau stratégique n'est pas formalisée. \n\nNiveau 1 : Les modalités d’escalade de l’alerte vers le niveau stratégique est définie de manière informelle.\n\nNiveau 2 : Les modalités d’escalade de l’alerte vers le niveau stratégique est validée. Elle prévoit un mode « alerte » et un mode « crise ».\n\nNiveau 3 : Les modalités d’escalade de l’alerte vers le niveau stratégique est validée. Plusieurs modes sont prévus dont un mode « alerte » et un mode « crise ». Le dispositif de crise peut s'adapter au mode choisi. La chaine de remontée d'alerte est testée régulièrement lors d'exercices de crise.\n\nUn processus d'alerte, de gestion et de réponse dédié aux incidents cyber est-il formalisé ?\n\nNiveau 0 : Il n'existe pas de processus d'alerte, de gestion et de réponse aux incidents. \n\nNiveau 1 : Un processus d'alerte, de gestion et de réponse aux incidents intégrant un volet « sécurité du numérique » existe de manière informelle. \n\nNiveau 2 : Un processus d'alerte, de gestion et de réponse aux incidents, s’appuyant notamment sur un dispositif de réponse à incident et des outils de détection et de gestion d’incident et intégrant un volet « sécurité du numérique » est formalisé et validé. \n\nLe processus prévoit une classification des incidents.\n\nNiveau 3 : Un processus d'alerte, de gestion et de réponse aux incidents, s’appuyant notamment sur un dispositif de réponse à incident et des outils de détection et de gestion d’incident et intégrant un volet « sécurité du numérique » est validé, stocké hors-ligne et testé régulièrement. \n\nLe processus prévoit une classification des incidents, en prenant en compte la nature, le périmètre et l'impact des incidents. Elle est accompagnée de fiches pratiques pour accélérer la réponse à incident.\n\nComment sont menées les actions de détection et d'investigation?\n\nNiveau 0 : L'organisation ne possède pas d'outils de détection, d'investigation et de réponse à incident.\n\nNiveau 1 : Des outils sont mis en place pour faciliter les actions de détection et d'investigation.\n\nNiveau 2 : Des outils de détection et d'endiguement sont mis en place pour faciliter les actions de détection et la réponse à incident.\n\nNiveau 3 : Des outils de détection et d'endiguement sont mis en place et testés régulièrement lors d'exercice pour faciliter les actions de détection et la réponse à incident. \n\nDes outils numériques déconnectés, sont disponibles pour réaliser les investigations numériques.\n\nLes équipes sont formées à l'utilisation de ces outils.\n\nComment sont formalisées les procédure de confinement en amont de la crise ?\n\nNiveau 0 : Les procédures de confinement ne sont pas identifiées. \n\nNiveau 1 : Les actions à réaliser par les équipes techniques sont définies de manière informelle. \n\nNiveau 2 : Des listes d'actions à réaliser par les équipes techniques sont formalisées et validées. Des mémos techniques sur les procédures de confinement et d’éradication d’une menace cyber active sont définis. Ces procédures sont adaptées aux différents types de menaces cyber (DDoS, rançongiciel, fuite de données, etc.).\n\nNiveau 3 : Des listes d'actions à réaliser par les équipes techniques sont formalisées et validées. Des mémos techniques sur les procédures de confinement et d’éradication d’une menace cyber active sont formalisés et testés. Ces procédures sont adaptées aux différents types de menaces cyber (DDoS, rançongiciel, fuite de données, etc.).\n\nDes mémos techniques sont-ils à disposition des équipes ?\n\nNiveau 0 : Des mémos techniques ne sont pas formalisés. \n\nNiveau 1 : Les mémos techniques intègrent des listes d'actions à mener par les différentes équipes métiers.\n\nNiveau 2 : Les mémos techniques sont complétés par les aspects fonctionnels et stratégiques de la gestion de crise et intègrent en particulier des listes d’actions à mener par les différentes équipes métiers.\n\nCes mémos techniques sont adaptés aux différents types de menaces cyber (DDoS, rançongiciel, fuite de données, etc.).\n\nNiveau 3 : Les mémos techniques sont complétés par les aspects fonctionnels et stratégiques de la gestion de crise et intègrent en particulier des listes d’actions à mener par les différentes équipes métiers.\n\nCes mémos sont testés lors d’exercices de gestion de crise. Ils font l’objet d’une mise à jour après chaque exercice ou d’une utilisation en situation de crise. Ces mémos techniques sont adaptés aux différents types de menaces cyber (DDoS, rançongiciel, fuite de données, etc.).\n\nComment est défini le plan de durcissement durant la crise ? Comment les investigations sont-elles intégrés dans le travail de durcissement ?\n\nNiveau 0 : Aucun plan de durcissement n'est défini ou mis en place.\n\nNiveau 1 : Des actions de durcissement sont mises en place sur la base de fiches réflexes, sans tenir compte des résultats d'investigation.\n\nNiveau 2 : Un plan de durcissement et de remédiation est élaboré de façon  itérative en fonction des retours des investigations numériques. Les fiches réflexes sont adaptées aux différents types de menaces cyber (DDoS, rançongiciel, fuite de données, etc.).\n\nNiveau 3 : Un plan de durcissement et de remédiation est élaboré de façon  itérative en fonction des retours des investigations numériques. Les fiches réflexes sont adaptées aux différents types de menaces cyber (DDoS, rançongiciel, fuite de données, etc.).\n\nUne bulle sécurisée est mise en place pour les opérations les plus sensibles et la reconstruction du système d'information. Cette bulle, ainsi que les systèmes reconstruits sont suivi via des outils de surveillance, en particulier ceux \n\nidentifiés comme précédemment compromis par l’investigation.\n\nQuelle gouvernance est mise en place dans le cadre du durcissement et de la remédiation des SI?\n\nNiveau 0 : Aucune gouvernance n'est défini pour suivre le plan de durcissement des SI.\n\nNiveau 1 : Un plan d'action consolide la liste des mesures à entreprendre pour durcir les systèmes et isoler l'attaquant. Les mesures sont mises en place et consolidés dans le document.\n\nNiveau 2 : Un plan d'action consolide la liste des actions à entreprendre pour durcir les systèmes et isoler l'attaquant. Les mesures sont mises en place et consolidés dans le document. \n\nEn cas de mesures structurantes, les risques et impacts sur les SI et les métiers sont identifiés et validés en amont de leur déploiement, et les risques de ne pas appliquer les mesures sont consolidés.\n\nNiveau 3 : Un plan d'actions consolide la liste des actions à entreprendre pour durcir les systèmes et isoler l'attaquant. Les mesures sont mises en place et consolidés dans le document, ainsi que les risques et impacts associés à l'application ou non-application des mesures.\n\nUn plan de conduite du changement, soutenu par la cellule décisionnelle, est mis en place pour aider les utilisateurs suites aux changements nécessaire dans les pratiques d'utilisation ou d'administration des systèmes.\n\nComment les mesures conservatoires et de remédiation sont-elles validées par la cellule stratégique durant la crise ?\n\nNiveau 0 : Les mesures conservatoires et de remédiation mises en place par les équipes cyber IT ne font jamais l'objet d'une validation par la cellule stratégique.\n\nNiveau 1 : Les cas où les mesures conservatoires et de remédiation font l'objet d'une validation par la cellule stratégique sont définis informellement.\n\nNiveau 2 : Les cas où les mesures conservatoires et de remédiation font l'objet d'une validation par la cellule stratégique sont formalisés en amont et incluent en particulier toutes les mesures qui ont des conséquences sur la continuité de l'activité (isolement, déconnexion d’applicatifs ou serveur, blocage des accès Internet, etc.).\n\nNiveau 3 : Les cas où les mesures conservatoires et de remédiation font l'objet d'une validation par la cellule stratégique sont formalisés en amont et incluent en particulier toutes les mesures qui ont des conséquences sur la continuité de l'activité (isolement, déconnexion d’applicatifs ou serveur, blocage des accès Internet, etc.). La cellule stratégique est formée sur les conséquences de continuité de certaines mesures, et des exercices sur tables testent leur prise de décision."}
{"page":1,"tags":["Continuité d'activité et reconstruction"],"text":"Comment est établie et priorisée la liste des services critiques ?\n\nNiveau 0 : Les services critiques et applications associés ne sont pas listées.\n\nNiveau 1 : Une liste des services critiques et des applications associées est informelle ou incomplète.\n\nNiveau 2 : Sur la base d'un bilan d'impact, la liste des services critiques et des applications associées est formalisée. Elle est classée selon la criticité des services.\n\nNiveau 3 : Sur la base d'un bilan d'impact, la cartographie des services, des applications et des activités critiques, ainsi que des données essentielles a été établie. Cette cartographie est régulièrement mise à jour et sauvegardée hors ligne. Elle est classée selon la criticité des services.\n\nComment sont cartographiés les actifs technologiques ?\n\nNiveau 0 : Les principaux actifs technologiques ne sont pas listés.\n\nNiveau 1 : Les principaux actifs technologiques et leurs dépendances sont listés de manière informelle. \n\nNiveau 2 : La cartographie des principaux actifs technologiques et leurs dépendances est formalisée et sauvegardée hors-ligne. \n\nNiveau 3 : Une cartographie des principaux actifs technologiques et leurs dépendances est à jour et sauvegardée hors-ligne tous les ans.\n\nComment sont cartographiés les services numériques externalisés ?\n\nNiveau 0 : Les interconnexions avec les services externalisés ne sont pas listées. \n\nNiveau 1 : Les interconnexions avec les services externalisés sont listées de manière informelle.\n\nNiveau 2 : Les interconnexions sont cartographiées, la cartographie est à jour et disponibles hors-ligne.\n\nNiveau 3 : Les interconnexions sont cartographiées, la cartographie est à jour et disponibles hors-ligne. La liste de contacts d'urgences des prestataires est également formalisée et disponible-hors ligne.\n\nQuelles informations sont inclues dans le plan de continuité d'activité ?\n\nNiveau 0 : Il n'existe pas de PCA couvrant les risques numériques et cyber.\n\nNiveau 1 : Un ou plusieurs PCA inclut l’analyse, l’évaluation et le traitement des risques numériques et cyber. \n\nNiveau 2 : Un ou plusieurs PCA inclut l’analyse, l’évaluation et le traitement des risques numériques et cyber. \n\nCes PCA prennent notamment en compte une perte totale ou un fonctionnement très dégradé des services et des processus critiques de l’organisation.\n\nDes mesures relatives au PCA, tel que le temps d’arrêt maximal tolérable et le temps de récupération des données sont définies en intégrant les scénarios cyber.\n\nDes solutions de continuité d’activité sont identifiées en lien avec les équipes cyber et IT. \n\nNiveau 3 : Un ou plusieurs PCA inclut l’analyse, l’évaluation et le traitement des risques numériques et cyber et prend notamment en compte une perte totale ou un fonctionnement très dégradé des services et des processus critiques de l’organisation.\n\nDes mesures relatives au PCA, tel que le temps d’arrêt maximal tolérable et le temps de récupération des données sont définies en intégrant les scénarios cyber.\n\nDes solutions de continuité d’activité sont identifiées en lien avec les équipes cyber et IT. Elles sont testées. \n\nDes dispositifs opérationnels métiers sont envisagés et maintiennent à un seuil minimum le fonctionnement des processus critiques de l’organisation. Les dispositifs sont testés.\n\nComment sont consultés les métiers pour l'intégration des aspects cyber dans les PCA \"Métiers\"?\n\nNiveau 0 : Les métiers ne sont pas consultés lors de l'intégration des aspects cyber dans les PCA \"Métiers\".\n\nNiveau 1 : Les métiers sont consultés de manière informelle lors de l'intégration des aspects cyber dans les PCA \"Métiers\".\n\nNiveau 2 : Les équipes cyber et SI accompagnent les métiers pour l’analyse, l’évaluation et le traitement des risques numériques et cyber via une compréhension des impacts pour l’activité métiers, afin d'intégrer les ressources SI dans les PCA métiers.\n\nNiveau 3 : Les équipes cyber et SI accompagnent les métiers pour l’analyse, l’évaluation et le traitement des risques numériques et cyber via une compréhension des impacts pour l’activité métiers, afin d'intégrer les ressources SI dans les PCA métiers. Les équipes cyber et SI mettent à jour régulièrement, avec les métiers, l'analyse et le traitement des risques.\n\nComment l'activité des prestataires de services numériques (hébergement, nuagique, administration\/maintenance, etc.) est inclue dans le PCA ?\n\nNiveau 0 : Le PCA ne prévoit pas de situation en lien avec l'activité des prestataires.\n\nNiveau 1 : Le PCA ne prévoit qu'une partie des situations liées à l'activité des prestataires. \n\nNiveau 2 : Les périmètres du PCA intègrent également la perte d’une solution nuagique, d’un partenaire ou prestataire de services numériques de l’entité. \n\nNiveau 3 : Les périmètres du PCA intègrent également la perte d’une solution nuagique, d’un partenaire ou prestataire de l’entité. \n\nLes modalités de gestion de crise cyber sont intégrées dans les contrats d’infogérance et d’externalisation. \n\nLe PCA est maintenu à jour tous les ans et stocké hors-ligne.\n\nComment est envisagée l'indisponibilité des services numériques dans le PCA ?\n\nNiveau 0 : Les PCA métiers ne prévoit pas l'indisponibilité des services numériques. \n\nNiveau 1 : En cas d'indisponibilité des services numériques, des solutions de continuité d'activité métier ont été définies de manière informelle. \n\nNiveau 2 : En cas d'indisponibilité des services numériques, des solutions de continuité d'activité métier ont été définies et validées. \n\nNiveau 3 : En cas d’indisponibilité des services et outils numériques, des solutions de continuité d’activité sont définies, testées et mises à jour régulièrement.\n\nComment est définie les métriques de continuité (TAMT, DMIA, PDMA, TRD) ?\n\nNiveau 0 : Les métriques de continuité d'activité ne sont pas définies.\n\nNiveau 1 : Les métriques de continuité d'activité sont définies pour certains services critiques. \n\nNiveau 2 : Les métriques de continuité d'activité sont définies pour chaque service. \n\nNiveau 3 : Les métiers définissent pour chaque service Les métriques de continuité d'activité intégrant un temps d’indisponibilité long, lié au scénario de risque cyber.\n\nComment est surveillé l'évolution de l'état de la menace cyber ?\n\nNiveau 0 : L'état de la menace cyber n'est pas surveillé.\n\nNiveau 1 : L'état de la menace cyber fait l'objet d'une surveillance ponctuelle. \n\nNiveau 2 : L’état de la menace cyber est régulièrement revu et alimente la réflexion sur la résilience des solutions et des processus mis en place.\n\nNiveau 3 : L’état de la menace cyber est revu et analysé régulièrement. Il conditionne les choix de solutions et de processus mis en place dans les plans de continuité d'activité.\n\nComment sont priorisées les actions à mener pour relancer les services numériques et l'activité des métiers ?\n\nNiveau 0 : Les actions à réaliser ne sont pas définies. \n\nNiveau 1 : La liste des actions à réaliser est établie sans priorisation. \n\nNiveau 2 : Les actions à réaliser sont formalisées dans un planning avec une priorisation (P0 – P1 – P2 – P3) des applications et des systèmes en fonction de leur criticité.\n\nNiveau 3 : Le planning des actions prioritaires inclut  les reconstructions de l’Active Directory, des serveurs, des postes de travail, des systèmes de noms de domaines (DNS), des infrastructures de gestion des clés (PKI), et de toute infrastructure critique.\n\nComment est défini le plan de sauvegarde des données ?\n\nNiveau 0 : Aucun plan de sauvegarde des données n'a été défini. \n\nNiveau 1 : Le plan de sauvegarde est défini de manière informelle. \n\nNiveau 2 : Le plan de sauvegarde  des données est défini et validé, et repose sur l'existence de sauvegarde saines. Les sauvegardes sont stockés dans un espace sécurisé, respectant la politique de sauvegarde définie et avec une copie hors ligne disponible.\n\nNiveau 3 : Un plan de sauvegarde et de restauration des données est défini et validé. Ce plan est revu régulièrement sur la base d'une analyse de la menace cyber. Il s’appuie sur l’existence de sauvegardes saines. Les sauvegardes sont stockés dans un espace sécurisé, respectant la politique de sauvegarde définie et avec une copie hors ligne disponible.\n\nCes dernières sont cataloguées dans un stockage protégé. Le risque d’une incohérence de données liées à leur synchronisation est pris en compte.\n\nLes procédures de basculement sur un réseau SI de secours sont-elles formalisées ?\n\nNiveau 0 : L'organisation ne possède pas de réseau de secours SI. \n\nNiveau 1 : L'organisation possède un réseau de secours SI et les procédures de basculement sur ce réseau sont définies de manière informelle.\n\nNiveau 2 : Les procédures de basculement sur le réseau de secours SI sont définies et validées. \n\nNiveau 3 : Des procédures de basculement sur un réseau de secours SI sont validées et testées au moins une fois par an.\n\nLes processus de restauration des données et de réinstallation des SI sont-ils formalisés ?\n\nNiveau 0 : Il n'existe pas de processus de restauration des données ou de réinstallation des SI. \n\nNiveau 1 : Le processus de restauration des données et de réinstallation des SI est défini de manière informelle.\n\nNiveau 2 : Des processus de restauration des données et de réinstallation des SI sont formalisés et validées,  avec des procédures de basculement.\n\nNiveau 3 : Des processus de restauration des données et de réinstallation des SI sont formalisés et validées,  avec des procédures de basculement. La restauration des sauvegardes et les procédures sont sont testées au moins une fois par an. Ces tests sont en particulier réalisés en cohérence avec les processus métier, via des tests unitaires et des tests par bloc métier (ensemble d'applications cohérentes pour supporter un processus métier).\n\nQuelles gouvernance est mise en place dans le cadre de la reconstruction des SI?\n\nNiveau 0 : La reconstruction des SI n'est pas formellement suivie.\n\nNiveau 1 : Une stratégie de reconstruction est définie. Elle conduit à un état des lieux régulièrement partagé à la cellule opérationnelle cyber et IT et la \n\ncellule stratégique.\n\nNiveau 2 : Une stratégie de reconstruction \n\nest définie et validée par la cellule stratégique. Elle conduit à un état des lieux régulièrement partagé à la cellule opérationnelle cyber et IT et la \n\ncellule stratégique. La stratégie repose sur l'utilisation de sauvegarde saines, les risques de perte de données en cas de sauvegardes désynchronisés sont identifiés et communiquées. \n\nNiveau 3 : Une stratégie de reconstruction est définie et validée par la cellule stratégique. Elle conduit à un état des lieux régulièrement partagé  à la cellule opérationnelle cyber et IT et la cellule stratégique. La stratégie repose sur l'utilisation de sauvegarde saines, les risques de perte de données en cas de sauvegardes désynchronisés sont identifiés et communiquées.\n\nLe PRA est adapté en fonction des \n\navancées de l'’investigation et de remédiation.\n\nComment l'industrialisation de la reconstruction est-elle effectuée?\n\nNiveau 0 : La reconstruction des systèmes d'information n'est pas industrialisée.\n\nNiveau 1 : Une procédure consolide les principales règles d'industrialisation de la reconstruction. Un plan d'action consolide les actions à entreprendre et l'avancée du chantier. \n\nNiveau 2 : Une procédure consolide les principales règles d'industrialisation de la reconstruction. Un plan d'action consolide les actions à entreprendre et l'avancée du chantier. Le support en ressources \n\nest renforcé pour assurer la  reconstruction SI, le cas échéant en  travail posté (24 h\/24).\n\nNiveau 3 : Une procédure consolide les principales règles d'industrialisation de la reconstruction. Un plan d'action consolide les actions à entreprendre et l'avancée du chantier. Le support en ressources \n\nest renforcé pour assurer la \n\nreconstruction SI, le cas échéant en \n\ntravail posté (24 h\/24). Des procédures ou des scripts sont produits pour faciliter la reconstruction. Les métiers sont mobilisés pour réaliser des tests utilisateurs avant la remise en production des applications.\n\nComment les travaux de reconstruction et d'industrialisation sont-ils vérifiés et sécurisés?\n\nNiveau 0 : Aucune vérification de sécurité n'a lieu sur les systèmes reconstruits.\n\nNiveau 1 : Une checklist de sécurité standard est définie pour la reconstruction, et est vérifiée avant mise en production.\n\nNiveau 2 : Une checklist de sécurité standard est définie pour la reconstruction, et est vérifiée avant mise en production. Une coordination renforcée est \n\nmise en œuvre entre les équipes  en charge du durcissement et  de la remédiation et celles en charge de la reconstruction afin de faire appliquer les mesures de cybersécurité. \n\nNiveau 3 : Une checklist de sécurité standard est définie pour la reconstruction, et est vérifiée avant mise en production. Une coordination renforcée est \n\nmise en œuvre entre les équipes  en charge du durcissement et  de la remédiation et celles en charge de la reconstruction afin de faire appliquer les mesures de cybersécurité. \n\nLa vérification des règles de sécurité est automatisée au maximum par des outils. Les systèmes mis en production sont sous la surveillance d'outils de détection."}
