{"page":1,"tags":["Recommandations aux commanditaires"],"text":"Cette annexe liste les recommandations de l’ANSSI aux commanditaires de prestations d’informatique en nuage."}
{"page":1,"tags":["Recommandations aux commanditaires"],"text":"a)     Le commanditaire peut, lorsqu’il est une autorité administrative ou un opérateur d’importance vitale, demander à l’ANSSI de participer à la définition du cahier des charges faisant l’objet d’un appel d’offres ou d’un contrat."}
{"page":1,"tags":["Recommandations aux commanditaires"],"text":"b)    Il est recommandé que le commanditaire choisisse son prestataire dans le catalogue des prestataires qualifiés publié sur le site de l’ANSSI, la qualification d’un prestataire d’informatique en nuage attestant de sa conformité à l’ensemble des exigences du présent référentiel."}
{"page":1,"tags":["Recommandations aux commanditaires"],"text":"-        choisir le prestataire dans le catalogue des prestataires qualifiés publié sur le site de l’ANSSI ;"}
{"page":1,"tags":["Recommandations aux commanditaires"],"text":"-        exiger du prestataire de stipuler dans la convention de service que la prestation réalisée est une prestation qualifiée."}
{"page":1,"tags":["Recommandations aux commanditaires"],"text":"En effet, un prestataire qualifié garde la faculté de réaliser des prestations non qualifiées. Le recours à un prestataire issu du catalogue des prestataires qualifiés est donc une condition nécessaire mais pas suffisante pour bénéficier d’une prestation qualifiée, le commanditaire doit donc également exiger une prestation qualifiée."}
{"page":1,"tags":["Recommandations aux commanditaires"],"text":"d)    Il est recommandé que le commanditaire utilise le guide d’achat des produits de sécurité et des services de confiance [GUIDE_ACHAT] qui a pour vocation à accompagner la fonction achat des commanditaires lors des appels d’offres."}
{"page":1,"tags":["Recommandations aux commanditaires"],"text":"e)     Le commanditaire peut, conformément au processus de qualification des prestataires de service de confiance [PROCESS_QUALIF], déposer auprès de l’ANSSI une réclamation contre un prestataire qualifié pour lequel il estime que ce dernier n’a pas respecté une ou plusieurs exigences du présent référentiel dans le cadre d’une prestation qualifiée."}
{"page":1,"tags":["Recommandations aux commanditaires"],"text":"S’il s’avère après instruction de la réclamation que le prestataire n’a pas respecté une ou plusieurs exigences du présent référentiel dans le cadre d’une prestation qualifiée, et selon la gravité, la qualification du prestataire peut être suspendue, retirée ou sa portée de qualification réduite."}
{"page":1,"tags":["Recommandations aux commanditaires"],"text":"f)      La qualification d’un prestataire n’atteste pas de sa capacité à accéder ou à détenir des informations classifiées de défense [IGI_1300]"}
{"page":1,"tags":["Recommandations aux commanditaires"],"text":"g)     La qualification d’un prestataire n’atteste pas de sa capacité à accéder ou à détenir des articles contrôlés de la sécurité des systèmes d’information (ACSSI) [II_910]."}
{"page":1,"tags":["Recommandations aux commanditaires"],"text":"h)    La conformité du service du prestataire au référentiel SecNumCloud ne se substitue pas aux exigences légales ou réglementaires applicables à certaines données spécifiques telles que les données de niveau Diffusion Restreinte ou les données de santé."}
{"page":1,"tags":["Recommandations aux commanditaires"],"text":"i)      Pour l’accès aux interfaces de gestion du service, il est recommandé que le commanditaire utilise des moyens (terminaux, serveurs) dédiés aux tâches d’administration et conformes aux recommandations du guide [NT_ADMIN]."}
