{"page":1,"tags":["Introduction","Acronymes et définitions","Acronymes","ANSSI"],"text":"Agence nationale de la sécurité des systèmes d’information"}
{"page":1,"tags":["Introduction","Acronymes et définitions","Acronymes","CaaS"],"text":"Container as a service"}
{"page":1,"tags":["Introduction","Acronymes et définitions","Acronymes","CNIL"],"text":"Commission nationale de l’informatique et des libertés"}
{"page":1,"tags":["Introduction","Acronymes et définitions","Acronymes","EBIOS"],"text":"Expression des besoins et identification des objectifs de sécurité"}
{"page":1,"tags":["Introduction","Acronymes et définitions","Acronymes","IaaS"],"text":"Infrastructure as a service"}
{"page":1,"tags":["Introduction","Acronymes et définitions","Acronymes","PaaS"],"text":"Platform as a service"}
{"page":1,"tags":["Introduction","Acronymes et définitions","Acronymes","PASSI"],"text":"Prestataire d’audit de la sécurité des systèmes d’information"}
{"page":1,"tags":["Introduction","Acronymes et définitions","Acronymes","PDIS"],"text":"Prestataire de détection des incidents de sécurité"}
{"page":1,"tags":["Introduction","Acronymes et définitions","Acronymes","PRIS"],"text":"Prestataire de réponse aux incidents de sécurité"}
{"page":1,"tags":["Introduction","Acronymes et définitions","Acronymes","SaaS"],"text":"Software as a service"}
{"page":1,"tags":["Introduction","Acronymes et définitions","Acronymes","SDN"],"text":"Software Defined Network"}
{"page":1,"tags":["Introduction","Acronymes et définitions","Définitions","Actions d’administration"],"text":"Ensemble des actions d’installation, de suppression, de modification et de consultation de la configuration d’un système participant au système d’information du service et susceptibles de modifier le fonctionnement ou la sécurité de celui-ci."}
{"page":1,"tags":["Introduction","Acronymes et définitions","Définitions","Audit"],"text":"Processus systématique, indépendant et documenté en vue d'obtenir des preuves et de les évaluer de manière objective pour déterminer dans quelle mesure les exigences d’un référentiel sont satisfaites."}
{"page":1,"tags":["Introduction","Acronymes et définitions","Définitions","Bien"],"text":"Tout élément représentant de la valeur pour le service à qualifier."}
{"page":1,"tags":["Introduction","Acronymes et définitions","Définitions","Changement majeur"],"text":"Toute action planifiée par le prestataire et susceptible, par sa nature ou sa portée, de compromettre la sécurité du service (exemple : modification de l’organisation, modification d’une procédure, ajout, modification ou suppression d’un composant de l’infrastructure technique)."}
{"page":1,"tags":["Introduction","Acronymes et définitions","Définitions","Cloud computing (informatique en nuage)"],"text":"Modèle permettant un accès aisé, généralement à la demande, et au travers d’un réseau, à un ensemble de ressources informatiques partagées et configurables."}
{"page":1,"tags":["Introduction","Acronymes et définitions","Définitions","Commanditaire"],"text":"Entité faisant appel à un prestataire de services d’informatique en nuage."}
{"page":1,"tags":["Introduction","Acronymes et définitions","Définitions","Conteneur (Container)"],"text":"Instance d’exécution en espace utilisateur, isolée des autres instances par des mécanismes d’abstraction fournis par le noyau d’un système d’exploitation."}
{"page":1,"tags":["Introduction","Acronymes et définitions","Définitions","État de l’art"],"text":"Ensemble des bonnes pratiques, des technologies et des documents de référence relatifs à la sécurité des systèmes d’information publiquement accessibles, et des informations qui en découlent de manière évidente. Ces documents peuvent être mis en ligne sur Internet par la communauté de la sécurité des systèmes d’information, diffusés par des organismes de référence ou encore d’origine réglementaire."}
{"page":1,"tags":["Introduction","Acronymes et définitions","Définitions","Hébergement externe partagé"],"text":"Modèle permettant un accès aisé et au travers d’un réseau, à un ensemble de ressources informatiques partagées et configurables."}
{"page":1,"tags":["Introduction","Acronymes et définitions","Définitions","Incident lié à la sécurité de l’information"],"text":"Un ou plusieurs événement(s) liés à la sécurité de l’information, indésirable(s) ou inattendu(s) présentant une probabilité forte de compromettre les opérations liées à l’activité de l’organisme ou de menacer la sécurité de l’information."}
{"page":1,"tags":["Introduction","Acronymes et définitions","Définitions","Infrastructure technique"],"text":"Ensemble des composants matériels et logiciels nécessaires à la fourniture d’un service d’informatique en nuage (IaaS, CaaS, PaaS, SaaS, etc.)."}
{"page":1,"tags":["Introduction","Acronymes et définitions","Définitions","Interface d’administration"],"text":"Interface logicielle permettant à une entité disposant des privilèges requis (un administrateur, un compte de service, un développeur « DevOps », etc.) de réaliser des actions d’administration d’un système d’information."}
{"page":1,"tags":["Introduction","Acronymes et définitions","Définitions","Intergiciel (Middleware)"],"text":"Logiciel qui se trouve entre un système d’exploitation et les applications qui s’exécutent sur celui-ci, afin de faciliter les interactions entre elles."}
{"page":1,"tags":["Introduction","Acronymes et définitions","Définitions","Menace"],"text":"Cause potentielle d’un incident indésirable pouvant nuire à un système ou à un organisme."}
{"page":1,"tags":["Introduction","Acronymes et définitions","Définitions","Mesure de sécurité"],"text":"Mesure qui modifie la vraisemblance ou la gravité d’un risque. Elle comprend la politique, les procédures, les lignes directrices, et les pratiques ou structures organisationnelles, et peut être de nature administrative, technique, managériale ou juridique."}
{"page":1,"tags":["Introduction","Acronymes et définitions","Définitions","Politique"],"text":"Intentions et orientations d’un organisme telles que formalisées par sa direction."}
{"page":1,"tags":["Introduction","Acronymes et définitions","Définitions","Prestataire"],"text":"Organisme proposant un service d’informatique en nuage et visant la qualification.  Prestataire d’audit de la sécurité des systèmes d’information – organisme réalisant des prestations d’audit de la sécurité des systèmes d’information. Il est dit qualifié si un organisme de qualification a attesté de sa conformité au Référentiel d’exigences des prestataires d’audit de la sécurité des systèmes d’information."}
{"page":1,"tags":["Introduction","Acronymes et définitions","Définitions","Ressources virtualisées"],"text":"Abstraction des ressources matérielles d’un système (CPU, RAM, etc.) qui sont mises à disposition par l’infrastructure technique."}
{"page":1,"tags":["Introduction","Acronymes et définitions","Définitions","Risque"],"text":"Effet de l’incertitude sur l’atteinte des objectifs. Il est exprimé en termes de combinaison des conséquences d’un événement et de sa vraisemblance."}
{"page":1,"tags":["Introduction","Acronymes et définitions","Définitions","Sécurité d’un système d’information"],"text":"Ensemble des moyens techniques et non-techniques de protection permettant à un système d’information d’assurer la disponibilité, l’intégrité et la confidentialité des données, traitées ou transmises, et des services connexes que ces systèmes offrent ou rendent accessibles."}
{"page":1,"tags":["Introduction","Acronymes et définitions","Définitions","Supervision"],"text":"Surveillance du bon fonctionnement d’un système d’information ou d’un service. Elle concerne la collecte de données (mesures, alarmes, etc.) mais elle ne permet pas d’agir sur l’élément surveillé (ce qui relève des tâches d’administration)."}
{"page":1,"tags":["Introduction","Acronymes et définitions","Définitions","Support (technique)"],"text":"Ensemble des actions de diagnostic ayant pour finalité la résolution des problèmes rencontrés par les commanditaires. Par défaut, aucun accès aux données des commanditaires n’est autorisé dans le cadre de ces tâches. Si la résolution du problème nécessite une action de la part du prestataire, cette dernière relève dès lors de l’administration et doit être effectuée dans les conditions idoines."}
{"page":1,"tags":["Introduction","Acronymes et définitions","Définitions","Système d’information"],"text":"Ensemble organisé de ressources (matériels, logiciels, personnels, données et procédures) permettant de traiter et de diffuser de l’information."}
{"page":1,"tags":["Introduction","Acronymes et définitions","Définitions","Vulnérabilité"],"text":"Faiblesse d’un bien ou d’une mesure pouvant être exploitée par une menace ou un groupe de menaces."}
{"page":1,"tags":["Introduction","Acronymes et définitions","Rôles","Administrateur"],"text":"Utilisateur disposant de droits privilégiés lui permettant de réaliser les tâches d’administration qui lui sont attribuées."}
{"page":1,"tags":["Introduction","Acronymes et définitions","Rôles","Administrateur d’infrastructure"],"text":"Administrateur en charge de la gestion et du maintien en conditions opérationnelles et en condition de sécurité de l’infrastructure technique du service."}
{"page":1,"tags":["Introduction","Acronymes et définitions","Rôles","Utilisateur"],"text":"Toute personne disposant d’un compte dans le périmètre du service. Ce terme générique englobe les utilisateurs finaux et les administrateurs."}
{"page":1,"tags":["Introduction","Acronymes et définitions","Rôles","Utilisateur final"],"text":"Personne jouissant in fine du service mis en œuvre. Il peut s’agir du personnel du commanditaire dans le cas d’un service interne, ou de ses propres commanditaires dans le cas d’un service proposé à l’extérieur."}
{"page":1,"tags":["Introduction","Acronymes et définitions","Rôles"],"text":"Le rôle d’administrateur d’infrastructure est toujours sous la responsabilité du prestataire."}
{"page":1,"tags":["Introduction","Acronymes et définitions","Rôles"],"text":"Selon le mode de partage des responsabilités entre le prestataire et le commanditaire décrit dans la convention de service, des rôles d’administrateur de sécurité, d’administrateur système, d’administrateur réseau... peuvent se trouver sous la responsabilité du prestataire ou celle du commanditaire."}
{"page":1,"tags":["Activités visées par le référentiel","Fourniture de services SaaS"],"text":"Ce service concerne la mise à disposition par le prestataire d’applications hébergées sur une plateforme d’informatique en nuage. Le commanditaire n’a pas la maîtrise de la plateforme en nuage sous-jacente. Le prestataire gère de façon transparente pour le commanditaire l’ensemble des aspects techniques requérant des compétences informatiques. Le commanditaire garde la possibilité d’effectuer quelques paramétrages métier dans l’application.\nExemples : « CRM », outils collaboratifs, messagerie, Business Intelligence, « ERP », etc."}
{"page":1,"tags":["Activités visées par le référentiel","Fourniture de services PaaS"],"text":"Ce service concerne la mise à disposition par le prestataire de plateformes d’hébergement d’applications. Le commanditaire n’a pas la maîtrise de l’infrastructure technique sous-jacente, gérée et contrôlée par le prestataire (réseau, serveurs, OS, stockage, etc.). Le commanditaire a cependant la maîtrise des applications déployées sur cette plateforme. Il peut aussi avoir la maîtrise de certains services composant cette plateforme ou de certains éléments de configuration suivant la répartition des rôles définie dans le service.\nExemple : framework de type Apache, Tomcat, PHP et MySQL permettant de développer des applications web."}
{"page":1,"tags":["Activités visées par le référentiel","Fourniture de services CaaS"],"text":"Ce service concerne la mise à disposition d’outils permettant le déploiement et l’orchestration de conteneurs. Le commanditaire n’a pas la maîtrise de l’infrastructure technique sous-jacente (réseau, stockage, serveurs, système d’exploitation), gérée et contrôlée par le prestataire. Le commanditaire a cependant la maîtrise des outils systèmes, bibliothèques, intergiciels, et du code de l’application."}
{"page":1,"tags":["Activités visées par le référentiel","Fourniture de services IaaS"],"text":"Ce service concerne la mise à disposition de ressources informatiques abstraites (puissance CPU, mémoire, stockage etc.). Le modèle IaaS permet au commanditaire de disposer de ressources externalisées, potentiellement virtualisées. Ce dernier garde le contrôle sur le système d’exploitation (OS), le stockage, les applications déployées ainsi que sur certains composants réseau (pare-feu, par exemple)."}
{"page":1,"tags":["Qualification des prestataires de services d’informatique en nuage","Modalités de la qualification"],"text":"Le référentiel contient les exigences et les recommandations à destination des prestataires de services d’informatique en nuage."}
{"page":1,"tags":["Qualification des prestataires de services d’informatique en nuage","Modalités de la qualification"],"text":"La qualification d’un prestataire est réalisée conformément au processus de qualification d’un prestataire de services de confiance [PROCESS_QUALIF] et permet d’attester de la conformité du prestataire aux exigences du référentiel."}
{"page":1,"tags":["Qualification des prestataires de services d’informatique en nuage","Modalités de la qualification"],"text":"Les exigences doivent être respectées par les prestataires pour obtenir la qualification."}
{"page":1,"tags":["Qualification des prestataires de services d’informatique en nuage","Modalités de la qualification"],"text":"Les recommandations sont données à titre de bonnes pratiques et ne font pas l’objet de vérification pour obtenir la qualification."}
{"page":1,"tags":["Qualification des prestataires de services d’informatique en nuage","Portée de la qualification"],"text":"Pour être qualifié, un prestataire doit répondre à toutes les exigences du présent référentiel sur la portée choisie. La portée est définie par tout ou partie des activités décrites au chapitre 2."}
{"page":1,"tags":["Qualification des prestataires de services d’informatique en nuage","Portée de la qualification"],"text":"Les prestataires qualifiés gardent la faculté de réaliser des prestations en dehors du périmètre pour lequel ils sont qualifiés, mais ne peuvent, dans ce cas, se prévaloir de la qualification sur ces prestations."}
{"page":1,"tags":["Qualification des prestataires de services d’informatique en nuage","Portée de la qualification"],"text":"Une prestation de services d’informatique en nuage qualifiée peut être associée à la réalisation d’autres prestations complémentaires (développement, intégration de produits de sécurité, etc.) sans perdre le bénéfice de la qualification."}
{"page":1,"tags":["Qualification des prestataires de services d’informatique en nuage","Avertissements","Risques liés à l’absence de qualification"],"text":"Une prestation de services d’informatique en nuage non qualifiée peut potentiellement augmenter l’exposition du commanditaire à certains risques et notamment la fuite d’informations confidentielles, la compromission, la perte ou l’indisponibilité de son système d’information."}
{"page":1,"tags":["Qualification des prestataires de services d’informatique en nuage","Avertissements","Risques liés à l’absence de qualification"],"text":"Ainsi, dans le cas d’une prestation non qualifiée, il est recommandé au commanditaire d’exiger de la part de son prestataire un document listant l’ensemble des exigences de ce référentiel non couvertes dans le cadre de sa prestation, afin de connaître les risques auxquels il s’expose."}
{"page":1,"tags":["Qualification des prestataires de services d’informatique en nuage","Avertissements","Risques liés à la protection des informations"],"text":"La conformité au référentiel SecNumCloud ne se substitue pas aux exigences légales ou réglementaires applicables à certaines données spécifiques telles que les données de niveau Diffusion Restreinte ou les données de santé."}
{"page":1,"tags":["Qualification des prestataires de services d’informatique en nuage","Avertissements","Risques liés à la protection des informations"],"text":"Les clauses de ce référentiel faisant référence à des produits qualifiés sont applicables dans la mesure où ces produits existent."}
{"page":1,"tags":["Qualification des prestataires de services d’informatique en nuage","Avertissements","Risques liés à la protection des informations"],"text":"Par ailleurs, ce référentiel repose sur un objectif de protection des données du commanditaire, mais n’apporte pas de garanties techniques fortes contre un accès du prestataire aux données traitées sur le système d’information du service, uniquement des engagements contractuels. Les commanditaires souhaitant assurer la protection, sur le plan technique, de leurs données contre un accès par le prestataire, devront par conséquent mettre en œuvre des moyens complémentaires de chiffrement, sous leur maîtrise, de leurs données."}
{"page":1,"tags":["Qualification des prestataires de services d’informatique en nuage","Avertissements","Risques liés à la protection des informations"],"text":"Enfin, il est rappelé que la virtualisation généralement utilisée dans les services d’informatique en nuage ne doit pas être considérée comme un mécanisme de cloisonnement équivalent à une séparation physique."}
{"page":1,"tags":["Niveau de sécurité"],"text":"Le respect des exigences du référentiel SecNumCloud a pour objectif l’atteinte d’un niveau de sécurité permettant le stockage et le traitement de données pour lesquelles un incident de sécurité aurait une conséquence significative pour le commanditaire. Il assure notamment le respect des bonnes pratiques de sécurité relevant de l’hygiène informatique, telles que décrites dans le guide [HYGIENE] de l’ANSSI.  La conformité d’un service d’informatique en nuage à ce référentiel n’atteste pas de sa conformité à la Politique de sécurité des systèmes d’information de l’État [PSSIE]."}
{"page":1,"tags":["Niveau de sécurité"],"text":"Le recours, par le commanditaire, à un service qualifié SecNumCloud pour l’hébergement de données soumises à des exigences légales ou réglementaires (telles que les données de niveau Diffusion Restreinte, les données de santé, etc.) nécessite le respect d’exigences complémentaires, qui doivent être déterminées dans le cadre d’une démarche d’homologation comprenant notamment une appréciation des risques (voir chapitre 3.3.2)."}
{"page":1,"tags":["Politiques de sécurité de l’information et gestion du risque","Principes"],"text":"Le prestataire doit opérer la prestation à l’état de l’art pour le type d’activité retenu : utiliser des logiciels stables bénéficiant d’un suivi des correctifs de sécurité et paramétrés de façon à obtenir un niveau de sécurité optimal."}
{"page":1,"tags":["Politiques de sécurité de l’information et gestion du risque","Principes"],"text":"Le prestataire doit appliquer le guide d’hygiène informatique de l’ANSSI [HYGIENE], niveau renforcé, au système d’information du service."}
{"page":1,"tags":["Politiques de sécurité de l’information et gestion du risque","Politique de sécurité de l’information"],"text":"Le prestataire doit documenter et mettre en œuvre une politique de sécurité de l’information relative au service."}
{"page":1,"tags":["Politiques de sécurité de l’information et gestion du risque","Politique de sécurité de l’information"],"text":"La politique de sécurité de l’information doit identifier les engagements du prestataire quant au respect de la législation et réglementation nationale en vigueur selon la nature des informations qui pourraient être confiées par le commanditaire au prestataire ; il revient en revanche in fine au commanditaire de s’assurer du respect des contraintes légales et réglementaires applicables aux données qu’il confie effectivement au prestataire."}
{"page":1,"tags":["Politiques de sécurité de l’information et gestion du risque","Politique de sécurité de l’information"],"text":"La politique de sécurité de l’information doit notamment couvrir les thèmes abordés aux chapitres 6 à 19 du présent référentiel."}
{"page":1,"tags":["Politiques de sécurité de l’information et gestion du risque","Politique de sécurité de l’information"],"text":"La direction du prestataire doit approuver formellement la politique de sécurité de l’information."}
{"page":1,"tags":["Politiques de sécurité de l’information et gestion du risque","Politique de sécurité de l’information"],"text":"Le prestataire doit réviser annuellement la politique de sécurité de l’information et à chaque changement majeur pouvant avoir un impact sur le service."}
{"page":1,"tags":["Politiques de sécurité de l’information et gestion du risque","Appréciation des risques"],"text":"Le prestataire doit documenter une appréciation des risques couvrant l’ensemble du périmètre du service."}
{"page":1,"tags":["Politiques de sécurité de l’information et gestion du risque","Appréciation des risques"],"text":"Le prestataire doit réaliser son appréciation de risques en utilisant une méthode documentée garantissant la reproductibilité et comparabilité de la démarche."}
{"page":1,"tags":["Politiques de sécurité de l’information et gestion du risque","Appréciation des risques"],"text":"la gestion d’informations du commanditaire ayant des besoins de sécurité différents ;"}
{"page":1,"tags":["Politiques de sécurité de l’information et gestion du risque","Appréciation des risques"],"text":"les risques ayant des impacts sur les droits et libertés des personnes concernées en cas d’accès non autorisé, de modification non désirée et de disparition de données à caractère personnel ;"}
{"page":1,"tags":["Politiques de sécurité de l’information et gestion du risque","Appréciation des risques"],"text":"les risques de défaillance des mécanismes de cloisonnement des ressources de l’infrastructure technique (mémoire, calcul, stockage, réseau) partagées entre les commanditaires ;"}
{"page":1,"tags":["Politiques de sécurité de l’information et gestion du risque","Appréciation des risques"],"text":"les risques liés à l’effacement incomplet ou non sécurisé des données stockées sur les espaces de mémoire ou de stockage partagés entre commanditaires, en particulier lors des réallocations des espaces de mémoire et de stockage ;"}
{"page":1,"tags":["Politiques de sécurité de l’information et gestion du risque","Appréciation des risques"],"text":"les risques liés à l’exposition des interfaces d’administration sur un réseau public ;"}
{"page":1,"tags":["Politiques de sécurité de l’information et gestion du risque","Appréciation des risques"],"text":"les risques d’atteinte à la confidentialité des données des commanditaires par des tiers impliqués dans la fourniture du service (fournisseurs, sous-traitants, etc.) :"}
{"page":1,"tags":["Politiques de sécurité de l’information et gestion du risque","Appréciation des risques"],"text":"les risques liés aux évènements naturels et sinistres physiques ;"}
{"page":1,"tags":["Politiques de sécurité de l’information et gestion du risque","Appréciation des risques"],"text":"les risques liés à la séparation des tâches (voir 6.2.a) ;"}
{"page":1,"tags":["Politiques de sécurité de l’information et gestion du risque","Appréciation des risques"],"text":"les risques liés aux environnements de développement (voir 14.4.b)."}
{"page":1,"tags":["Politiques de sécurité de l’information et gestion du risque","Appréciation des risques"],"text":"Le prestataire doit lister, dans un document spécifique, les risques résiduels liés à l’existence de lois extra-européennes ayant pour objectif la collecte de données ou métadonnées des commanditaires sans leur consentement préalable."}
{"page":1,"tags":["Politiques de sécurité de l’information et gestion du risque","Appréciation des risques"],"text":"Le prestataire doit mettre à la disposition du commanditaire, sur demande de celui-ci, les éléments d’appréciation des risques liés à la soumission des données du commanditaire au droit d’un état non-membre de l’Union Européenne."}
{"page":1,"tags":["Politiques de sécurité de l’information et gestion du risque","Appréciation des risques"],"text":"Lorsqu’il existe des exigences légales, réglementaires ou sectorielles spécifiques liées aux types d’informations confiées par le commanditaire au prestataire, ce dernier doit les prendre en compte dans son appréciation des risques en s’assurant de respecter l’ensemble des exigences du présent référentiel d’une part et de ne pas abaisser le niveau de sécurité établi par le respect des exigences du présent référentiel d’autre part."}
{"page":1,"tags":["Politiques de sécurité de l’information et gestion du risque","Appréciation des risques"],"text":"La direction du prestataire doit accepter formellement les risques résiduels identifiés dans l’appréciation des risques."}
{"page":1,"tags":["Politiques de sécurité de l’information et gestion du risque","Appréciation des risques"],"text":"Le prestataire doit réviser annuellement l’appréciation des risques et à chaque changement majeur pouvant avoir un impact sur le service."}
{"page":1,"tags":["Organisation de la sécurité de l’information","Fonctions et responsabilités liées à la sécurité de l’information"],"text":"Le prestataire doit documenter et mettre en œuvre une organisation interne de la sécurité pour assurer la définition, la mise en place et le suivi du fonctionnement opérationnel de la sécurité de l’information au sein de son organisation."}
{"page":1,"tags":["Organisation de la sécurité de l’information","Fonctions et responsabilités liées à la sécurité de l’information"],"text":"Le prestataire doit désigner un responsable de la sécurité des systèmes d’information et un responsable de la sécurité physique."}
{"page":1,"tags":["Organisation de la sécurité de l’information","Fonctions et responsabilités liées à la sécurité de l’information"],"text":"Le prestataire doit définir et attribuer les responsabilités en matière de sécurité de l’information pour le personnel impliqué dans la fourniture du service."}
{"page":1,"tags":["Organisation de la sécurité de l’information","Fonctions et responsabilités liées à la sécurité de l’information"],"text":"Le prestataire doit s’assurer après tout changement majeur pouvant avoir un impact sur le service que l’attribution des responsabilités en matière de sécurité de l’information est toujours pertinente."}
{"page":1,"tags":["Organisation de la sécurité de l’information","Fonctions et responsabilités liées à la sécurité de l’information"],"text":"Le prestataire doit définir et attribuer les responsabilités en matière de protection de données à caractère personnel, en cohérence avec son rôle dans les traitements de données à caractère personnel (responsable de traitement, sous-traitant ou co-responsable)."}
{"page":1,"tags":["Organisation de la sécurité de l’information","Fonctions et responsabilités liées à la sécurité de l’information"],"text":"Le prestataire doit, lorsqu’il traite un grand nombre de données parmi lesquelles figurent des catégories particulières de données à caractère personnel telles que définies dans [RGPD], désigner un délégué à la protection des données."}
{"page":1,"tags":["Organisation de la sécurité de l’information","Fonctions et responsabilités liées à la sécurité de l’information"],"text":"Il est recommandé que le prestataire, quel que soit le volume de données à caractère personnel qu’il traite, désigne un délégué à la protection des données."}
{"page":1,"tags":["Organisation de la sécurité de l’information","Fonctions et responsabilités liées à la sécurité de l’information"],"text":"Le prestataire doit réaliser ou contribuer à la réalisation d’une analyse d’impact relative à la protection des données à caractère personnel lorsque le traitement est susceptible d’engendrer un risque élevé pour les droits et libertés des personnes concernées (traitement de catégories particulières de données à caractère personnel telles que définies dans [RGPD], traitement de données à grande échelle, etc.). Cette analyse doit comporter une évaluation juridique du respect des principes et droits fondamentaux, ainsi qu’une étude plus technique des mesures techniques mises en œuvre pour protéger les personnes des risques pour leur vie privée."}
{"page":1,"tags":["Organisation de la sécurité de l’information","Séparation des tâches"],"text":"Le prestataire doit identifier les risques associés à des cumuls de responsabilités ou de tâches, les prendre en compte dans l’appréciation des risques et mettre en œuvre des mesures de réduction de ces risques."}
{"page":1,"tags":["Organisation de la sécurité de l’information","Relations avec les autorités"],"text":"Il est recommandé que le prestataire mette en place des relations appropriées avec les autorités compétentes en matière de sécurité de l’information et de données à caractère personnel et, le cas échéant, avec les autorités sectorielles selon la nature des informations confiées par le commanditaire au prestataire."}
{"page":1,"tags":["Organisation de la sécurité de l’information","Relations avec les groupes de travail spécialisés"],"text":"Il est recommandé que le prestataire entretienne des contacts appropriés avec des groupes de spécialistes ou des sources reconnues, notamment pour prendre en compte de nouvelles menaces et les mesures de sécurité appropriées pour les contrer."}
{"page":1,"tags":["Organisation de la sécurité de l’information","La sécurité de l’information dans la gestion de projet"],"text":"Le prestataire doit documenter une estimation des risques préalablement à tout projet pouvant avoir un impact sur le service, et ce quelle que soit la nature du projet."}
{"page":1,"tags":["Organisation de la sécurité de l’information","La sécurité de l’information dans la gestion de projet"],"text":"Dans la mesure où un projet affecte ou est susceptible d’affecter le niveau de sécurité du service, le prestataire doit avertir le commanditaire et l’informer par écrit des impacts potentiels, des mesures mises en place pour réduire ces impacts ainsi que des risques résiduels le concernant."}
{"page":1,"tags":["Sécurité des ressources humaines","Sélection des candidats"],"text":"Le prestataire doit documenter et mettre en œuvre une procédure de vérification des informations concernant son personnel conforme aux lois et règlements en vigueur."}
{"page":1,"tags":["Sécurité des ressources humaines","Sélection des candidats"],"text":"Ces vérifications s’appliquent à toute personne impliquée dans la fourniture du service et doivent être proportionnelles à la sensibilité ou à la spécificité des informations du commanditaire confiées au prestataire ainsi qu’aux risques identifiés."}
{"page":1,"tags":["Sécurité des ressources humaines","Sélection des candidats"],"text":"Pour les personnels disposant de privilèges d’administration élevés sur les composants logiciels et matériels de l’infrastructure, le prestataire doit renforcer les vérifications destinées à vérifier que les antécédents de ceux-ci ne sont pas incompatibles avec l’exercice de leurs fonctions. I"}
{"page":1,"tags":["Sécurité des ressources humaines","Sélection des candidats"],"text":"Il est entendu par des privilèges d’administration élevés, des actions permettant l’élévation de privilèges ou la possibilité de réaliser des actions sans traces techniques ou de désactiver, altérer les traces techniques."}
{"page":1,"tags":["Sécurité des ressources humaines","Conditions d’embauche"],"text":"les prestations sont réalisées avec loyauté, discrétion et impartialité et dans des conditions de confidentialité des informations traitées ;"}
{"page":1,"tags":["Sécurité des ressources humaines","Conditions d’embauche"],"text":"les personnels ne recourent qu’aux méthodes, outils et techniques validés par le prestataire ;"}
{"page":1,"tags":["Sécurité des ressources humaines","Conditions d’embauche"],"text":"les personnels s’engagent à ne pas divulguer d’informations à un tiers, même anonymisées et décontextualisées, obtenues ou générées dans le cadre de la prestation sauf autorisation formelle et écrite du commanditaire ;"}
{"page":1,"tags":["Sécurité des ressources humaines","Conditions d’embauche"],"text":"les personnels s’engagent à signaler au prestataire tout contenu manifestement illicite découvert pendant la prestation ;"}
{"page":1,"tags":["Sécurité des ressources humaines","Conditions d’embauche"],"text":"les personnels s’engagent à respecter la législation et la réglementation nationale en vigueur et les bonnes pratiques liées à leurs activités."}
{"page":1,"tags":["Sécurité des ressources humaines","Conditions d’embauche"],"text":"Le prestataire doit faire signer la charte d’éthique à l’ensemble des personnes impliquées dans la fourniture du service."}
{"page":1,"tags":["Sécurité des ressources humaines","Conditions d’embauche"],"text":"Le prestataire doit introduire, dans le contrat de travail des personnels disposant de privilèges d’administration élevés sur les composants et matériels de l’infrastructure du service, un engagement de responsabilité avec un renvoi aux clauses du code du travail sur la protection du secret des affaires et de la propriété intellectuelle. Il est entendu par des privilèges d’administration élevés, des actions permettant l’élévation de privilèges ou la possibilité de réaliser des actions sans traces techniques ou de désactiver, altérer les traces techniques."}
{"page":1,"tags":["Sécurité des ressources humaines","Conditions d’embauche"],"text":"Le prestataire doit, sur demande d’un commanditaire, lui rendre accessible le règlement intérieur et la charte d’éthique."}
{"page":1,"tags":["Sécurité des ressources humaines","Sensibilisation, apprentissage et formations à la sécurité de l’information"],"text":"Le prestataire doit sensibiliser à la sécurité de l’information et aux risques liés à la protection des données l’ensemble des personnes impliquées dans la fourniture du service. Il doit leur communiquer les mises à jour des politiques et procédures pertinentes dans le cadre de leurs missions."}
{"page":1,"tags":["Sécurité des ressources humaines","Sensibilisation, apprentissage et formations à la sécurité de l’information"],"text":"Le prestataire doit documenter et mettre en œuvre un plan de formation concernant la sécurité de l’information adapté au service et aux missions des personnels."}
{"page":1,"tags":["Sécurité des ressources humaines","Sensibilisation, apprentissage et formations à la sécurité de l’information"],"text":"Le responsable de la sécurité des systèmes d’information du prestataire doit valider formellement le plan de formation concernant la sécurité de l’information."}
{"page":1,"tags":["Sécurité des ressources humaines","Processus disciplinaire"],"text":"Le prestataire doit documenter et mettre en œuvre un processus disciplinaire applicable à l’ensemble des personnes impliquées dans la fourniture du service ayant enfreint la politique de sécurité."}
{"page":1,"tags":["Sécurité des ressources humaines","Processus disciplinaire"],"text":"Le prestataire doit, sur demande d’un commanditaire, lui rendre accessible les sanctions encourues en cas d’infraction à la politique de sécurité."}
{"page":1,"tags":["Sécurité des ressources humaines","Rupture, terme ou modification du contrat de travail"],"text":"Le prestataire doit définir et attribuer les rôles et les responsabilités relatives à la rupture, au terme ou à la modification de tout contrat avec une personne impliquée dans la fourniture du service."}
{"page":1,"tags":["Gestion des actifs","Inventaire et propriété des actifs"],"text":"les informations d’identification de l’équipement (noms, adresses IP, adresses MAC, etc.) ;"}
{"page":1,"tags":["Gestion des actifs","Inventaire et propriété des actifs"],"text":"la fonction de l’équipement ;"}
{"page":1,"tags":["Gestion des actifs","Inventaire et propriété des actifs"],"text":"le modèle de l’équipement ;"}
{"page":1,"tags":["Gestion des actifs","Inventaire et propriété des actifs"],"text":"la localisation de l’équipement ;"}
{"page":1,"tags":["Gestion des actifs","Inventaire et propriété des actifs"],"text":"le propriétaire de l’équipement ;"}
{"page":1,"tags":["Gestion des actifs","Inventaire et propriété des actifs"],"text":"le besoin de sécurité des informations (au sens du chapitre 8.3)."}
{"page":1,"tags":["Gestion des actifs","Inventaire et propriété des actifs"],"text":"Le prestataire doit tenir à jour l’inventaire de l’ensemble des logiciels mettant en œuvre le service. Cet inventaire doit identifier pour chaque logiciel, sa version et les équipements sur lesquels le logiciel est installé."}
{"page":1,"tags":["Gestion des actifs","Inventaire et propriété des actifs"],"text":"Le prestataire doit s’assurer de la validité des licences des logiciels tout au long de la prestation."}
{"page":1,"tags":["Gestion des actifs","Restitution des actifs"],"text":"Le prestataire doit documenter et mettre en œuvre une procédure de restitution des actifs permettant de s’assurer que chaque personne impliquée dans la fourniture du service restitue l’ensemble des actifs en sa possession à la fin de sa période d’emploi ou de son contrat."}
{"page":1,"tags":["Gestion des actifs","Identification des besoins de sécurité de l’information"],"text":"Le prestataire doit identifier les différents besoins de sécurité des informations relatives au service."}
{"page":1,"tags":["Gestion des actifs","Identification des besoins de sécurité de l’information"],"text":"Lorsque le commanditaire confie au prestataire des données soumises à des contraintes légales, réglementaires ou sectorielles spécifiques, le prestataire doit identifier les besoins de sécurité spécifiques associés à ces contraintes."}
{"page":1,"tags":["Gestion des actifs","Marquage et manipulation de l’information"],"text":"Il est recommandé que le prestataire documente et mette en œuvre une procédure pour le marquage et la manipulation de toutes les informations participant à la délivrance du service, conformément à son besoin de sécurité défini au chapitre 8.3."}
{"page":1,"tags":["Gestion des actifs","Gestion des supports amovibles"],"text":"Le prestataire doit documenter et mettre en œuvre une procédure pour la gestion des supports amovibles, conformément au besoin de sécurité défini au chapitre 8.3."}
{"page":1,"tags":["Gestion des actifs","Gestion des supports amovibles"],"text":"Lorsque des supports amovibles sont utilisés sur l’infrastructure technique ou pour des tâches d’administration, ces supports doivent être dédiés à un usage."}
{"page":1,"tags":["Contrôle d’accès et gestion des identités"],"text":"placés sous la responsabilité du prestataire (ses employés et éventuellement des tiers participant à la fourniture du service) ;"}
{"page":1,"tags":["Contrôle d’accès et gestion des identités"],"text":"placés sous la responsabilité du commanditaire, mais pour lesquels le prestataire met en œuvre les moyens de contrôle d’accès (en fournissant notamment au commanditaire une interface de gestion des comptes et des droits d’accès)."}
{"page":1,"tags":["Contrôle d’accès et gestion des identités"],"text":"Les utilisateurs pour lesquels le commanditaire met en œuvre les moyens de contrôle d’accès et de gestion des identités sont hors du champ d’application de ce référentiel."}
{"page":1,"tags":["Contrôle d’accès et gestion des identités","Politiques et contrôle d’accès"],"text":"Le prestataire doit documenter et mettre en œuvre une politique de contrôle d’accès sur la base du résultat de son appréciation des risques et du partage des responsabilités."}
{"page":1,"tags":["Contrôle d’accès et gestion des identités","Politiques et contrôle d’accès"],"text":"Le prestataire doit réviser annuellement la politique de contrôle d’accès et à chaque changement majeur pouvant avoir un impact sur le service."}
{"page":1,"tags":["Contrôle d’accès et gestion des identités","Enregistrement et désinscription des utilisateurs"],"text":"Le prestataire doit documenter et mettre en œuvre une procédure d’enregistrement et de désinscription des utilisateurs s’appuyant sur une interface de gestion des comptes et des droits d’accès. Cette procédure doit indiquer quelles données doivent être supprimées au départ d’un utilisateur."}
{"page":1,"tags":["Contrôle d’accès et gestion des identités","Enregistrement et désinscription des utilisateurs"],"text":"Le prestataire doit attribuer des comptes nominatifs lors de l’enregistrement des utilisateurs placés sous sa responsabilité."}
{"page":1,"tags":["Contrôle d’accès et gestion des identités","Enregistrement et désinscription des utilisateurs"],"text":"Le prestataire doit mettre en œuvre des moyens permettant de s’assurer que la désinscription d’un utilisateur entraîne la suppression de tous ses accès aux ressources du système d’information du service, ainsi que la suppression de ses données conformément à la procédure d’enregistrement et de désinscription (voir exigence 9.2 a))."}
{"page":1,"tags":["Contrôle d’accès et gestion des identités","Gestion des droits d’accès"],"text":"Le prestataire doit documenter et mettre en œuvre une procédure permettant d’assurer l’attribution, la modification et le retrait de droits d’accès aux ressources du système d’information du service."}
{"page":1,"tags":["Contrôle d’accès et gestion des identités","Gestion des droits d’accès"],"text":"Le prestataire doit mettre à la disposition de ses commanditaires les outils et les moyens qui permettent une différenciation des rôles des utilisateurs du service, par exemple suivant leur rôle fonctionnel."}
{"page":1,"tags":["Contrôle d’accès et gestion des identités","Gestion des droits d’accès"],"text":"Le prestataire doit tenir à jour l’inventaire des utilisateurs sous sa responsabilité disposant de droits d’administration sur les ressources du système d’information du service."}
{"page":1,"tags":["Contrôle d’accès et gestion des identités","Gestion des droits d’accès"],"text":"Le prestataire doit être en mesure de fournir, pour une ressource donnée mettant en œuvre le service, la liste de tous les utilisateurs y ayant accès, qu’ils soient sous la responsabilité du prestataire ou du commanditaire ainsi que les droits d’accès qui leurs ont été attribués."}
{"page":1,"tags":["Contrôle d’accès et gestion des identités","Gestion des droits d’accès"],"text":"Le prestataire doit être en mesure de fournir, pour un utilisateur donné, qu’ils soient sous la responsabilité du prestataire ou du commanditaire, la liste de tous ses droits d’accès sur les différents éléments du système d’information du service."}
{"page":1,"tags":["Contrôle d’accès et gestion des identités","Gestion des droits d’accès"],"text":"Le prestataire doit définir une liste de droits d’accès incompatibles entre eux. Il doit s’assurer, lors de l’attribution de droits d’accès à un utilisateur qu’il ne possède pas de droits d’accès incompatibles entre eux au titre de la liste précédemment établie."}
{"page":1,"tags":["Contrôle d’accès et gestion des identités","Gestion des droits d’accès"],"text":"Le prestataire doit inclure dans la procédure de gestion des droits d’accès les actions de révocation ou de suspension des droits de tout utilisateur."}
{"page":1,"tags":["Contrôle d’accès et gestion des identités","Revue des droits d’accès utilisateurs"],"text":"Le prestataire doit réviser annuellement les droits d’accès des utilisateurs sur son périmètre de responsabilité."}
{"page":1,"tags":["Contrôle d’accès et gestion des identités","Revue des droits d’accès utilisateurs"],"text":"Le prestataire doit mettre à disposition du commanditaire un outil facilitant la revue des droits d’accès des utilisateurs placés sous la responsabilité de ce dernier."}
{"page":1,"tags":["Contrôle d’accès et gestion des identités","Revue des droits d’accès utilisateurs"],"text":"Le prestataire doit réviser trimestriellement la liste des utilisateurs sur son périmètre de responsabilité pouvant utiliser les comptes techniques mentionnés dans l’exigence 9.2 b)."}
{"page":1,"tags":["Contrôle d’accès et gestion des identités","Gestion des authentifications des utilisateurs"],"text":"la gestion des moyens d’authentification (émission et réinitialisation de mot de passe, mise à jour des CRL et import des certificats racines en cas d’utilisation de certificats, etc.)."}
{"page":1,"tags":["Contrôle d’accès et gestion des identités","Gestion des authentifications des utilisateurs"],"text":"la mise en place des moyens permettant une authentification à multiples facteurs afin de répondre aux différents cas d’usage du référentiel."}
{"page":1,"tags":["Contrôle d’accès et gestion des identités","Gestion des authentifications des utilisateurs"],"text":"les systèmes qui génèrent des mots de passe ou vérifient leur robustesse, lorsqu’une authentification par mot de passe est utilisée. Ils doivent suivre les recommandations de [G_AUTH]."}
{"page":1,"tags":["Contrôle d’accès et gestion des identités","Gestion des authentifications des utilisateurs"],"text":"Tout mécanisme d’authentification doit prévoir le blocage d’un compte après un nombre limité de tentatives infructueuses."}
{"page":1,"tags":["Contrôle d’accès et gestion des identités","Gestion des authentifications des utilisateurs"],"text":"Dans le cadre d’un service SaaS, le prestataire doit proposer à ses commanditaires des moyens d’authentification à multiples facteurs pour l’accès des utilisateurs finaux."}
{"page":1,"tags":["Contrôle d’accès et gestion des identités","Gestion des authentifications des utilisateurs"],"text":"Lorsque des comptes techniques, non nominatifs, sont nécessaires, le prestataire doit mettre en place des mesures obligeant les utilisateurs à s’authentifier avec leur compte nominatif avant de pouvoir accéder à ces comptes techniques."}
{"page":1,"tags":["Contrôle d’accès et gestion des identités","Accès aux interfaces d’administration"],"text":"Les comptes d’administration sous la responsabilité du prestataire doivent être gérés à l’aide d’outils et d’annuaires distincts de ceux utilisés pour la gestion des comptes utilisateurs placés sous la responsabilité du commanditaire."}
{"page":1,"tags":["Contrôle d’accès et gestion des identités","Accès aux interfaces d’administration"],"text":"Les interfaces d’administration mises à disposition des commanditaires doivent être distinctes des interfaces d’administration utilisées par le prestataire."}
{"page":1,"tags":["Contrôle d’accès et gestion des identités","Accès aux interfaces d’administration"],"text":"Les interfaces d’administration mises à disposition des commanditaires ne doivent permettre aucune connexion avec des comptes d’administrateurs sous la responsabilité du prestataire."}
{"page":1,"tags":["Contrôle d’accès et gestion des identités","Accès aux interfaces d’administration"],"text":"Les interfaces d’administration utilisées par le prestataire ne doivent pas être accessibles à partir d’un réseau public et ainsi ne doivent permettre aucune connexion des utilisateurs sous la responsabilité du commanditaire."}
{"page":1,"tags":["Contrôle d’accès et gestion des identités","Accès aux interfaces d’administration"],"text":"Si des interfaces d’administration sont mises à disposition des commanditaires avec un accès via un réseau public, les flux d’administration doivent être authentifiés et chiffrés avec des moyens en accord avec les exigences du chapitre 10.2."}
{"page":1,"tags":["Contrôle d’accès et gestion des identités","Accès aux interfaces d’administration"],"text":"aux interfaces d’administration utilisées par le prestataire ;"}
{"page":1,"tags":["Contrôle d’accès et gestion des identités","Accès aux interfaces d’administration"],"text":"aux interfaces d’administration dédiées aux commanditaires."}
{"page":1,"tags":["Contrôle d’accès et gestion des identités","Accès aux interfaces d’administration"],"text":"Dans le cadre d’un service SaaS, les interfaces d’administration mises à disposition des commanditaires doivent être différenciées des interfaces permettant l’accès des utilisateurs finaux."}
{"page":1,"tags":["Contrôle d’accès et gestion des identités","Accès aux interfaces d’administration"],"text":"Dès lors qu’une interface d’administration est accessible depuis un réseau public, le processus d’authentification doit avoir lieu avant toute interaction entre l’utilisateur et l’interface en question."}
{"page":1,"tags":["Contrôle d’accès et gestion des identités","Accès aux interfaces d’administration"],"text":"Lorsque le prestataire utilise un service de type IaaS comme socle d’un autre type de service (CaaS, PaaS ou SaaS), les ressources affectées à l’usage du prestataire ne doivent en aucun cas être accessibles via l’interface publique mise à disposition des autres commanditaires du service IaaS."}
{"page":1,"tags":["Contrôle d’accès et gestion des identités","Accès aux interfaces d’administration"],"text":"Lorsque le prestataire utilise un service de type CaaS comme socle d’un autre type de service (PaaS ou SaaS), les ressources affectées à l’usage du prestataire ne doivent en aucun cas être accessibles via l’interface publique mise à disposition des autres commanditaires du service CaaS."}
{"page":1,"tags":["Contrôle d’accès et gestion des identités","Accès aux interfaces d’administration"],"text":"Lorsque le prestataire utilise un service de type PaaS comme socle d’un autre type de service (typiquement SaaS), les ressources affectées à l’usage du prestataire ne doivent en aucun cas être accessibles via l’interface publique mise à disposition des autres commanditaires du service PaaS."}
{"page":1,"tags":["Contrôle d’accès et gestion des identités","Restriction des accès à l’information"],"text":"Le prestataire doit mettre en œuvre des mesures de cloisonnement appropriées entre ses commanditaires."}
{"page":1,"tags":["Contrôle d’accès et gestion des identités","Restriction des accès à l’information"],"text":"Le prestataire doit mettre en œuvre des mesures de cloisonnement appropriées entre le système d’information du service et ses autres systèmes d’information (bureautique, informatique de gestion, gestion technique du bâtiment, contrôle d’accès physique, etc.)."}
{"page":1,"tags":["Contrôle d’accès et gestion des identités","Restriction des accès à l’information"],"text":"Le prestataire doit concevoir, développer, configurer et déployer le système d’information du service en assurant au moins un cloisonnement entre d’une part l’infrastructure technique et d’autre part les équipements nécessaires à l’administration des services et des ressources qu’elle héberge."}
{"page":1,"tags":["Contrôle d’accès et gestion des identités","Restriction des accès à l’information"],"text":"n’autoriser l’accès aux données du commanditaire qu’après consentement explicite du commanditaire ;"}
{"page":1,"tags":["Contrôle d’accès et gestion des identités","Restriction des accès à l’information"],"text":"vérifier que la personne à qui l’accès doit être autorisé a satisfait aux vérifications de l’exigence 7.1.b ;"}
{"page":1,"tags":["Contrôle d’accès et gestion des identités","Restriction des accès à l’information"],"text":"dans le cas d'une intervention réalisée à distance par une personne localisée hors de l’Union Européenne, mettre en œuvre une passerelle sécurisée (poste de rebond) par laquelle la personne devra se connecter et permettant une supervision (autorisation ou interdiction des actions, demandes d’explications, etc..) en temps réel, par une personne ayant elle-même satisfait aux vérifications de l’exigence 7.1.b. La passerelle sécurisée devra répondre aux objectifs de sécurité2 spécifiés dans [G_EXT] adaptés au contexte des actions du support technique ;"}
{"page":1,"tags":["Contrôle d’accès et gestion des identités","Restriction des accès à l’information"],"text":"considérer les actions menées, une fois l’accès autorisé, comme des actions d’administration et les journaliser comme telles ;"}
{"page":1,"tags":["Contrôle d’accès et gestion des identités","Restriction des accès à l’information"],"text":"supprimer l’autorisation d’accès aux données du commanditaire au terme de ces actions."}
{"page":1,"tags":["Cryptologie","Chiffrement des données stockées"],"text":"Dans le cas d’un service IaaS ou CaaS, cet objectif pourra par exemple être atteint :"}
{"page":1,"tags":["Cryptologie","Chiffrement des données stockées"],"text":"par un chiffrement du disque ou du système de fichier, lorsque le protocole d’accès en mode fichiers garantit que seuls des blocs vides peuvent être alloués (par exemple stockage de type NAS dans lequel un bloc physique n’est effectivement affecté qu’au moment de l’écriture),"}
{"page":1,"tags":["Cryptologie","Chiffrement des données stockées"],"text":"par un chiffrement par volume dans le cas d’un accès en mode bloc (par exemple stockage de type SAN ou stockage local), avec au moins une clé par commanditaire ;"}
{"page":1,"tags":["Cryptologie","Chiffrement des données stockées"],"text":"Dans le cas d’un service PaaS ou SaaS, cet objectif pourra être atteint en utilisant un chiffrement applicatif dans le périmètre du prestataire, avec au moins une clé par commanditaire."}
{"page":1,"tags":["Cryptologie","Chiffrement des données stockées"],"text":"Le prestataire doit utiliser une méthode de chiffrement des données respectant les règles de  [CRYPTO_B1]."}
{"page":1,"tags":["Cryptologie","Chiffrement des données stockées"],"text":"Il est recommandé d’utiliser une méthode de chiffrement des données respectant les recommandations de [CRYPTO_B1]."}
{"page":1,"tags":["Cryptologie","Chiffrement des données stockées"],"text":"Le prestataire doit mettre en place un chiffrement des données sur les supports amovibles et les supports de sauvegarde amenés à quitter le périmètre de sécurité physique du système d’information du service (au sens du chapitre 10), en fonction du besoin de sécurité des données (voir chapitre 8.3)."}
{"page":1,"tags":["Cryptologie","Chiffrement des flux"],"text":"Lorsque le prestataire met en œuvre un mécanisme de chiffrement des flux réseau, celui-ci doit respecter les règles de [CRYPTO_B1]."}
{"page":1,"tags":["Cryptologie","Chiffrement des flux"],"text":"Lorsque le prestataire met en œuvre un mécanisme de chiffrement des flux réseau, il est recommandé que celui-ci respecte les recommandations de [CRYPTO_B1]."}
{"page":1,"tags":["Cryptologie","Chiffrement des flux"],"text":"Si le protocole TLS est mis en œuvre, le prestataire doit appliquer les recommandations de  [NT_TLS]."}
{"page":1,"tags":["Cryptologie","Chiffrement des flux"],"text":"Si le protocole IPsec est mis en œuvre, le prestataire doit appliquer les recommandations de  [NT_IPSEC]."}
{"page":1,"tags":["Cryptologie","Chiffrement des flux"],"text":"Si le protocole SSH est mis en œuvre, le prestataire doit appliquer les recommandations de [NT_SSH]."}
{"page":1,"tags":["Cryptologie","Hachage des mots de passe"],"text":"Le prestataire ne doit stocker que l’empreinte des mots de passe des utilisateurs et des comptes techniques."}
{"page":1,"tags":["Cryptologie","Hachage des mots de passe"],"text":"Le prestataire doit mettre en œuvre une fonction de hachage respectant les règles de [CRYPTO_B1]"}
{"page":1,"tags":["Cryptologie","Hachage des mots de passe"],"text":"Il est recommandé que le prestataire mette en œuvre une fonction de hachage respectant les recommandations de [CRYPTO_B1]."}
{"page":1,"tags":["Cryptologie","Hachage des mots de passe"],"text":"Le prestataire doit générer les empreintes des mots de passe avec une fonction de hachage associée à l’utilisation d’un sel cryptographique respectant les règles de [CRYPTO_B1]."}
{"page":1,"tags":["Cryptologie","Non répudiation"],"text":"Lorsque le prestataire met en œuvre un mécanisme de signature électronique, celui-ci doit respecter les règles de [CRYPTO_B1]"}
{"page":1,"tags":["Cryptologie","Non répudiation"],"text":"Lorsque le prestataire met en œuvre un mécanisme de signature électronique, il est recommandé que celui-ci respecte les recommandations de [CRYPTO_B1]."}
{"page":1,"tags":["Cryptologie","Gestion des secrets"],"text":"Le prestataire doit mettre en œuvre des clés cryptographiques respectant les règles de [CRYPTO_B2]."}
{"page":1,"tags":["Cryptologie","Gestion des secrets"],"text":"Il est recommandé que le prestataire mette en œuvre des clés cryptographiques respectant les recommandations de [CRYPTO_B2]."}
{"page":1,"tags":["Cryptologie","Gestion des secrets"],"text":"Le prestataire doit protéger l’accès aux clés cryptographiques et autres secrets utilisés pour le chiffrement des données par un moyen adapté : conteneur de sécurité (logiciel ou matériel) ou support disjoint."}
{"page":1,"tags":["Cryptologie","Gestion des secrets"],"text":"Le prestataire doit protéger l’accès aux clés cryptographiques et autres secrets utilisés pour les tâches d’administration par un conteneur de sécurité adapté, logiciel ou matériel."}
{"page":1,"tags":["Cryptologie","Racines de confiance"],"text":"Sur l’infrastructure technique, le prestataire doit utiliser exclusivement des certificats de clé publique issus d’une autorité de certification d’un État membre de l’Union Européenne (les cérémonies de génération des clés maîtresses doivent avoir lieu dans un pays membre de l’Union Européenne et en présence du prestataire)."}
{"page":1,"tags":["Sécurité physique et environnementale","Périmètres de sécurité physique"],"text":"Le prestataire doit documenter et mettre en œuvre des périmètres de sécurité, incluant le marquage des zones et les différents moyens de limitation et de contrôle des accès."}
{"page":1,"tags":["Sécurité physique et environnementale","Périmètres de sécurité physique"],"text":"Le prestataire doit distinguer des zones publiques, des zones privées et des zones sensibles."}
{"page":1,"tags":["Sécurité physique et environnementale","Périmètres de sécurité physique","Zones publiques"],"text":"Les zones publiques sont accessibles à tous dans les limites de la propriété du prestataire. Le prestataire ne doit héberger aucune ressource dévolue au service ou permettant d’accéder à des composantes de celui-ci dans les zones publiques."}
{"page":1,"tags":["Sécurité physique et environnementale","Périmètres de sécurité physique","Zones privées"],"text":"les plateformes et moyens de développement du service ;"}
{"page":1,"tags":["Sécurité physique et environnementale","Périmètres de sécurité physique","Zones privées"],"text":"les postes d’administration, d’exploitation et de supervision ;"}
{"page":1,"tags":["Sécurité physique et environnementale","Périmètres de sécurité physique","Zones privées"],"text":"les locaux à partir desquels le prestataire opère."}
{"page":1,"tags":["Sécurité physique et environnementale","Périmètres de sécurité physique","Zones privées","Zones sensibles"],"text":"No description available"}
{"page":1,"tags":["Sécurité physique et environnementale","Périmètres de sécurité physique","Zones privées"],"text":"Les zones sensibles sont réservées à l’hébergement du système d’information de production du service hors postes d’administration, d’exploitation et de supervision."}
{"page":1,"tags":["Sécurité physique et environnementale","Contrôle d’accès physique","Zones privées"],"text":"Le prestataire doit protéger les zones privées contre les accès non autorisés. Pour ce faire, il doit mettre en œuvre un contrôle d’accès physique reposant au moins sur un facteur personnel : la connaissance d’un secret, la détention d’un objet ou la biométrie."}
{"page":1,"tags":["Sécurité physique et environnementale","Contrôle d’accès physique","Zones privées"],"text":"Il est recommandé que le prestataire respecte les recommandations de [G_CVAP] pour mettre en œuvre du contrôle d’accès physique."}
{"page":1,"tags":["Sécurité physique et environnementale","Contrôle d’accès physique","Zones privées"],"text":"Le prestataire doit définir et documenter des mesures d’accès physique dérogatoires en cas d’urgence."}
{"page":1,"tags":["Sécurité physique et environnementale","Contrôle d’accès physique","Zones privées"],"text":"Le prestataire doit afficher à l’entrée des zones privées un avertissement relatif aux limites et conditions d’accès à ces zones."}
{"page":1,"tags":["Sécurité physique et environnementale","Contrôle d’accès physique","Zones privées"],"text":"Le prestataire doit définir et documenter les plages horaires et conditions d’accès aux zones privées en fonction des profils des intervenants."}
{"page":1,"tags":["Sécurité physique et environnementale","Contrôle d’accès physique","Zones privées"],"text":"Le prestataire doit documenter et mettre en œuvre les moyens permettant de s’assurer que les visiteurs sont systématiquement accompagnés par le prestataire lors de leurs accès et séjours en zone privée. Le prestataire doit conserver une trace de l’identité des visiteurs conformément à la législation et réglementation en vigueur."}
{"page":1,"tags":["Sécurité physique et environnementale","Contrôle d’accès physique","Zones privées"],"text":"En cas d’intervention (actions de diagnostic, de maintenance, ou d’administration) en zone privée par un tiers visiteur, le prestataire doit faire superviser (suivre, autoriser, interdire, questionner) les actions par un personnel ayant satisfait aux vérifications de l’exigence 7.1.b ."}
{"page":1,"tags":["Sécurité physique et environnementale","Contrôle d’accès physique","Zones privées"],"text":"Le prestataire doit documenter et mettre en œuvre des mécanismes de surveillance et de détection des accès non autorisés aux zones privées."}
{"page":1,"tags":["Sécurité physique et environnementale","Contrôle d’accès physique","Zones sensibles"],"text":"Le prestataire doit protéger les zones sensibles contre les accès non autorisés. Pour ce faire, il doit mettre en œuvre un contrôle d’accès physique reposant au moins sur deux facteurs personnels : la connaissance d’un secret, la détention d’un objet ou la biométrie."}
{"page":1,"tags":["Sécurité physique et environnementale","Contrôle d’accès physique","Zones sensibles"],"text":"Il est recommandé que le prestataire respecte les recommandations de [G_CVAP] pour  la mise en œuvre du contrôle d’accès physique."}
{"page":1,"tags":["Sécurité physique et environnementale","Contrôle d’accès physique","Zones sensibles"],"text":"Le prestataire doit définir et documenter des mesures d’accès physique dérogatoires en cas d’urgence."}
{"page":1,"tags":["Sécurité physique et environnementale","Contrôle d’accès physique","Zones sensibles"],"text":"Le prestataire doit afficher à l’entrée des zones sensibles un avertissement relatif aux limites et conditions d’accès à ces zones."}
{"page":1,"tags":["Sécurité physique et environnementale","Contrôle d’accès physique","Zones sensibles"],"text":"Le prestataire doit définir et documenter les plages horaires et conditions d’accès aux zones sensibles en fonction des profils des intervenants."}
{"page":1,"tags":["Sécurité physique et environnementale","Contrôle d’accès physique","Zones sensibles"],"text":"Le prestataire doit documenter et mettre en œuvre les moyens permettant de s’assurer que les visiteurs sont systématiquement accompagnés par le prestataire lors de leurs accès et séjours en zone sensible. Le prestataire doit conserver une trace de l’identité des visiteurs conformément à la législation et réglementation en vigueur."}
{"page":1,"tags":["Sécurité physique et environnementale","Contrôle d’accès physique","Zones sensibles"],"text":"En cas d’intervention (actions de diagnostic, de maintenance, ou d’administration) en zone sensible par un tiers visiteur, le prestataire doit faire superviser (suivre, autoriser, interdire, questionner) les actions par un personnel ayant satisfait aux vérifications aux vérifications de l’exigence 7.1.b ."}
{"page":1,"tags":["Sécurité physique et environnementale","Contrôle d’accès physique","Zones sensibles"],"text":"Le prestataire doit documenter et mettre en œuvre des mécanismes de surveillance et de détection des accès non autorisés aux zones sensibles."}
{"page":1,"tags":["Sécurité physique et environnementale","Contrôle d’accès physique","Zones sensibles"],"text":"Le prestataire doit mettre en place une journalisation des accès physiques aux zones sensibles. Il doit effectuer une revue de ces journaux au moins mensuellement."}
{"page":1,"tags":["Sécurité physique et environnementale","Contrôle d’accès physique","Zones sensibles"],"text":"Le prestataire doit mettre en œuvre les moyens garantissant qu’aucun accès direct n’existe entre une zone publique et une zone sensible."}
{"page":1,"tags":["Sécurité physique et environnementale","Protection contre les menaces extérieures et environnementales"],"text":"Le prestataire doit documenter et mettre en œuvre les moyens permettant de minimiser les risques inhérents aux sinistres physiques (incendie, dégât des eaux, etc.) et naturels (risques climatiques, inondations, séismes, etc.)."}
{"page":1,"tags":["Sécurité physique et environnementale","Protection contre les menaces extérieures et environnementales"],"text":"Le prestataire doit documenter et mettre en œuvre les mesures permettant de limiter les risques de départ et de propagation de feu ainsi que les risques de dégât des eaux."}
{"page":1,"tags":["Sécurité physique et environnementale","Protection contre les menaces extérieures et environnementales"],"text":"Le prestataire doit documenter et mettre en œuvre les mesures permettant de prévenir et limiter les conséquences d’une coupure d’alimentation électrique et permettre une reprise du service conformément aux exigences de disponibilité du service définies dans la convention de service."}
{"page":1,"tags":["Sécurité physique et environnementale","Protection contre les menaces extérieures et environnementales"],"text":"Le prestataire doit documenter et mettre en œuvre les moyens permettant de maintenir des conditions de température et d’humidité adaptées aux équipements. De plus, il doit mettre en œuvre des mesures permettant de prévenir les pannes de climatisation et d’en limiter les conséquences."}
{"page":1,"tags":["Sécurité physique et environnementale","Protection contre les menaces extérieures et environnementales"],"text":"Le prestataire doit documenter et mettre en œuvre des contrôles et tests réguliers des équipements de détection et de protection physique."}
{"page":1,"tags":["Sécurité physique et environnementale","Travail dans les zones privées et sensibles"],"text":"Le prestataire doit intégrer les éléments de sécurité physique dans la politique de sécurité et l’appréciation des risques conformément au niveau de sécurité requis par la catégorie de la zone."}
{"page":1,"tags":["Sécurité physique et environnementale","Travail dans les zones privées et sensibles"],"text":"Le prestataire doit documenter et mettre en œuvre des procédures relatives au travail en zones privées et sensibles. Il doit communiquer ces procédures aux intervenants concernés."}
{"page":1,"tags":["Sécurité physique et environnementale","Zones de livraison et de chargement"],"text":"Les zones de livraison et de chargement et les autres points par lesquels des personnes non autorisées peuvent pénétrer dans les locaux sans être accompagnées sont considérées comme des zones publiques."}
{"page":1,"tags":["Sécurité physique et environnementale","Zones de livraison et de chargement"],"text":"Le prestataire doit isoler les points d’accès de ces zones vers les zones privées et sensibles, de façon à éviter les accès non autorisés, ou à défaut, implémenter des mesures compensatoires permettant d’assurer le même niveau de sécurité."}
{"page":1,"tags":["Sécurité physique et environnementale","Sécurité du câblage"],"text":"Le prestataire doit documenter et mettre en œuvre des mesures permettant de protéger le câblage électrique et de télécommunication des dommages physiques et des possibilités d’interception."}
{"page":1,"tags":["Sécurité physique et environnementale","Sécurité du câblage"],"text":"Le prestataire doit établir et tenir à jour un plan de câblage."}
{"page":1,"tags":["Sécurité physique et environnementale","Sécurité du câblage"],"text":"Il est recommandé que le prestataire mette en œuvre des mesures permettant d’identifier les câbles (par exemple code couleur, étiquette, etc.) afin d'en faciliter l'exploitation et limiter les erreurs de manipulation."}
{"page":1,"tags":["Sécurité physique et environnementale","Maintenance des matériels"],"text":"Le prestataire doit documenter et mettre en œuvre des mesures permettant de s’assurer que les conditions d’installation, de maintenance et d’entretien des équipements du système d’information du service hébergés en zones privés et sensibles sont compatibles avec les exigences de confidentialité et de disponibilité du service définies dans la convention de service."}
{"page":1,"tags":["Sécurité physique et environnementale","Maintenance des matériels"],"text":"Le prestataire doit souscrire des contrats de maintenance permettant de disposer des mises à jour de sécurité des logiciels installés sur les équipements du système d’information du service."}
{"page":1,"tags":["Sécurité physique et environnementale","Maintenance des matériels"],"text":"Le prestataire doit s’assurer que les supports ne peuvent être retournés à un tiers que si les données du commanditaire y sont stockées chiffrées conformément au chapitre 10.1 ou ont préalablement été détruites à l’aide d’un mécanisme d’effacement sécurisé par réécriture de motifs aléatoires."}
{"page":1,"tags":["Sécurité physique et environnementale","Maintenance des matériels"],"text":"Le prestataire doit documenter et mettre en œuvre des mesures permettant de s’assurer que les conditions d’installation, de maintenance et d’entretien des équipements techniques annexes (alimentation électrique, climatisation, incendie, etc.) sont compatibles avec les exigences de disponibilité du service définies dans la convention de service."}
{"page":1,"tags":["Sécurité physique et environnementale","Sortie des actifs"],"text":"Le prestataire doit documenter et mettre en œuvre une procédure de transfert hors site de données du commanditaire, équipements et logiciels. Cette procédure doit nécessiter que la direction du prestataire donne son autorisation écrite. Dans tous les cas, le prestataire doit mettre en œuvre les moyens permettant de garantir que le niveau de protection en confidentialité et en intégrité des actifs durant leur transport est équivalent à celui sur site."}
{"page":1,"tags":["Sécurité physique et environnementale","Recyclage sécurisé du matériel"],"text":"Le prestataire doit documenter et mettre en œuvre des moyens permettant d’effacer de manière sécurisée par réécriture de motifs aléatoires tout support de données mis à disposition d’un commanditaire. Si l’espace de stockage est chiffré dans le cadre de l’exigence 10.1.a), l’effacement peut être réalisé par un effacement sécurisé de la clé de chiffrement."}
{"page":1,"tags":["Sécurité physique et environnementale","Matériel en attente d’utilisation"],"text":"Le prestataire doit documenter et mettre en œuvre une procédure de protection du matériel en attente d’utilisation."}
{"page":1,"tags":["Sécurité liée à l’exploitation","Procédures d’exploitation documentées"],"text":"Le prestataire doit documenter les procédures d’exploitation, les tenir à jour et les rendre accessibles au personnel concerné."}
{"page":1,"tags":["Sécurité liée à l’exploitation","Gestion des changements"],"text":"Le prestataire doit documenter et mettre en œuvre une procédure de gestion des changements apportés aux systèmes et moyens de traitement de l’information."}
{"page":1,"tags":["Sécurité liée à l’exploitation","Gestion des changements"],"text":"la date et l’heure programmées du début et de la fin des opérations;"}
{"page":1,"tags":["Sécurité liée à l’exploitation","Gestion des changements"],"text":"la nature des opérations ;"}
{"page":1,"tags":["Sécurité liée à l’exploitation","Gestion des changements"],"text":"les impacts sur la sécurité ou la disponibilité du service ; -  le contact au sein du prestataire."}
{"page":1,"tags":["Sécurité liée à l’exploitation","Gestion des changements"],"text":"Dans le cadre d’un service PaaS, le prestataire doit informer au plus tôt le commanditaire de toute modification à venir sur des éléments logiciels sous sa responsabilité dès lors que la compatibilité complète ne peut être assurée."}
{"page":1,"tags":["Sécurité liée à l’exploitation","Gestion des changements"],"text":"Le prestataire doit informer au plus tôt le commanditaire de toute modification à venir sur les éléments du service dès lors qu’elle est susceptible d’occasionner une perte de fonctionnalité pour le commanditaire."}
{"page":1,"tags":["Sécurité liée à l’exploitation","Séparation des environnements de développement, de test et d’exploitation"],"text":"Le prestataire doit documenter et mettre en œuvre les mesures permettant de séparer physiquement les environnements liés à la production du service des autres environnements, dont les environnements de développement."}
{"page":1,"tags":["Sécurité liée à l’exploitation","Mesures contre les codes malveillants"],"text":"Le prestataire doit documenter et mettre en œuvre les mesures de détection, de prévention et de restauration pour se protéger des codes malveillants. Le périmètre d’application de cette exigence sur le système d’information du service doit nécessairement contenir les postes utilisateurs sous la responsabilité du prestataire et les flux entrants sur ce même système d’information."}
{"page":1,"tags":["Sécurité liée à l’exploitation","Mesures contre les codes malveillants"],"text":"Le prestataire doit documenter et mettre en œuvre une sensibilisation de ses employés aux risques liés aux codes malveillants et aux bonnes pratiques pour réduire l’impact d’une infection."}
{"page":1,"tags":["Sécurité liée à l’exploitation","Sauvegarde des informations"],"text":"Le prestataire doit documenter et mettre en œuvre une politique de sauvegarde et de restauration des données sous sa responsabilité dans le cadre du service. Cette politique doit prévoir une sauvegarde quotidienne de l’ensemble des données (informations, logiciels,  configurations, etc.) sous la responsabilité du prestataire dans le cadre du service."}
{"page":1,"tags":["Sécurité liée à l’exploitation","Sauvegarde des informations"],"text":"Le prestataire doit documenter et mettre en œuvre des mesures de protection des sauvegardes conformément à la politique de contrôle d’accès (voir chapitre 9). Cette politique doit prévoir une revue mensuelle des traces d’accès aux sauvegardes."}
{"page":1,"tags":["Sécurité liée à l’exploitation","Sauvegarde des informations"],"text":"Le prestataire doit documenter et mettre en œuvre une procédure permettant de tester régulièrement la restauration des sauvegardes."}
{"page":1,"tags":["Sécurité liée à l’exploitation","Sauvegarde des informations"],"text":"Le prestataire doit localiser les sauvegardes à une distance suffisante des équipements principaux en cohérence avec les résultats de l’appréciation de risques et permettant de faire face à des sinistres majeurs. Les sauvegardes sont assujetties aux mêmes exigences de localisation que les données opérationnelles. Le ou les sites de sauvegarde sont assujettis aux mêmes exigences de sécurité que le site principal, en particulier celles listées aux chapitres 8 et 11. Les communications entre site principal et site de sauvegarde doivent être protégées par chiffrement, conformément aux exigences du chapitre 10."}
{"page":1,"tags":["Sécurité liée à l’exploitation","Journalisation des événements"],"text":"la liste des événements à journaliser par source ;"}
{"page":1,"tags":["Sécurité liée à l’exploitation","Journalisation des événements"],"text":"l’objet de la journalisation par événement ;"}
{"page":1,"tags":["Sécurité liée à l’exploitation","Journalisation des événements"],"text":"la fréquence de la collecte et base de temps utilisée ;"}
{"page":1,"tags":["Sécurité liée à l’exploitation","Journalisation des événements"],"text":"la durée de rétention locale et centralisée ;"}
{"page":1,"tags":["Sécurité liée à l’exploitation","Journalisation des événements"],"text":"les mesures de protection des journaux (dont chiffrement et duplication) ; - la localisation des journaux."}
{"page":1,"tags":["Sécurité liée à l’exploitation","Journalisation des événements"],"text":"les activités des utilisateurs liées à la sécurité de l’information ;"}
{"page":1,"tags":["Sécurité liée à l’exploitation","Journalisation des événements"],"text":"la modification des droits d’accès dans le périmètre de sa responsabilité ;"}
{"page":1,"tags":["Sécurité liée à l’exploitation","Journalisation des événements"],"text":"les événements issus des mécanismes de lutte contre les codes malveillants (voir chapitre 12.4);"}
{"page":1,"tags":["Sécurité liée à l’exploitation","Journalisation des événements"],"text":"les exceptions ;"}
{"page":1,"tags":["Sécurité liée à l’exploitation","Journalisation des événements"],"text":"les défaillances ;"}
{"page":1,"tags":["Sécurité liée à l’exploitation","Journalisation des événements"],"text":"tout autre événement lié à la sécurité de l’information."}
{"page":1,"tags":["Sécurité liée à l’exploitation","Journalisation des événements"],"text":"Le prestataire doit conserver les événements issus de la journalisation pendant une durée minimale de six mois sous réserve du respect des exigences légales et réglementaires."}
{"page":1,"tags":["Sécurité liée à l’exploitation","Journalisation des événements"],"text":"Le prestataire doit fournir, sur demande d’un commanditaire, l’ensemble des événements le concernant."}
{"page":1,"tags":["Sécurité liée à l’exploitation","Journalisation des événements"],"text":"Il est recommandé que le système de journalisation mis en place par le prestataire respecte les recommandations de [NT_JOURNAL]."}
{"page":1,"tags":["Sécurité liée à l’exploitation","Protection de l’information journalisée"],"text":"Le prestataire doit protéger les équipements de journalisation et les événements journalisés contre les atteintes à leur disponibilité, intégrité ou confidentialité, conformément au chapitre 3.2 de [NT_JOURNAL]."}
{"page":1,"tags":["Sécurité liée à l’exploitation","Protection de l’information journalisée"],"text":"Le prestataire doit gérer le dimensionnement de l’espace de stockage de l’ensemble des équipements hébergeant une ou plusieurs sources de collecte afin de permettre la conservation locale des événements journalisés prévue par la politique de journalisation des événements. Cette gestion du dimensionnement doit prendre en compte les évolutions du système d’information."}
{"page":1,"tags":["Sécurité liée à l’exploitation","Protection de l’information journalisée"],"text":"Le prestataire doit transférer les événements journalisés en assurant leur protection en confidentialité et en intégrité, sur un ou plusieurs serveurs centraux dédiés et doit les stocker sur une machine physique distincte de celle qui les a générés."}
{"page":1,"tags":["Sécurité liée à l’exploitation","Protection de l’information journalisée"],"text":"Le prestataire doit mettre en place une sauvegarde des événements collectés suivant une politique adaptée."}
{"page":1,"tags":["Sécurité liée à l’exploitation","Protection de l’information journalisée"],"text":"Le prestataire doit exécuter les processus de journalisation et de collecte des évènements avec des comptes disposant de privilèges nécessaires et suffisants et doit limiter l’accès aux événements journalisés conformément à la politique de contrôle d’accès (voir chapitre 9.1)."}
{"page":1,"tags":["Sécurité liée à l’exploitation","Synchronisation des horloges"],"text":"Le prestataire doit documenter et mettre en œuvre une synchronisation des horloges de l’ensemble des équipements sur une ou plusieurs sources de temps internes cohérentes entre elles. Ces sources pourront elles-mêmes être synchronisées sur plusieurs sources fiables externes, sauf pour les réseaux isolés."}
{"page":1,"tags":["Sécurité liée à l’exploitation","Synchronisation des horloges"],"text":"Le prestataire doit mettre en place l’horodatage de chaque événement journalisé."}
{"page":1,"tags":["Sécurité liée à l’exploitation","Analyse et corrélation des événements"],"text":"Le prestataire doit documenter et mettre en œuvre une infrastructure permettant l’analyse et la corrélation des événements enregistrés par le système de journalisation afin de détecter les événements susceptibles d’affecter la sécurité du système d’information du service, en temps réel ou a posteriori pour des événements remontant jusqu’à six mois."}
{"page":1,"tags":["Sécurité liée à l’exploitation","Analyse et corrélation des événements"],"text":"Il est recommandé de s’appuyer sur le référentiel d’exigences des prestataires de détection d’incidents de sécurité [PDIS] pour la mise en place et l’exploitation de l’infrastructure d’analyse et de corrélation des événements."}
{"page":1,"tags":["Sécurité liée à l’exploitation","Analyse et corrélation des événements"],"text":"Le prestataire doit acquitter les alarmes remontées par l’infrastructure d’analyse et de corrélation des événements au moins quotidiennement."}
{"page":1,"tags":["Sécurité liée à l’exploitation","Installation de logiciels sur des systèmes en exploitation"],"text":"Le prestataire doit documenter et mettre en œuvre une procédure permettant de contrôler l’installation de logiciels sur les équipements du système d’information du service."}
{"page":1,"tags":["Sécurité liée à l’exploitation","Installation de logiciels sur des systèmes en exploitation"],"text":"Le prestataire doit documenter et mettre en œuvre une procédure de gestion de la configuration des environnements logiciels mis à la disposition du commanditaire, notamment pour leur maintien en condition de sécurité."}
{"page":1,"tags":["Sécurité liée à l’exploitation","Installation de logiciels sur des systèmes en exploitation"],"text":"cette capacité d'inspection et de suppression doit générer des journaux d'activité et doit pouvoir faire l'objet d'un audit de code,"}
{"page":1,"tags":["Sécurité liée à l’exploitation","Installation de logiciels sur des systèmes en exploitation"],"text":"les entrants doivent être traités sur des dispositifs spécifiques opérés et maintenus par le prestataire et hébergés dans une zone cloisonnée du reste de l’infrastructure (du type zone démilitarisée telle que définie dans [G_INT])."}
{"page":1,"tags":["Sécurité liée à l’exploitation","Gestion des vulnérabilités techniques"],"text":"Le prestataire doit documenter et mettre en œuvre un processus de veille permettant de gérer les vulnérabilités techniques des logiciels et des systèmes utilisés dans le système d’information du service."}
{"page":1,"tags":["Sécurité liée à l’exploitation","Gestion des vulnérabilités techniques"],"text":"Le prestataire doit évaluer son exposition à ces vulnérabilités en les incluant dans l’appréciation des risques et appliquer les mesures de traitement du risque adaptées."}
{"page":1,"tags":["Sécurité liée à l’exploitation","Administration"],"text":"Le prestataire doit documenter et mettre en œuvre une procédure obligeant les administrateurs sous sa responsabilité à utiliser des terminaux dédiés pour la réalisation exclusive des tâches d’administration, en accord avec le chapitre 4.1 intitulé « poste et réseau d’administration » de [NT_ADMIN]. Il doit les maîtriser et les maintenir à jour."}
{"page":1,"tags":["Sécurité liée à l’exploitation","Administration"],"text":"Le prestataire doit mettre en place des mesures de durcissement de la configuration des terminaux utilisés pour les tâches d’administration, notamment celles du chapitre 4.2 intitulé « sécurisation du socle » de [NT_ADMIN]."}
{"page":1,"tags":["Sécurité liée à l’exploitation","Administration"],"text":"l’utilisation d’un tunnel chiffré, non débrayable et non contournable, pour l’ensemble des flux (voir chapitre 10.2) ;"}
{"page":1,"tags":["Sécurité liée à l’exploitation","Administration"],"text":"le chiffrement intégral du disque (voir chapitre 10.1)."}
{"page":1,"tags":["Sécurité liée à l’exploitation","Télédiagnostic et télémaintenance des composants de l’infrastructure"],"text":"vérifier que la personne à qui l’accès doit être autorisé a satisfait aux vérifications de  l’exigence 7.1.b  ;"}
{"page":1,"tags":["Sécurité liée à l’exploitation","Télédiagnostic et télémaintenance des composants de l’infrastructure"],"text":"dans le cas d'une intervention réalisée par une personne n’ayant pas satisfait aux vérifications de l’exigence 7.1.b, mettre en œuvre une passerelle sécurisée (poste de rebond) par laquelle la personne devra se connecter et permettant une supervision des actions (autorisation ou interdiction des actions, demande d’explications, etc..) en temps réel, par une personne ayant elle-même satisfait aux vérifications de l’exigence 7.1.b . La passerelle sécurisée devra répondre aux objectifs de sécurité4 spécifiés dans [G_EXT] ;"}
{"page":1,"tags":["Sécurité liée à l’exploitation","Télédiagnostic et télémaintenance des composants de l’infrastructure"],"text":"considérer les actions menées, une fois l’accès autorisé, comme des actions d’administration et les journaliser comme telles ;"}
{"page":1,"tags":["Sécurité liée à l’exploitation","Télédiagnostic et télémaintenance des composants de l’infrastructure"],"text":"supprimer l’autorisation d’accès à l’issue de l’intervention."}
{"page":1,"tags":["Sécurité liée à l’exploitation","Surveillance des flux sortants de l’infrastructure"],"text":"les sortants doivent pouvoir être expurgés des données pouvant porter atteinte à la confidentialité des données des commanditaires ;"}
{"page":1,"tags":["Sécurité liée à l’exploitation","Surveillance des flux sortants de l’infrastructure"],"text":"cette capacité d'inspection et de suppression doit générer des journaux d'activité et doit pouvoir faire l'objet d'un audit de code ;"}
{"page":1,"tags":["Sécurité liée à l’exploitation","Surveillance des flux sortants de l’infrastructure"],"text":"les sortants sont traités sur des dispositifs spécifiques opérés et maintenus par le prestataire, et hébergés dans une zone cloisonnée du reste de l’infrastructure (du type zone démilitarisée telle que définie dans [G_INT])."}
{"page":1,"tags":["Sécurité des communications","Cartographie du système d'information"],"text":"la liste des ressources matérielles ou virtualisées ;"}
{"page":1,"tags":["Sécurité des communications","Cartographie du système d'information"],"text":"les noms et fonctions des applications, supportant le service ;"}
{"page":1,"tags":["Sécurité des communications","Cartographie du système d'information"],"text":"le schéma d’architecture réseau au niveau 3 du modèle OSI sur lequel les points névralgiques sont identifiés :"}
{"page":1,"tags":["Sécurité des communications","Cartographie du système d'information"],"text":"les points d’interconnexions, notamment avec les réseaux tiers et publics,"}
{"page":1,"tags":["Sécurité des communications","Cartographie du système d'information"],"text":"les réseaux, sous-réseaux, notamment les réseaux d’administration,"}
{"page":1,"tags":["Sécurité des communications","Cartographie du système d'information"],"text":"les équipements assurant des fonctions de sécurité (filtrage, authentification,  chiffrement, etc.),"}
{"page":1,"tags":["Sécurité des communications","Cartographie du système d'information"],"text":"les serveurs hébergeant des données ou assurant des fonctions sensibles ; -  la matrice des flux réseau autorisés en précisant :"}
{"page":1,"tags":["Sécurité des communications","Cartographie du système d'information"],"text":"leur description technique (services, protocoles et ports) ;"}
{"page":1,"tags":["Sécurité des communications","Cartographie du système d'information"],"text":"la justification métier ou d’infrastructure technique ;"}
{"page":1,"tags":["Sécurité des communications","Cartographie du système d'information"],"text":"le cas échéant, lorsque des services, protocoles ou ports réputés non sûrs sont utilisés, les mesures compensatoires mises en place, dans la logique de défense en profondeur."}
{"page":1,"tags":["Sécurité des communications","Cartographie du système d'information"],"text":"Le prestataire doit réviser au moins annuellement la cartographie."}
{"page":1,"tags":["Sécurité des communications","Cloisonnement des réseaux"],"text":"la sensibilité des informations transmises ;"}
{"page":1,"tags":["Sécurité des communications","Cloisonnement des réseaux"],"text":"la nature des flux (production, administration, supervision, etc.) ;"}
{"page":1,"tags":["Sécurité des communications","Cloisonnement des réseaux"],"text":"le domaine d’appartenance des flux (des commanditaires – avec distinction par commanditaire ou ensemble de commanditaires, du prestataire, des tiers, etc.) ;  - le domaine technique (traitement, stockage, etc.)."}
{"page":1,"tags":["Sécurité des communications","Cloisonnement des réseaux"],"text":"Le prestataire doit cloisonner, physiquement ou par chiffrement, tous les flux de données internes au système d’information du service vis-à-vis de tout autre système d’information. Lorsque ce cloisonnement est réalisé par chiffrement, il est réalisé en accord avec les exigences du chapitre 10.2."}
{"page":1,"tags":["Sécurité des communications","Cloisonnement des réseaux"],"text":"Dans le cas où le réseau d’administration de l’infrastructure technique ne fait pas l’objet d’un cloisonnement physique, les flux d’administration doivent transiter dans un tunnel chiffré, en accord avec les exigences du chapitre 10.2."}
{"page":1,"tags":["Sécurité des communications","Cloisonnement des réseaux"],"text":"Le prestataire doit mettre en place et configurer un pare-feu applicatif pour protéger les interfaces d’administration destinées à ses commanditaires et exposées sur un réseau public."}
{"page":1,"tags":["Sécurité des communications","Cloisonnement des réseaux"],"text":"Le prestataire doit mettre en œuvre sur l’ensemble des interfaces d’administration et de supervision de l’infrastructure technique du service un mécanisme de filtrage n’autorisant que les connexions légitimes identifiées dans la matrice des flux autorisés."}
{"page":1,"tags":["Sécurité des communications","Surveillance des réseaux"],"text":"Le prestataire doit disposer une ou plusieurs sondes de détection d’incidents de sécurité sur le système d’information du service. Ces sondes doivent notamment permettre la supervision de chacune des interconnexions du système d’information du service avec des systèmes d’information tiers et des réseaux publics. Ces sondes doivent être des sources de collecte pour l’infrastructure d’analyse et de corrélation des événements (voir chapitre 12.9)."}
{"page":1,"tags":["Acquisition, développement et maintenance des systèmes d’information","Politique de développement sécurisé"],"text":"Le prestataire doit documenter et mettre en œuvre des règles de développement sécurisé des logiciels et des systèmes, et les appliquer aux développements internes."}
{"page":1,"tags":["Acquisition, développement et maintenance des systèmes d’information","Politique de développement sécurisé"],"text":"Le prestataire doit documenter et mettre en œuvre une formation adaptée en développement sécurisé aux employés concernés."}
{"page":1,"tags":["Acquisition, développement et maintenance des systèmes d’information","Procédures de contrôle des changements de système"],"text":"Le prestataire doit documenter et mettre en œuvre une procédure de contrôle des changements apportés au système d’information du service."}
{"page":1,"tags":["Acquisition, développement et maintenance des systèmes d’information","Procédures de contrôle des changements de système"],"text":"Le prestataire doit documenter et mettre en œuvre une procédure de validation des changements apportés au système d’information du service sur un environnement de pré-production avant leur mise en production."}
{"page":1,"tags":["Acquisition, développement et maintenance des systèmes d’information","Procédures de contrôle des changements de système"],"text":"Le prestataire doit conserver un historique des versions des logiciels et des systèmes (développements internes ou externes, produits commerciaux) mis en œuvre pour permettre de reconstituer, le cas échéant dans un environnement de test, un environnement complet tel qu’il était mis en œuvre à une date donnée. La durée de conservation de cet historique doit être en accord avec celle des sauvegardes (voir chapitre 12.5)."}
{"page":1,"tags":["Acquisition, développement et maintenance des systèmes d’information","Revue technique des applications après changement apporté à la plateforme d’exploitation"],"text":"Le prestataire doit documenter et mettre en œuvre une procédure permettant de tester, préalablement à leur mise en production, l’ensemble des applications afin de vérifier l’absence de tout effet indésirable sur l’activité ou sur la sécurité du service."}
{"page":1,"tags":["Acquisition, développement et maintenance des systèmes d’information","Environnement de développement sécurisé"],"text":"Le prestataire doit mettre en œuvre un environnement sécurisé de développement permettant de gérer l’intégralité du cycle de développement du système d’information du service."}
{"page":1,"tags":["Acquisition, développement et maintenance des systèmes d’information","Environnement de développement sécurisé"],"text":"Le prestataire doit prendre en compte les environnements de développement dans l’appréciation des risques et en assurer la protection conformément au présent référentiel."}
{"page":1,"tags":["Acquisition, développement et maintenance des systèmes d’information","Développement externalisé"],"text":"Le prestataire doit documenter et mettre en œuvre une procédure permettant de superviser et de contrôler l’activité de développement externalisé des logiciels et des systèmes. Cette procédure doit s’assurer que l’activité de développement externalisé soit conforme à la politique de développement sécurisé du prestataire et permette d’atteindre un niveau de sécurité du développement externe équivalent à celui d’un développement interne (voir exigence 14.1 a)."}
{"page":1,"tags":["Acquisition, développement et maintenance des systèmes d’information","Test de la sécurité et conformité du système"],"text":"les données d’entrée ;"}
{"page":1,"tags":["Acquisition, développement et maintenance des systèmes d’information","Test de la sécurité et conformité du système"],"text":"les résultats attendus en sortie."}
{"page":1,"tags":["Acquisition, développement et maintenance des systèmes d’information","Protection des données de test"],"text":"Le prestataire doit documenter et mettre en œuvre une procédure permettant d’assurer l’intégrité des données de tests utilisés en pré-production."}
{"page":1,"tags":["Acquisition, développement et maintenance des systèmes d’information","Protection des données de test"],"text":"Si le prestataire souhaite utiliser des données du commanditaire issues de la production pour réaliser des tests, le prestataire doit préalablement obtenir l’accord du commanditaire et les anonymiser. Le prestataire doit assurer la confidentialité des données lors de leur anonymisation."}
{"page":1,"tags":["Relations avec les tiers","Identification des tiers"],"text":"Le prestataire doit tenir à jour une liste exhaustive des tiers participant à la mise en œuvre du service (hébergeur, développeur, intégrateur, archiveur, sous-traitant opérant sur site ou à distance, fournisseurs de climatisation, etc.). Cette liste doit préciser la contribution du tiers au service et au traitement des données à caractère personnel. Elle doit tenir compte des cas de soustraitance à plusieurs niveaux."}
{"page":1,"tags":["Relations avec les tiers","Identification des tiers"],"text":"Le prestataire doit tenir à disposition du commanditaire la liste de l’ensemble des tiers qui peuvent accéder aux données et l’informer de tout changement de sous-traitants au sens de l’article 28 du [RGPD] afin que le commanditaire puisse émettre des objections à cet égard."}
{"page":1,"tags":["Relations avec les tiers","La sécurité dans les accords conclus avec les tiers"],"text":"Le prestataire doit exiger des tiers participant à la mise en œuvre du service, dans leur contribution au service, un niveau de sécurité au moins équivalent à celui qu’il s’engage à maintenir dans sa propre politique de sécurité. Il doit le faire au travers d’exigences, adaptées à chaque tiers et à sa contribution au service, dans les cahiers des charges ou dans les clauses de sécurité des accords de partenariat. Le prestataire doit inclure ces exigences dans les contrats conclus avec les tiers."}
{"page":1,"tags":["Relations avec les tiers","La sécurité dans les accords conclus avec les tiers"],"text":"Le prestataire doit contractualiser, avec chacun des tiers participant à la mise en œuvre du service, des clauses d’audit permettant à un organisme de qualification de vérifier que ces tiers respectent les exigences du présent référentiel."}
{"page":1,"tags":["Relations avec les tiers","La sécurité dans les accords conclus avec les tiers"],"text":"Le prestataire doit définir et attribuer les rôles et les responsabilités relatives à la modification ou à la fin du contrat le liant à un tiers participant à la mise en œuvre du service."}
{"page":1,"tags":["Relations avec les tiers","Surveillance et revue des services des tiers"],"text":"a) Le prestataire doit documenter et mettre en œuvre une procédure permettant de contrôler régulièrement les mesures mises en place par les tiers participant à la mise en œuvre du service pour respecter les exigences du présent référentiel, conformément au chapitre 18.3."}
{"page":1,"tags":["Relations avec les tiers","Gestion des changements apportés dans les services des tiers"],"text":"Le prestataire doit documenter et mettre en œuvre une procédure de suivi des changements apportés par les tiers participant à la mise en œuvre du service susceptibles d’affecter le niveau de sécurité du système d’information du service."}
{"page":1,"tags":["Relations avec les tiers","Gestion des changements apportés dans les services des tiers"],"text":"Dans la mesure où un changement de tiers participant à la mise en œuvre du service affecte le niveau de sécurité du service, le prestataire doit en informer l’ensemble des commanditaires sans délais conformément au chapitre 12.2 et mettre en œuvre les mesures permettant de rétablir le niveau de sécurité précédent."}
{"page":1,"tags":["Relations avec les tiers","Engagements de confidentialité"],"text":"Le prestataire doit documenter et mettre en œuvre une procédure permettant de réviser au moins annuellement les exigences en matière d’engagements de confidentialité ou de non-divulgation vis-à-vis des tiers participant à la mise en œuvre du service."}
{"page":1,"tags":["Gestion des incidents liés à la sécurité de l’information","Responsabilités et procédures"],"text":"Le prestataire doit documenter et mettre en œuvre une procédure permettant d’apporter des réponses rapides et efficaces aux incidents de sécurité. Ces procédures doivent définir les moyens et délais de communication des incidents de sécurité à l’ensemble des commanditaires concernés ainsi que le niveau de confidentialité exigé pour cette communication."}
{"page":1,"tags":["Gestion des incidents liés à la sécurité de l’information","Responsabilités et procédures"],"text":"Le prestataire doit informer ses employés et l’ensemble des tiers participant à la mise en œuvre du service de cette procédure."}
{"page":1,"tags":["Gestion des incidents liés à la sécurité de l’information","Responsabilités et procédures"],"text":"Le prestataire doit documenter toute violation de données à caractère personnel et en informer son commanditaire. La violation doit être notifiée à la CNIL5 si elle présente un risque pour les droits et libertés des personnes concernées. Elle doit faire l’objet d’une information auprès des personnes concernées lorsque le risque pour leur vie privée est élevé."}
{"page":1,"tags":["Gestion des incidents liés à la sécurité de l’information","Signalements liés à la sécurité de l’information"],"text":"Le prestataire doit documenter et mettre en œuvre une procédure exigeant de ses employés et des tiers participant à la mise en œuvre du service qu’ils lui rendent compte de tout incident de sécurité, avéré ou suspecté ainsi que de toute faille de sécurité."}
{"page":1,"tags":["Gestion des incidents liés à la sécurité de l’information","Signalements liés à la sécurité de l’information"],"text":"Le prestataire doit documenter et mettre en œuvre une procédure permettant à l’ensemble des commanditaires de signaler tout incident de sécurité, avéré ou suspecté et toute faille de sécurité."}
{"page":1,"tags":["Gestion des incidents liés à la sécurité de l’information","Signalements liés à la sécurité de l’information"],"text":"Le prestataire doit communiquer sans délai aux commanditaires les incidents de sécurité et les préconisations associées pour en limiter les impacts. Il doit permettre au commanditaire de choisir les niveaux de gravité des incidents pour lesquels il souhaite être informé."}
{"page":1,"tags":["Gestion des incidents liés à la sécurité de l’information","Signalements liés à la sécurité de l’information"],"text":"Le prestataire doit communiquer les incidents de sécurité aux autorités compétentes conformément aux exigences légales et réglementaires en vigueur."}
{"page":1,"tags":["Gestion des incidents liés à la sécurité de l’information","Appréciation des événements liés à la sécurité de l’information et prise de décision"],"text":"Le prestataire doit apprécier les événements liés à la sécurité de l’information et décider s’il faut les qualifier en incidents de sécurité. Pour l’appréciation, il doit s’appuyer sur une ou plusieurs échelles (estimation, évaluation, etc.) partagées avec le commanditaire."}
{"page":1,"tags":["Gestion des incidents liés à la sécurité de l’information","Appréciation des événements liés à la sécurité de l’information et prise de décision"],"text":"Le prestataire doit utiliser une classification permettant d’identifier clairement les incidents de sécurité touchant des données relatives aux commanditaires, conformément aux résultats de l’appréciation des risques. Cette classification doit inclure les violations de données à caractère personnel."}
{"page":1,"tags":["Gestion des incidents liés à la sécurité de l’information","Réponse aux incidents liés à la sécurité de l’information"],"text":"Le prestataire doit traiter les incidents de sécurité jusqu’à leur résolution et doit informer les commanditaires conformément aux procédures."}
{"page":1,"tags":["Gestion des incidents liés à la sécurité de l’information","Réponse aux incidents liés à la sécurité de l’information"],"text":"Le prestataire doit archiver les documents détaillant les incidents de sécurité."}
{"page":1,"tags":["Gestion des incidents liés à la sécurité de l’information","Réponse aux incidents liés à la sécurité de l’information"],"text":"Il est recommandé que le prestataire fasse appel à un prestataire de réponse aux incidents de sécurité [PRIS] qualifié pour traiter les incidents de sécurité nécessitant une expertise supplémentaire."}
{"page":1,"tags":["Gestion des incidents liés à la sécurité de l’information","Tirer des enseignements des incidents liés à la sécurité de l’information"],"text":"Le prestataire doit documenter et mettre en œuvre un processus d’amélioration continue afin de diminuer l’occurrence et l’impact de types d’incidents de sécurité déjà traités."}
{"page":1,"tags":["Gestion des incidents liés à la sécurité de l’information","Recueil de preuves"],"text":"Le prestataire doit documenter et mettre en œuvre une procédure permettant d’enregistrer les informations relatives aux incidents de sécurité et pouvant servir d’éléments de preuve."}
{"page":1,"tags":["Continuité d’activité","Organisation de la continuité d’activité"],"text":"Le prestataire doit documenter et mettre œuvre un plan de continuité d’activité prenant en compte la sécurité de l’information."}
{"page":1,"tags":["Continuité d’activité","Organisation de la continuité d’activité"],"text":"Le prestataire doit réviser annuellement le plan de continuité d’activité du service et à chaque changement majeur pouvant avoir un impact sur le service."}
{"page":1,"tags":["Continuité d’activité","Mise en œuvre de la continuité d’activité"],"text":"Le prestataire doit documenter et mettre en œuvre des procédures permettant de maintenir ou de restaurer l’exploitation du service et d’assurer la disponibilité des informations au niveau et dans les délais pour lesquels le prestataire s’est engagé vis-à-vis du commanditaire dans la convention de service."}
{"page":1,"tags":["Continuité d’activité","Vérifier, revoir et évaluer la continuité d’activité"],"text":"Le prestataire doit documenter et mettre en œuvre une procédure permettant de tester le plan de continuité d’activités afin de s’assurer qu’il est pertinent et efficace en situation de crise."}
{"page":1,"tags":["Continuité d’activité","Disponibilité des moyens de traitement de l’information"],"text":"Le prestataire doit documenter et mettre en œuvre les mesures qui lui permettent de répondre au besoin de disponibilité du service défini dans la convention de service (voir chapitre 19.1)."}
{"page":1,"tags":["Continuité d’activité","Sauvegarde de la configuration de l’infrastructure technique"],"text":"Le prestataire doit documenter et mettre en œuvre une procédure de sauvegarde hors-ligne de la configuration de l’infrastructure technique."}
{"page":1,"tags":["Continuité d’activité","Mise à disposition d’un dispositif de sauvegarde des données du commanditaire"],"text":"Le prestataire doit documenter et mettre à disposition du commanditaire un service de sauvegarde de ses données."}
{"page":1,"tags":["Conformité","Identification de la législation et des exigences contractuelles applicables"],"text":"les données à caractère personnel [LOI_IL], [RGPD] ;"}
{"page":1,"tags":["Conformité","Identification de la législation et des exigences contractuelles applicables"],"text":"le secret professionnel [CP_ART_226_13], le cas échéant sans préjudice de l’application de l’article 40 alinéa 2 du Code de procédure pénale relatif au signalement à une autorité judiciaire ;"}
{"page":1,"tags":["Conformité","Identification de la législation et des exigences contractuelles applicables"],"text":"l’abus de confiance [CP_ART_314-1] ;"}
{"page":1,"tags":["Conformité","Identification de la législation et des exigences contractuelles applicables"],"text":"le secret des correspondances privées [CP_ART_226-15] ;"}
{"page":1,"tags":["Conformité","Identification de la législation et des exigences contractuelles applicables"],"text":"l’atteinte à la vie privée [CP_ART_226-1] ;"}
{"page":1,"tags":["Conformité","Identification de la législation et des exigences contractuelles applicables"],"text":"l’accès ou le maintien frauduleux à un système d’information [CP_ART_323-1]."}
{"page":1,"tags":["Conformité","Identification de la législation et des exigences contractuelles applicables"],"text":"Le prestataire doit, selon son rôle dans les traitements de données à caractère personnel (responsable de traitement, sous-traitant ou co-responsable) justifier et documenter les choix de mesures techniques et organisationnelles réalisés en vue de répondre aux exigences de protection des données à caractère personnel du présent référentiel (voir partie 19.5)."}
{"page":1,"tags":["Conformité","Identification de la législation et des exigences contractuelles applicables"],"text":"Le prestataire doit documenter et mettre en œuvre les procédures permettant de respecter les exigences légales, réglementaires et contractuelles en vigueur applicables au service, ainsi que les besoins de sécurité spécifiques (voir exigence 8.3b))."}
{"page":1,"tags":["Conformité","Identification de la législation et des exigences contractuelles applicables"],"text":"Le prestataire doit, sur demande d’un commanditaire, lui rendre accessible l’ensemble de ces procédures."}
{"page":1,"tags":["Conformité","Identification de la législation et des exigences contractuelles applicables"],"text":"Le prestataire doit documenter et mettre en œuvre un processus de veille actif des exigences légales, réglementaires et contractuelles en vigueur applicables au service."}
{"page":1,"tags":["Conformité","Revue indépendante de la sécurité de l’information","Revue continue"],"text":"Le prestataire doit documenter et mettre en œuvre un programme d’audit sur trois ans définissant le périmètre et la fréquence des audits en accord avec la gestion du changement, les politiques, et  les résultats de l’appréciation des risques."}
{"page":1,"tags":["Conformité","Revue indépendante de la sécurité de l’information","Revue continue"],"text":"l’audit de la configuration de l’infrastructure technique du service. Cet audit est réalisé par échantillonnage et doit inclure tous types d’équipements et de serveurs présents dans le système d’information du service ;"}
{"page":1,"tags":["Conformité","Revue indépendante de la sécurité de l’information","Revue continue"],"text":"le test d’intrusion des interfaces d'administration exposées sur un réseau public ;"}
{"page":1,"tags":["Conformité","Revue indépendante de la sécurité de l’information","Revue continue"],"text":"le test d'intrusion de l'interface utilisateur pour les services SaaS ;"}
{"page":1,"tags":["Conformité","Revue indépendante de la sécurité de l’information","Revue continue"],"text":"si le service bénéficie de développements internes, l’audit de code source portant sur les  fonctionnalités de sécurité implémentées (l'approche en continue doit être privilégiée)."}
{"page":1,"tags":["Conformité","Revue indépendante de la sécurité de l’information","Revue continue"],"text":"Il est recommandé que le prestataire mette en œuvre des mécanismes automatisés d'audit de la configuration adaptés à l’infrastructure technique du service."}
{"page":1,"tags":["Conformité","Revue indépendante de la sécurité de l’information","Revue initiale"],"text":"pour les services autres que IaaS (CaaS, PaaS, SaaS, etc.), un audit de la configuration des ressources virtuelles ou physiques,  des systèmes d'exploitation et logiciels de base (OS, middlewares, bases de données,...) dans le périmètre du  service ;"}
{"page":1,"tags":["Conformité","Revue indépendante de la sécurité de l’information","Revue initiale"],"text":"un test d’intrusion portant sur les interfaces d'administration du service mises à disposition des commanditaires;"}
{"page":1,"tags":["Conformité","Revue indépendante de la sécurité de l’information","Revue initiale"],"text":"pour un service de type SaaS, un test d'intrusion portant sur l'interface mise à disposition des utilisateurs finaux ainsi qu'un audit du code source portant sur les  fonctionnalités de sécurité implémentées (authentification, gestion des sessions, gestion du cloisonnement en cas de mode multi-tenant). Si le SaaS rend un service de sécurité de l'information, une certification7 produit dédiée est nécessaire."}
{"page":1,"tags":["Conformité","Revue indépendante de la sécurité de l’information","Revue des changements majeurs"],"text":"audit d’architecture ;"}
{"page":1,"tags":["Conformité","Revue indépendante de la sécurité de l’information","Revue des changements majeurs"],"text":"audit organisationnel et physique ;"}
{"page":1,"tags":["Conformité","Revue indépendante de la sécurité de l’information","Revue des changements majeurs"],"text":"audit de la configuration de l’infrastructure technique du service ;"}
{"page":1,"tags":["Conformité","Revue indépendante de la sécurité de l’information","Revue des changements majeurs"],"text":"un test d’intrusion portant sur les interfaces d'administration du service mises à disposition des commanditaires;"}
{"page":1,"tags":["Conformité","Revue indépendante de la sécurité de l’information","Revue des changements majeurs"],"text":"pour un service de type SaaS, un test d'intrusion portant sur l'interface mise à disposition des utilisateurs finaux dans le cadre du catalogue de services, ainsi qu'un audit du code source portant sur les  fonctionnalités de sécurité implémentées (authentification, gestion des sessions, gestion du cloisonnement en cas de mode multi-tenant). Si le SaaS rend un service de sécurité de l'information, une certification produit dédiée est nécessaire."}
{"page":1,"tags":["Conformité","Conformité avec les politiques et les normes de sécurité"],"text":"Le prestataire via le responsable de la sécurité de l’information doit s’assurer régulièrement de l’exécution correcte de l’ensemble des procédures de sécurité placées sous sa responsabilité en vue de garantir leur conformité avec les politiques et normes de sécurité."}
{"page":1,"tags":["Conformité","Examen de la conformité technique"],"text":"Le prestataire doit documenter et mettre en œuvre une politique permettant de vérifier la conformité technique du service aux exigences du présent référentiel. Cette politique doit définir les objectifs, méthodes, fréquences, résultats attendus et mesures correctrices."}
{"page":1,"tags":["Exigences supplémentaires","Convention de service"],"text":"Le prestataire doit établir une convention de service avec chacun des commanditaires du service. Toute modification de la convention de service doit être soumise à acceptation du commanditaire."}
{"page":1,"tags":["Exigences supplémentaires","Convention de service"],"text":"les obligations, droits et responsabilités de chacune des parties : prestataire et tiers impliqués dans la fourniture du service, commanditaires, etc. ;"}
{"page":1,"tags":["Exigences supplémentaires","Convention de service"],"text":"les éléments explicitement exclus des responsabilités du prestataire dans la limite de ce que prévoient les exigences légales et réglementaires en vigueur, notamment l’article 28 du [RGPD] ;"}
{"page":1,"tags":["Exigences supplémentaires","Convention de service"],"text":"la localisation du service. La localisation du support doit être précisée lorsqu’il est réalisé depuis un État hors l’Union Européenne, comme le permet l’exigence 19.2.e."}
{"page":1,"tags":["Exigences supplémentaires","Convention de service"],"text":"Le prestataire doit proposer une convention de service appliquant le droit d’un État membre de l’Union Européenne. Le droit applicable doit être identifié dans la convention de service."}
{"page":1,"tags":["Exigences supplémentaires","Convention de service"],"text":"La convention de service doit indiquer que la collecte, la manipulation, le stockage, et plus généralement le traitement des données faits dans le cadre de l’avant-vente, de la mise en œuvre, de la maintenance et l’arrêt du service sont réalisés conformément aux exigences édictées par la législation en vigueur."}
{"page":1,"tags":["Exigences supplémentaires","Convention de service"],"text":"La convention de service doit indiquer que le prestataire doit mettre à la disposition du commanditaire, sur demande de celui-ci, les éléments d’appréciation des risques liés à la soumission des données du commanditaire au droit d’un état non-membre de l’Union Européenne (voir 5.3.e)."}
{"page":1,"tags":["Exigences supplémentaires","Convention de service"],"text":"Le prestataire doit décrire dans la convention de service les moyens techniques et organisationnels qu’il met en œuvre pour assurer le respect du droit applicable."}
{"page":1,"tags":["Exigences supplémentaires","Convention de service"],"text":"Le prestataire doit inclure dans la convention de service une clause de révision de la convention prévoyant notamment une résiliation sans pénalité pour le commanditaire en cas de perte de la qualification octroyée au service."}
{"page":1,"tags":["Exigences supplémentaires","Convention de service"],"text":"Le prestataire doit inclure dans la convention de service une clause de réversibilité permettant au commanditaire de récupérer l’ensemble de ses données (fournies directement par le commanditaire ou produites dans le cadre du service à partir des données ou des actions du commanditaire)."}
{"page":1,"tags":["Exigences supplémentaires","Convention de service"],"text":"la mise à disposition de fichiers suivant un ou plusieurs formats documentés et exploitables en dehors du service fourni par le prestataire ;"}
{"page":1,"tags":["Exigences supplémentaires","Convention de service"],"text":"la mise en place d’interfaces techniques permettant l’accès aux données suivant un schéma documenté et exploitable (API, format pivot, etc.)."}
{"page":1,"tags":["Exigences supplémentaires","Convention de service"],"text":"Les modalités techniques de la réversibilité figurent dans la convention de service."}
{"page":1,"tags":["Exigences supplémentaires","Convention de service"],"text":"Le prestataire doit indiquer dans la convention de service le niveau de disponibilité du service."}
{"page":1,"tags":["Exigences supplémentaires","Convention de service"],"text":"Le prestataire doit indiquer dans la convention de service qu’il ne peut disposer des données transmises et générées par le commanditaire, leur disposition étant réservée au commanditaire."}
{"page":1,"tags":["Exigences supplémentaires","Convention de service"],"text":"Le prestataire doit indiquer dans la convention de service qu’il ne divulgue aucune information relative à la prestation à des tiers, sauf autorisation formelle et écrite du commanditaire."}
{"page":1,"tags":["Exigences supplémentaires","Convention de service"],"text":"Le prestataire doit indiquer dans la convention de service si les données du commanditaire sont automatiquement sauvegardées ou non. Dans la négative, le prestataire doit sensibiliser le commanditaire aux risques encourus et clairement indiquer les opérations à mener par le commanditaire pour que ses données soient sauvegardées."}
{"page":1,"tags":["Exigences supplémentaires","Convention de service"],"text":"Le prestataire doit indiquer dans la convention de service s’il autorise l’accès distant pour des actions d’administration ou de support au système d’information du service."}
{"page":1,"tags":["Exigences supplémentaires","Convention de service"],"text":"le service est qualifié et inclure l’attestation de qualification ;"}
{"page":1,"tags":["Exigences supplémentaires","Convention de service"],"text":"le commanditaire peut déposer une réclamation relative au service qualifié auprès de l’ANSSI ;"}
{"page":1,"tags":["Exigences supplémentaires","Convention de service"],"text":"le commanditaire autorise l’ANSSI et l’organisme de qualification à auditer le service et son système d’information du service afin de vérifier qu’ils respectent les exigences du présent référentiel."}
{"page":1,"tags":["Exigences supplémentaires","Convention de service"],"text":"Le prestataire doit préciser dans la convention de service que le commanditaire autorise, conformément au présent référentiel (voir chapitre 18.2, un prestataire d’audit de la sécurité des systèmes d’information [PASSI] qualifié mandaté par le prestataire à auditer le service et son système d’information dans le cadre du plan de contrôle."}
{"page":1,"tags":["Exigences supplémentaires","Convention de service"],"text":"Le prestataire doit préciser dans la convention de service qu’il s’engage à mettre à disposition toutes les informations nécessaires à la réalisation d’audits de conformité aux dispositions de l’article 28 du [RGPD], menés par le commanditaire ou un tiers mandaté."}
{"page":1,"tags":["Exigences supplémentaires","Convention de service"],"text":"Il est recommandé que le tiers mandaté pour les audits soit un prestataire d’audit de la sécurité des systèmes d’information [PASSI] qualifié."}
{"page":1,"tags":["Exigences supplémentaires","Localisation des données"],"text":"Le prestataire doit documenter et communiquer au commanditaire la localisation du stockage et du traitement des données de ce dernier."}
{"page":1,"tags":["Exigences supplémentaires","Localisation des données"],"text":"Le prestataire doit stocker et traiter les données du commanditaire au sein de l’Union Européenne."}
{"page":1,"tags":["Exigences supplémentaires","Localisation des données"],"text":"Les opérations d’administration et de supervision du service doivent être réalisées depuis l’Union Européenne."}
{"page":1,"tags":["Exigences supplémentaires","Localisation des données"],"text":"Le prestataire doit stocker et traiter les données techniques (identités des bénéficiaires et des administrateurs de l’infrastructure technique, données manipulées par le Software Defined Network, journaux de l’infrastructure technique, annuaire, certificats, configuration des accès, etc.) au sein de l’Union Européenne."}
{"page":1,"tags":["Exigences supplémentaires","Localisation des données"],"text":"Le prestataire peut réaliser des opérations de support aux commanditaires depuis un État hors de l’Union Européenne. Il doit documenter la liste des opérations qui peuvent être effectuées par le support au commanditaire depuis un État hors de l’Union Européenne, et les mécanismes permettant d’en assurer le contrôle d’accès et la supervision depuis l’Union Européenne."}
{"page":1,"tags":["Exigences supplémentaires","Régionalisation"],"text":"Le prestataire doit s’assurer que les interfaces du service accessibles au commanditaire soient au moins disponibles en langue française."}
{"page":1,"tags":["Exigences supplémentaires","Régionalisation"],"text":"Le prestataire doit fournir un support de premier niveau en langue française."}
{"page":1,"tags":["Exigences supplémentaires","Fin de contrat"],"text":"effacement par réécriture complète de tout support ayant hébergé ces données ;"}
{"page":1,"tags":["Exigences supplémentaires","Fin de contrat"],"text":"effacement des clés utilisées pour le chiffrement des espaces de stockage du commanditaire décrit au chapitre 10.1 ;"}
{"page":1,"tags":["Exigences supplémentaires","Fin de contrat"],"text":"recyclage sécurisé, dans les conditions énoncées au chapitre 11.9."}
{"page":1,"tags":["Exigences supplémentaires","Fin de contrat"],"text":"À la fin du contrat, le prestataire doit supprimer les données techniques relatives au commanditaire (annuaire, certificats, configuration des accès, etc.)."}
{"page":1,"tags":["Exigences supplémentaires","Protection des données à caractère personnel"],"text":"les finalités des traitements déterminées, explicites et légitimes ;"}
{"page":1,"tags":["Exigences supplémentaires","Protection des données à caractère personnel"],"text":"la traçabilité des activités de traitement pour son compte et celui de son commanditaire ;"}
{"page":1,"tags":["Exigences supplémentaires","Protection des données à caractère personnel"],"text":"le fondement licite des traitements ;"}
{"page":1,"tags":["Exigences supplémentaires","Protection des données à caractère personnel"],"text":"l’interdiction du détournement de finalité des traitements ;"}
{"page":1,"tags":["Exigences supplémentaires","Protection des données à caractère personnel"],"text":"les données utilisées respectent le principe du minimum nécessaire et suffisant pour les traitements ; ainsi sont adéquates, pertinentes et limitées ;"}
{"page":1,"tags":["Exigences supplémentaires","Protection des données à caractère personnel"],"text":"la qualité des données utilisées pour les traitements maintenue : données exactes et tenues à jour ;"}
{"page":1,"tags":["Exigences supplémentaires","Protection des données à caractère personnel"],"text":"les durées de conservation définies et limitées."}
{"page":1,"tags":["Exigences supplémentaires","Protection des données à caractère personnel"],"text":"l’information des usagers via un traitement loyal et transparent ;"}
{"page":1,"tags":["Exigences supplémentaires","Protection des données à caractère personnel"],"text":"le recueil du consentement des usagers : exprès, démontrable et retirable ;"}
{"page":1,"tags":["Exigences supplémentaires","Protection des données à caractère personnel"],"text":"la possibilité pour les usagers d’exercer les droits d’accès, de rectification et d’effacement ;"}
{"page":1,"tags":["Exigences supplémentaires","Protection des données à caractère personnel"],"text":"la possibilité pour les usagers d’exercer les droits de limitation du traitement, de portabilité et d’opposition."}
{"page":1,"tags":["Exigences supplémentaires","Protection des données à caractère personnel"],"text":"Lorsqu’il agit en qualité de sous-traitant au sens de l’article 28 de [RGPD], le prestataire doit apporter assistance et conseil au commanditaire en l’informant si une instruction de ce dernier constitue une violation des règles de protection des données."}
{"page":1,"tags":["Exigences supplémentaires","Protection vis-à-vis du droit extra-européen"],"text":"Le siège statutaire, administration centrale et principal établissement du prestataire doivent être établis au sein d'un État membre de l'Union Européenne."}
{"page":1,"tags":["Exigences supplémentaires","Protection vis-à-vis du droit extra-européen"],"text":"individuellement détenus à plus de 24% ;"}
{"page":1,"tags":["Exigences supplémentaires","Protection vis-à-vis du droit extra-européen"],"text":"et collectivement détenus à plus de 39% ;  par des entités tierces possédant leur siège statutaire, administration centrale ou principal établissement au sein d’un État non membre de l’Union européenne."}
{"page":1,"tags":["Exigences supplémentaires","Protection vis-à-vis du droit extra-européen"],"text":"Si le capital détenu par ces entités tierces se présente sous la forme d’actions admises aux négociations sur un marché réglementé, ces susdites entités tierces sont celles déclarées conformément au I de l’article L.233-7 du code de commerce."}
{"page":1,"tags":["Exigences supplémentaires","Protection vis-à-vis du droit extra-européen"],"text":"en vertu d’un contrat ou de clauses statutaires, disposer d’un droit de véto ;"}
{"page":1,"tags":["Exigences supplémentaires","Protection vis-à-vis du droit extra-européen"],"text":"en vertu d’un contrat ou de clauses statutaires, désigner la majorité des membres des organes d’administration, de direction ou de surveillance du prestataire."}
{"page":1,"tags":["Exigences supplémentaires","Protection vis-à-vis du droit extra-européen"],"text":"En cas de recours par le prestataire, dans le cadre des services fournis au commanditaire, aux services d’une société tierce - y compris un sous-traitant - possédant son siège statutaire, administration centrale ou principal établissement au sein d'un État non membre de l'Union Européenne ou appartenant ou étant contrôlée par une société tierce domiciliée en dehors l'Union Européenne, cette susdite société tierce ne doit pas avoir la possibilité technique d’obtenir les données opérées au travers du service. Ces données visées sont celles qui sont confiées au prestataire par les commanditaires ainsi que toutes données techniques (identités des bénéficiaires et des administrateurs de l’infrastructure technique, données manipulées par le Software Defined Network, journaux de l’infrastructure technique, annuaire, certificats, configuration des accès, etc.) comprenant des informations sur les commanditaires."}
{"page":1,"tags":["Exigences supplémentaires","Protection vis-à-vis du droit extra-européen"],"text":"Pour les besoins du présent article, la notion de contrôle est entendue comme étant celle mentionnée au II de l’article L233-3 du code de commerce."}
{"page":1,"tags":["Exigences supplémentaires","Protection vis-à-vis du droit extra-européen"],"text":"Dans le cadre de l’exigence 19.6.c, toute société tierce à laquelle le prestataire recourt pour fournir tout ou partie du service rendu au commanditaire, doit garantir au prestataire une autonomie d’exploitation continue dans la fourniture des services d’informatique en nuage qu’il opère ou doit être qualifié SecNumCloud."}
{"page":1,"tags":["Exigences supplémentaires","Protection vis-à-vis du droit extra-européen"],"text":"Pour les besoins du présent article, la notion d’autonomie d’exploitation est entendue comme étant la capacité de maintenir la fourniture du service d’informatique en nuage en faisant appel aux compétences propres du prestataire ou en recourant à des prestations disponibles auprès d’au moins deux sociétés tierces."}
{"page":1,"tags":["Exigences supplémentaires","Protection vis-à-vis du droit extra-européen"],"text":"Le service fourni par le prestataire doit respecter la législation en vigueur en matière de droits fondamentaux et les valeurs de l’Union relatives au respect de la dignité humaine, à la liberté, à l’égalité, à la démocratie et à l’État de droit. Il peut être pris en considération pour l’appréciation de la conformité susmentionnée, le fait que le prestataire entretienne des liens avec un gouvernement ou un organisme public étrangers."}
{"page":1,"tags":["Exigences supplémentaires","Protection vis-à-vis du droit extra-européen"],"text":"Le prestataire doit informer formellement le commanditaire, et dans un délai d’un mois, de tout changement juridique, organisationnel ou technique pouvant avoir un impact sur la conformité de la prestation aux exigences du chapitre 19.6."}
{"page":1,"tags":["Références documentaires","Codes, textes législatifs et réglementaires","[LOI_IL]"],"text":"Loi du 6 janvier 1978 relative à l'informatique, aux fichiers et aux libertés. Disponible sur http:\/\/www.legifrance.gouv.fr"}
{"page":1,"tags":["Références documentaires","Codes, textes législatifs et réglementaires","[RGPD]"],"text":"Règlement (UE) 2016\/679 du parlement européen et du conseil du 27 avril 2016 relatif à la protection des personnes physiques à l’égard du traitement des données à caractère personnel et à la libre circulation de ces données."}
{"page":1,"tags":["Références documentaires","Codes, textes législatifs et réglementaires"],"text":"Disponible sur https:\/\/eur-lex.europa.eu"}
{"page":1,"tags":["Références documentaires","Codes, textes législatifs et réglementaires","[CP_ART_314-1]"],"text":"Article 334-1 du Code pénal relatif à l’abus de confiance. Disponible sur http:\/\/www.legifrance.gouv.fr"}
{"page":1,"tags":["Références documentaires","Codes, textes législatifs et réglementaires","[CP_ART_226-1]"],"text":"Article 226-1 du Code pénal relatif à l’atteinte à la vie privée. Disponible sur http:\/\/www.legifrance.gouv.fr"}
{"page":1,"tags":["Références documentaires","Codes, textes législatifs et réglementaires","[CP_ART_226-13]"],"text":"Article 226-13 du Code pénal relatif au secret professionnel. Disponible sur http:\/\/www.legifrance.gouv.fr"}
{"page":1,"tags":["Références documentaires","Codes, textes législatifs et réglementaires","[CP_ART_226-15]"],"text":"Article 226-15 du Code pénal relatif au secret des correspondances. Disponible sur http:\/\/www.legifrance.gouv.fr"}
{"page":1,"tags":["Références documentaires","Codes, textes législatifs et réglementaires","[CP_ART_323-1]"],"text":"Article 323-1 du Code pénal relatif à l’accès ou au maintien frauduleux dans un système de traitement automatisé de données. Disponible sur http:\/\/www.legifrance.gouv.fr"}
{"page":1,"tags":["Références documentaires","Codes, textes législatifs et réglementaires","[IGI_1300]"],"text":"Instruction générale interministérielle n° 1300\/SGDSN\/PSE\/PSD du 9 août 2021 sur la protection du secret de la défense nationale."}
{"page":1,"tags":["Références documentaires","Codes, textes législatifs et réglementaires"],"text":"Disponible sur http:\/\/www.legifrance.gouv.fr"}
{"page":1,"tags":["Références documentaires","Codes, textes législatifs et réglementaires","[II_910]"],"text":"Instruction interministérielle relative aux articles contrôlés de la sécurité des systèmes d’information (ACSSI), n°910\/SGDSN\/ANSSI, 22 octobre 2013."}
{"page":1,"tags":["Références documentaires","Codes, textes législatifs et réglementaires"],"text":"Disponible sur http:\/\/www.legifrance.gouv.fr"}
{"page":1,"tags":["Références documentaires","Codes, textes législatifs et réglementaires","[PSSIE]"],"text":"Politique de sécurité des systèmes d’information de l’État (PSSIE), portée par la circulaire du Premier ministre n°5725\/SG du 17 juillet 2014. Disponible sur http:\/\/www.legifrance.gouv.fr"}
{"page":1,"tags":["Références documentaires","Normes et documents techniques","[AUTHENTIFICATION]"],"text":"Recommandations relatives à l’authentification multifacteur et aux mots de passe, Guide ANSSI n° ANSSI-PG-078 du 08 février 2021, ANSSI."}
{"page":1,"tags":["Références documentaires","Normes et documents techniques","[CRYPTO_B1]"],"text":"Règles et recommandations concernant le choix et le dimensionnement des mécanismes cryptographiques, ANSSI, version en vigueur. Disponible sur http:\/\/www.ssi.gouv.fr"}
{"page":1,"tags":["Références documentaires","Normes et documents techniques","[CRYPTO_B2]"],"text":"Règles et recommandations concernant la gestion des clés utilisées dans des mécanismes cryptographiques, ANSSI, version en vigueur."}
{"page":1,"tags":["Références documentaires","Normes et documents techniques","[HOMOLOGATION]"],"text":"L’homologation de sécurité en neuf étapes simples, ANSSI, version en vigueur."}
{"page":1,"tags":["Références documentaires","Normes et documents techniques","[HYGIENE]"],"text":"Guide d’Hygiène Informatique, ANSSI, version en vigueur. Disponible sur http:\/\/www.ssi.gouv.fr"}
{"page":1,"tags":["Références documentaires","Normes et documents techniques","[INTERNET]"],"text":"Recommandations relatives à l’interconnexion d’un système d’information à Internet, Guide ANSSI n° ANSSI-PA-066 du 19 juin 2020, ANSSI."}
{"page":1,"tags":["Références documentaires","Normes et documents techniques","[NT_IPSEC]"],"text":"Recommandations de sécurité relatives à IPsec, note technique n° DAT-NT003\/ANSSI\/SDE\/NP du 3 août 2015, ANSSI."}
{"page":1,"tags":["Références documentaires","Normes et documents techniques","[NT_TLS]"],"text":"Recommandations de sécurité relatives à TLS, note technique  n° SDE-NT-35\/ANSSI\/SDE\/NP du 19 août 2016, ANSSI."}
{"page":1,"tags":["Références documentaires","Normes et documents techniques","[NT_SSH]"],"text":"Recommandations pour un usage sécurisé d’(Open)SSH, note technique n° DAT-NT-007\/ANSSI\/SDE\/NP du 17 août 2015, ANSSI. Disponible sur http:\/\/www.ssi.gouv.fr"}
{"page":1,"tags":["Références documentaires","Normes et documents techniques","[NT_JOURNAL]"],"text":"Recommandations de sécurité pour la mise en œuvre d’un système de journalisation, note technique n° DAT-NT-012\/ANSSI\/SDE\/NP du 2 décembre 2013, ANSSI."}
{"page":1,"tags":["Références documentaires","Normes et documents techniques","[NT_ADMIN]"],"text":"Recommandations relatives à l’administration sécurisée des systèmes d’information, Guide ANSSI n° ANSSI-PA-022 du 11 mai 2021, ANSSI  Disponible sur http:\/\/www.ssi.gouv.fr"}
{"page":1,"tags":["Références documentaires","Normes et documents techniques","[G_AUTH]"],"text":"Recommandations relatives à l’authentification multifacteur et aux mots de"}
{"page":1,"tags":["Références documentaires","Normes et documents techniques"],"text":"passe, Guide ANSSI n° ANSSI-PG-078 du 8 octobre 2021, ANSSI Disponible sur http:\/\/www.ssi.gouv.fr"}
{"page":1,"tags":["Références documentaires","Normes et documents techniques","[G_CVAP]"],"text":"Recommandations sur la sécurisation des systèmes de contrôle d’accès physique et de vidéoprotection, Guide ANSSI n° ANSSI-PA-72 du 04 mars 2020, ANSSI"}
{"page":1,"tags":["Références documentaires","Normes et documents techniques","[G_EXT]"],"text":"Guide de l’externalisation, Guide ANSSI du 03 décembre 2010, ANSSI Disponible sur http:\/\/www.ssi.gouv.fr"}
{"page":1,"tags":["Références documentaires","Normes et documents techniques","[G_INT]"],"text":"Recommandations relatives à l’interconnexion d’un système d’information sur Internet, Guide ANSSI n°ANSSI-PA-066 du 16 juin 2020, ANSSI Disponible sur http:\/\/www.ssi.gouv.fr"}
{"page":1,"tags":["Références documentaires","Normes et documents techniques","[PASSI]"],"text":"Référentiel d’exigences applicables à un prestataire d’audit de la sécurité des systèmes d’information, ANSSI, version en vigueur Disponible sur http:\/\/www.ssi.gouv.fr"}
{"page":1,"tags":["Références documentaires","Normes et documents techniques","[PDIS]"],"text":"Référentiel d’exigences applicables à un prestataire de détection des incidents de sécurité, ANSSI, version en vigueur Disponible sur http:\/\/www.ssi.gouv.fr"}
{"page":1,"tags":["Références documentaires","Normes et documents techniques","[PRIS]"],"text":"Référentiel d’exigences applicables à un prestataire de réponse aux incidents de sécurité, ANSSI, version en vigueur Disponible sur http:\/\/www.ssi.gouv.fr"}
{"page":1,"tags":["Références documentaires","Normes et documents techniques","[ISO27001]"],"text":"Norme internationale ISO\/IEC 27001:2013 : Technologies de l'information – Techniques de sécurité – Systèmes de management de la sécurité de l'information – Exigences."}
{"page":1,"tags":["Références documentaires","Autres références documentaires","[PROCESS_QUALIF]"],"text":"Processus de qualification d’un service, version en vigueur. Disponible sur http:\/\/www.ssi.gouv.fr"}
{"page":1,"tags":["Références documentaires","Autres références documentaires","[GUIDE_ACHAT]"],"text":"Guide d’achat de produits de sécurité et de services de confiance qualifiés, version en vigueur."}
{"page":1,"tags":["Références documentaires","Autres références documentaires","[GUIDE_CNIL]"],"text":"Recommandations pour les entreprises qui envisagent de souscrire à des services de cloud computing."}
