{"page":1,"tags":["Comment lire les recommandations ?","Restreindre la compatibilité en fonction du profil des clients"],"text":"Lorsque les clients d’un serveur ne sont pas maîtrisés, il convient d’établir un profil des clients souhaités. Le suivi éventuel de recommandations dégradées (Rx–) s’appuie sur ce profil."}
{"page":1,"tags":["Négociation des paramètres TLS","Utiliser des composants logiciels à jour"],"text":"Les composants dont dépend le déploiement de TLS doivent être tenus à jour."}
{"page":1,"tags":["Négociation des paramètres TLS","Versions de protocole","Privilégier TLS 1.3 et accepter TLS 1.2"],"text":"La version TLS 1.3 doit être prise en charge et privilégiée. La version TLS 1.2 est également acceptée sous condition de suivre les recommandations de ce guide."}
{"page":1,"tags":["Négociation des paramètres TLS","Versions de protocole","Ne pas utiliser SSL v2, SSL v3, TLS 1.0 et TLS 1.1"],"text":"Les versions SSLv2, SSLv3, TLS 1.0 et TLS 1.1 sont à proscrire. De plus, il faut privilégier l’usage de composants logiciels qui ne prennent pas en charge ces versions du protocole, par exemple parce que le support de ces versions a été désactivé à la \ncompilation."}
{"page":1,"tags":["Négociation des paramètres TLS","Suites cryptographiques","Authentifier le serveur à l’échange de clé"],"text":"Au cours d’un échange de clé, le serveur doit être authentifié par le client. Les alternatives anonymisées de ces échanges ou.reposant sur l’utilisation de certificat brut définies dans la RFC 7250 sont fortement déconseillées."}
{"page":1,"tags":["Négociation des paramètres TLS","Suites cryptographiques","Échanger les clés en assurant toujours la PFS"],"text":"La propriété de confidentialité persistante doit être assurée. Il faut pour cela employer une suite cryptographique reposant sur un échange Diffie–Hellman éphémère (ECDHE ou, à défaut, DHE)."}
{"page":1,"tags":["Négociation des paramètres TLS","Suites cryptographiques","Échanger les clés avec l’algorithme ECDHE"],"text":"Les échanges de clés ECDHE doivent être privilégiés, à l’aide des courbes secp256r1, secp384r1, secp521r1. Les courbes x25519 et x448 constituent des variantes acceptables. Les courbes brainpoolP256r, brainpoolP384r et brainpoolP512r1 sont également acceptables."}
{"page":1,"tags":["Négociation des paramètres TLS","Suites cryptographiques","Échanger les clés avec l’algorithme DHE"],"text":"Les échanges de clés DHE sont tolérés en utilisant les groupes 2048-bits ou plus (3072-bits ou plus si l’information doit être protégée au-delà de 2030) définis dans [34]."}
{"page":1,"tags":["Négociation des paramètres TLS","Suites cryptographiques","Authentifier le serveur par certificat"],"text":"Au cours d’un échange de clés, le serveur doit être authentifié par le client à l’aide \nd’un mécanisme asymétrique. Les méthodes basées sur ECDSA ou EdDSA sont à privilégier. Les méthodes basées sur RSA sont tolérées (RSASSA-PSS ou à défaut RSASSA-PKCS1-v1_5)."}
{"page":1,"tags":["Négociation des paramètres TLS","Suites cryptographiques","Authentifier le serveur avec un mécanisme symétrique"],"text":"Au cours d’un échange de clés, l’authentification du serveur par le client à l’aide d’un mécanisme symétrique est toléré."}
{"page":1,"tags":["Négociation des paramètres TLS","Suites cryptographiques","Privilégier AES ou ChaCha20"],"text":"Les suites mettant en œuvre l’algorithme de chiffrement par bloc AES sont à privilégier. L’algorithme de chiffrement par flot ChaCha20 constitue une alternative acceptable."}
{"page":1,"tags":["Négociation des paramètres TLS","Suites cryptographiques","Tolérer Camellia et ARIA"],"text":"Les suites mettant en œuvre les algorithmes de chiffrement par bloc Camellia et ARIA sont tolérées. La prise en charge de l’algorithme AES est conseillée, mais pas obligatoire."}
{"page":1,"tags":["Négociation des paramètres TLS","Suites cryptographiques","Utiliser un mode de chiffrement intègre"],"text":"La suite cryptographique retenue doit mettre en œuvre un mode de chiffrement intègre. Les modes GCM et CCM (hors CCM-8) sont à privilégiés. Le mode combiné ChaCha20_Poly1305 offre une alternative acceptable."}
{"page":1,"tags":["Négociation des paramètres TLS","Suites cryptographiques","Tolérer le mode CBC avec encrypt_then_mac"],"text":"La combinaison CBC + HMAC en conjonction avec l’extension encrypt_then_mac est tolérée."}
{"page":1,"tags":["Négociation des paramètres TLS","Suites cryptographiques","Utiliser SHA-2 comme fonction de hachage"],"text":"Les fonctions de hachage de la famille SHA-2 doivent être utilisées."}
{"page":1,"tags":["Négociation des paramètres TLS","Suites cryptographiques","Disposer de plusieurs suites cryptographiques"],"text":"À des fins préventives, les parties communicantes doivent implémenter plusieurs suites acceptables. Lorsque l’infrastructure est maîtrisée de bout en bout, elles peuvent ensuite n’en utiliser qu’une seule."}
{"page":1,"tags":["Négociation des paramètres TLS","Suites cryptographiques","Préférer l’ordre de suites du serveur"],"text":"Lorsque les clients d’un serveur ne sont pas maîtrisés, l’ordre des suites cryptographiques qui figure dans sa configuration doit prévaloir sur l’ordre des suites signalées par les clients."}
{"page":1,"tags":["Négociation des paramètres TLS","Extensions","Utiliser les extensions du tableau 2.4"],"text":"Les extensions recommandées dans le cadre général de l’utilisation du protocole TLS figurent dans le tableau 2.4. Elles doivent être prises en charge par les équipements maîtrisés et utilisées dans les contextes précisés."}
{"page":1,"tags":["Négociation des paramètres TLS","Extensions","Évaluer l’utilité des extensions du tableau 2.8"],"text":"Les extensions du tableau 2.8 sont relatives à des déploiements spécifiques. Seules celles évaluées nécessaires doivent être implémentées et utilisées."}
{"page":1,"tags":["Négociation des paramètres TLS","Extensions","Ne pas utiliser les extensions du tableau 2.9"],"text":"Les extensions du tableau 2.9 sont toujours déconseillées."}
{"page":1,"tags":["Négociation des paramètres TLS","Considérations additionnelles","Utiliser un générateur d’aléa robuste"],"text":"Les aléas utilisés dans le ClientHello et le ServerHello doivent provenir de générateurs d’aléa de qualité cryptographique."}
{"page":1,"tags":["Négociation des paramètres TLS","Considérations additionnelles","Privilégier l’aléa du serveur avec un suffixe prédictible"],"text":"L’aléa utilisé dans le ClientHello doit privilégier une construction sur 32 octets aléatoires tandis que l’aléa utilisé dans le ServerHello doit privilégier une construction de 24 octets aléatoires avec, en suffixe les valeurs spécifiées dans [11]."}
{"page":1,"tags":["Négociation des paramètres TLS","Considérations additionnelles","Privilégier les aléas sans préfixe prédictible"],"text":"Les aléas utilisés dans le ClientHello et le ServerHello doivent privilégier les 32 octets aléatoires plutôt que la construction préfixée par une heure Unix."}
{"page":1,"tags":["Négociation des paramètres TLS","Considérations additionnelles","Ne pas utiliser la compression TLS"],"text":"L’utilisation du mécanisme de compression TLS est à proscrire."}
{"page":1,"tags":["Négociation des paramètres TLS","Considérations additionnelles","Limiter la durée de vie des tickets"],"text":"Le serveur doit être configuré afin d’émettre des tickets dont la durée de vie n’excède pas 24 heures."}
{"page":1,"tags":["Négociation des paramètres TLS","Considérations additionnelles","Effectuer des reprises de session avec échange de clé"],"text":"L’utilisation du mécanisme de reprise de.session avec un échange de clé Diffie–Hellman est recommandée."}
{"page":1,"tags":["Négociation des paramètres TLS","Considérations additionnelles","Effectuer des reprises de session avec PFS"],"text":"Si le mécanisme de reprise de session est utilisé, alors l’utilisation de tickets de session doit être préférée à celle d’identifiants de session. Dans le cas des tickets de session, les tickets doivent être supprimés à intervalles réduits, et les clés de chiffrement doivent être supprimées et regénérées régulièrement. Dans le cas des identifiants de session, les données mises en cache doivent être supprimées de part et d’autre à intervalles réduits."}
{"page":1,"tags":["Négociation des paramètres TLS","Considérations additionnelles","Toujours activer l’extension pour la renégociation sécurisée"],"text":"Un client TLS, qu’il souhaite ou non effectuer des renégociations, doit utiliser l’extension renegotiation_info. Un serveur TLS, s’il souhaite effectuer des renégociations, doit utiliser l’extension renegotiation_info."}
{"page":1,"tags":["Négociation des paramètres TLS","Considérations additionnelles","Ne pas transmettre de données 0-RTT"],"text":"Il est déconseillé à un client de transmettre.de données 0-RTT. Un serveur ne doit pas accepter les données 0-RTT lorsqu’il en reçoit."}
{"page":1,"tags":["Mise en place de lʼIGC","Attributs des certificats X.509","Champs de base","Présenter un certificat signé avec SHA-2"],"text":"La fonction de hachage utilisée pour la signature du certificat doit faire partie de la famille SHA-2."}
{"page":1,"tags":["Mise en place de lʼIGC","Attributs des certificats X.509","Champs de base","Présenter un certificat valide pendant 3 ans ou moins"],"text":"La période de validité d’un certificat d’authentification TLS (serveur ou client) ne doit pas excéder 3 ans. Pour un certificat émis après le 1 mars 2018, sa période de validité ne doit pas dépasser 825 jours."}
{"page":1,"tags":["Mise en place de lʼIGC","Attributs des certificats X.509","Champs de base","Utiliser des clés de taille suffisante"],"text":"Pour une protection des communications jusqu’en 2030, les clés RSA doivent avoir \nune taille minimale de 2048 bits, et les clés ECDSA doivent avoir une taille minimale de 256 bits. Pour ECDSA, les courbes éprouvées retenues sont secp256r1, secp384r1, secp521r1, ainsi que brainpoolP256r1, brainpoolP384r1 et brainpoolP512r1. Pour RSA, l’exposant de la clé publique doit être supérieur ou égal à 2 puissance 16 + 1."}
{"page":1,"tags":["Mise en place de lʼIGC","Attributs des certificats X.509","Extensions","Présenter un KeyUsage approprié"],"text":"Dans un certificat d’authentification, l’extension Key Usage doit être présente et marquée comme critique. Pour un serveur, elle doit contenir les valeurs digitalSignature et\/ou keyEncipherment. Pour un client, elle doit contenir la valeur digitalSignature. Aucune autre valeur n’est admise."}
{"page":1,"tags":["Mise en place de lʼIGC","Attributs des certificats X.509","Extensions","Présenter un ExtendedKeyUsage approprié"],"text":"Dans un certificat d’authentification, l’extension Extended Key Usage doit être présente et marquée comme non-critique. Pour un.serveur, elle doit uniquement contenir la valeur id-kp-serverAuth. Pour un client, elle doit uniquement contenir la valeur id-kp- clientAuth."}
{"page":1,"tags":["Mise en place de lʼIGC","Attributs des certificats X.509","Extensions","Présenter un SubjectAlternativeName approprié (côté serveur)"],"text":"Pour un certificat d’authentification utilisé par un serveur TLS, l’extension Subject Alternative Name doit être présente et marquée comme non-critique. Elle doit contenir au moins une entrée dNSName correspondant à l’un des FQDN du service applicatif qui utilise le certificat."}
{"page":1,"tags":["Mise en place de lʼIGC","Attributs des certificats X.509","Extensions","Réserver chaque certificat à une seule terminaison TLS"],"text":"Un même certificat d’authentification ne doit pas être utilisé par plus d’une seule terminaison TLS."}
{"page":1,"tags":["Mise en place de lʼIGC","Attributs des certificats X.509","Extensions"],"text":"Pour une même terminaison, il est recommandé d’utiliser autant de certificats que de versions et de méthodes d’échange de clés acceptées."}
{"page":1,"tags":["Mise en place de lʼIGC","Attributs des certificats X.509","Extensions","Présenter un AKI correspondant au SKI défini par l’AC"],"text":"Pour un certificat d’authentification TLS (serveur ou client), l’extension AKI doit être présente, marquée comme non-critique et.contenir l’identifiant présent dans l’extension SKI du certificat de l’AC relatif à la clé de signature utilisée."}
{"page":1,"tags":["Mise en place de lʼIGC","Attributs des certificats X.509","Extensions","Présenter un certificat avec des sources de révocation"],"text":"Au moins une extension parmi CRLDP et AIA doit être présente et marquée comme non-critique."}
{"page":1,"tags":["Mise en place de lʼIGC","Contrôle de validité","Transmettre une chaîne de certificats ordonnée et complète"],"text":"Les chaînes de certificats transmises à l’aide des messages Certificate doivent, afin de conserver une compatibilité avec TLS 1.2, être ordonnées et complètes."}
{"page":1,"tags":["Mise en place de lʼIGC","Contrôle de validité","Préférer l’agrafage OCSP"],"text":"Lorsque le protocole OCSP est mis en œuvre, il est recommandé d’utiliser l’agrafage OCSP. Cette solution est aussi préférable à la distribution de CRL."}
{"page":1,"tags":["Mise en place de lʼIGC","Contrôle de validité","Prévoir une redondance des moyens de révocation"],"text":"Pour des raisons de disponibilité, des mécanismes de redondance de publication des informations de révocation doivent être mis en œuvre."}
{"page":1,"tags":["Mise en place de lʼIGC","Contrôle de validité","Réagir en hard-fail"],"text":"Les composants logiciels TLS privilégiant la sécurité doivent réagir en hard-fail."}
{"page":1,"tags":["Mise en place de lʼIGC","Contrôle de validité","Utiliser des certificats enregistrés par CT"],"text":"Dans le cadre d’une IGC publique, il est recommandé d’utiliser des certificats d’authentification enregistrés par leur AC parmi les registres du programme CT."}
{"page":1,"tags":["Mise en place de lʼIGC","Contrôle de validité","Rejeter tous les certificats invalidés par CT"],"text":"Dans le cadre d’une IGC publique, les clients TLS doivent rejeter tous les certificats qui sont accompagnés d’un Signed Certificate.Timestamp (SCT) invalide, et les certificats EV qui ne sont pas accompagnés d’un SCT."}
