{"page":1,"tags":["Identify","Asset Management"],"text":"# Identify\n\n## Asset Management\n\nPhysical devices and systems within the organization are inventoried.\n\nSoftware platforms and applications within the organization are inventoried.\n\nOrganizational communication and data flows are mapped.\n\nExternal information systems are catalogued.\n\nResources (e.g., hardware, devices, data, time, personnel, and software) are prioritized based on their classification, criticality, and business value.\n\nCybersecurity roles and responsibilities for the entire workforce and third-party stakeholders (e.g., suppliers, customers, partners) are established."}
{"page":1,"tags":["Identify","Business Environment"],"text":"# Identify\n\n## Business Environment\n\nThe organization’s role in the supply chain is identified and communicated.\n\nThe organization’s place in critical infrastructure and its industry sector is identified and communicated.\n\nPriorities for organizational mission, objectives, and activities are established and communicated.\n\nDependencies and critical functions for delivery of critical services are established.\n\nResilience requirements to support delivery of critical services are established for all operating states (e.g. under duress\/attack, during recovery, normal operations)."}
{"page":1,"tags":["Identify","Governance"],"text":"# Identify\n\n## Governance\n\nOrganizational cybersecurity policy is established and communicated.\n\nCybersecurity roles and responsibilities are coordinated and aligned with internal roles and external partners.\n\nLegal and regulatory requirements regarding cybersecurity, including privacy and civil liberties obligations, are understood and managed.\n\nGovernance and risk management processes address cybersecurity risks."}
{"page":1,"tags":["Identify","Risk Assessment"],"text":"# Identify\n\n## Risk Assessment\n\nAsset vulnerabilities are identified and documented.\n\nCyber threat intelligence is received from information sharing forums and sources.\n\nThreats, both internal and external, are identified and documented.\n\nPotential business impacts and likelihoods are identified.\n\nThreats, vulnerabilities, likelihoods, and impacts are used to determine risk.\n\nRisk responses are identified and prioritized."}
{"page":1,"tags":["Identify","Risk Management Strategy"],"text":"# Identify\n\n## Risk Management Strategy\n\nRisk management processes are established, managed, and agreed to by organizational stakeholders.\n\nOrganizational risk tolerance is determined and clearly expressed.\n\nThe organization’s determination of risk tolerance is informed by its role in critical infrastructure and sector specific risk analysis."}
{"page":1,"tags":["Identify","Supply Chain Risk Management"],"text":"# Identify\n\n## Supply Chain Risk Management\n\nCyber supply chain risk management processes are identified, established, assessed, managed, and agreed to by organizational stakeholders.\n\nSuppliers and third party partners of information systems, components, and services are identified, prioritized, and assessed using a cyber supply chain risk assessment process.\n\nContracts with suppliers and third-party partners are used to implement appropriate measures designed to meet the objectives of an organization’s cybersecurity program and Cyber Supply Chain Risk Management Plan.\n\nSuppliers and third-party partners are routinely assessed using audits, test results, or other forms of evaluations to confirm they are meeting their contractual obligations.\n\nResponse and recovery planning and testing are conducted with suppliers and third-party providers."}
{"page":1,"tags":["Protect","Identity Management, Authentication and Access Control"],"text":"# Protect\n\n## Identity Management, Authentication and Access Control\n\nIdentities and credentials are issued, managed, verified, revoked, and audited for authorized devices, users and processes.\n\nPhysical access to assets is managed and protected.\n\nRemote access is managed.\n\nAccess permissions and authorizations are managed, incorporating the principles of least privilege and separation of duties.\n\nNetwork integrity is protected (e.g., network segregation, network segmentation).\n\nIdentities are proofed and bound to credentials and asserted in interactions.\n\nUsers, devices, and other assets are authenticated (e.g., single-factor, multi-factor) commensurate with the risk of the transaction (e.g., individuals’ security and privacy risks and other organizational risks)."}
{"page":1,"tags":["Protect","Awareness and Training"],"text":"# Protect\n\n## Awareness and Training\n\nAll users are informed and trained.\n\nPrivileged users understand their roles and responsibilities.\n\nThird-party stakeholders (e.g., suppliers, customers, partners) understand their roles and responsibilities.\n\nSenior executives understand their roles and responsibilities.\n\nPhysical and cybersecurity personnel understand their roles and responsibilities."}
{"page":1,"tags":["Protect","Data Security"],"text":"# Protect\n\n## Data Security\n\nData-at-rest is protected.\n\nData-in-transit is protected.\n\nAssets are formally managed throughout removal, transfers, and disposition.\n\nAdequate capacity to ensure availability is maintained.\n\nProtections against data leaks are implemented.\n\nIntegrity checking mechanisms are used to verify software, firmware, and information integrity.\n\nThe development and testing environment(s) are separate from the production environment.\n\nIntegrity checking mechanisms are used to verify hardware integrity."}
{"page":1,"tags":["Protect","Information Protection Processes and Procedures"],"text":"# Protect\n\n## Information Protection Processes and Procedures\n\nA baseline configuration of information technology\/industrial control systems is created and maintained incorporating security principles (e.g. concept of least functionality).\n\nA System Development Life Cycle to manage systems is implemented.\n\nConfiguration change control processes are in place.\n\nBackups of information are conducted, maintained, and tested.\n\nPolicy and regulations regarding the physical operating environment for organizational assets are met.\n\nData is destroyed according to policy.\n\nProtection processes are improved.\n\nEffectiveness of protection technologies is shared.\n\nResponse plans (Incident Response and Business Continuity) and recovery plans (Incident Recovery and Disaster Recovery) are in place and managed.\n\nResponse and recovery plans are tested.\n\nCybersecurity is included in human resources practices (e.g., deprovisioning, personnel screening).\n\nA vulnerability management plan is developed and implemented."}
{"page":1,"tags":["Protect","Maintenance"],"text":"# Protect\n\n## Maintenance\n\nMaintenance and repair of organizational assets are performed and logged, with approved and controlled tools.\n\nRemote maintenance of organizational assets is approved, logged, and performed in a manner that prevents unauthorized access."}
{"page":1,"tags":["Protect","Protective Technology"],"text":"# Protect\n\n## Protective Technology\n\nAudit\/log records are determined, documented, implemented, and reviewed in accordance with policy.\n\nRemovable media is protected and its use restricted according to policy.\n\nThe principle of least functionality is incorporated by configuring systems to provide only essential capabilities.\n\nCommunications and control networks are protected.\n\nMechanisms (e.g., failsafe, load balancing, hot swap) are implemented to achieve resilience requirements in normal and adverse situations."}
{"page":1,"tags":["Detect","Anomalies and Events"],"text":"# Detect\n\n## Anomalies and Events\n\nA baseline of network operations and expected data flows for users and systems is established and managed.\n\nDetected events are analyzed to understand attack targets and methods.\n\nEvent data are collected and correlated from multiple sources and sensors.\n\nImpact of events is determined.\n\nIncident alert thresholds are established."}
{"page":1,"tags":["Detect","Security Continuous Monitoring"],"text":"# Detect\n\n## Security Continuous Monitoring\n\nThe network is monitored to detect potential cybersecurity events.\n\nThe physical environment is monitored to detect potential cybersecurity events.\n\nPersonnel activity is monitored to detect potential cybersecurity events.\n\nMalicious code is detected.\n\nUnauthorized mobile code is detected.\n\nExternal service provider activity is monitored to detect potential cybersecurity events.\n\nMonitoring for unauthorized personnel, connections, devices, and software is performed.\n\nVulnerability scans are performed."}
{"page":1,"tags":["Detect","Detection Processes"],"text":"# Detect\n\n## Detection Processes\n\nRoles and responsibilities for detection are well defined to ensure accountability.\n\nDetection activities comply with all applicable requirements.\n\nDetection processes are tested.\n\nEvent detection information is communicated.\n\nDetection processes are continuously improved."}
{"page":1,"tags":["Respond","Response Planning"],"text":"# Respond\n\n## Response Planning\n\nResponse plan is executed during or after an incident."}
{"page":1,"tags":["Respond","Communications"],"text":"# Respond\n\n## Communications\n\nPersonnel know their roles and order of operations when a response is needed.\n\nIncidents are reported consistent with established criteria.\n\nInformation is shared consistent with response plans.\n\nCoordination with stakeholders occurs consistent with response plans.\n\nVoluntary information sharing occurs with external stakeholders to achieve broader cybersecurity situational awareness."}
{"page":1,"tags":["Respond","Analysis"],"text":"# Respond\n\n## Analysis\n\nNotifications from detection systems are investigated.\n\nThe impact of the incident is understood.\n\nForensics are performed.\n\nIncidents are categorized consistent with response plans.\n\nProcesses are established to receive, analyze and respond to vulnerabilities disclosed to the organization from internal and external sources (e.g. internal testing, security bulletins, or security researchers)"}
{"page":1,"tags":["Respond","Mitigation"],"text":"# Respond\n\n## Mitigation\n\nIncidents are contained.\n\nIncidents are mitigated.\n\nNewly identified vulnerabilities are mitigated or documented as accepted risks."}
{"page":1,"tags":["Respond","Improvements"],"text":"# Respond\n\n## Improvements\n\nResponse plans incorporate lessons learned.\n\nResponse strategies are updated."}
{"page":1,"tags":["Recover","Recovery Planning"],"text":"# Recover\n\n## Recovery Planning\n\nRecovery plan is executed during or after a cybersecurity incident."}
{"page":1,"tags":["Recover","Improvements"],"text":"# Recover\n\n## Improvements\n\nRecovery plans incorporate lessons learned.\n\nRecovery strategies are updated."}
{"page":1,"tags":["Recover","Communications"],"text":"# Recover\n\n## Communications\n\nPublic relations are managed.\n\nReputation is repaired after an incident.\n\nRecovery activities are communicated to internal and external stakeholders as well as executive and management teams."}
