{"page":1,"tags":["Managing security risk","Governance","Board Direction"],"text":"**Provider.** NCSC\n**Title.** Cyber Assessment Framework\n**Description.** National Cyber Security Centre - Cyber Assessment Framework\nhttps:\/\/www.ncsc.gov.uk\/collection\/cyber-assessment-framework\n\n# Managing security risk\n\n## Governance\n\n### Board Direction\n\nYour organisation's approach and policy relating to the security of network and information systems supporting the operation of your essential function(s) are owned and managed at board-level. These are communicated, in a meaningful way, to risk management decision-makers across the organisation.\n\nRegular board-level discussions on the security of network and information systems supporting the operation of your essential function(s) take place, based on timely and accurate information and informed by expert guidance.\n\nThere is a board-level individual who has overall accountability for the security of network and information systems and drives regular discussion at board-level.\n\nDirection set at board-level is translated into effective organisational practices that direct and control the security of the network and information systems supporting your essential function(s)."}
{"page":1,"tags":["Managing security risk","Governance","Roles and Responsibilities"],"text":"**Provider.** NCSC\n**Title.** Cyber Assessment Framework\n**Description.** National Cyber Security Centre - Cyber Assessment Framework\nhttps:\/\/www.ncsc.gov.uk\/collection\/cyber-assessment-framework\n\n# Managing security risk\n\n## Governance\n\n### Roles and Responsibilities\n\nKey roles and responsibilities for the security of network and information systems supporting your essential function(s) have been identified. These are reviewed regularly to ensure they remain fit for purpose.\n\nAppropriately capable and knowledgeable staff fill those roles and are given the time, authority, and resources to carry out their duties.\n\nThere is clarity on who in your organisation has overall accountability for the security of the network and information systems supporting your essential function(s)."}
{"page":1,"tags":["Managing security risk","Governance","Decision-making"],"text":"**Provider.** NCSC\n**Title.** Cyber Assessment Framework\n**Description.** National Cyber Security Centre - Cyber Assessment Framework\nhttps:\/\/www.ncsc.gov.uk\/collection\/cyber-assessment-framework\n\n# Managing security risk\n\n## Governance\n\n### Decision-making\n\nSenior management have visibility of key risk decisions made throughout the organisation.\n\nRisk management decision-makers understand their responsibilities for making effective and timely decisions in the context of the risk appetite regarding the essential function(s), as set by senior management.\n\nRisk management decision-making is delegated and escalated where necessary, across the organisation, to people who have the skills, knowledge, tools and authority they need.\n\nRisk management decisions are regularly reviewed to ensure their continued relevance and validity."}
{"page":1,"tags":["Managing security risk","Risk Management","Risk Management Process"],"text":"**Provider.** NCSC\n**Title.** Cyber Assessment Framework\n**Description.** National Cyber Security Centre - Cyber Assessment Framework\nhttps:\/\/www.ncsc.gov.uk\/collection\/cyber-assessment-framework\n\n# Managing security risk\n\n## Risk Management\n\n### Risk Management Process\n\nYour organisational process ensures that security risks to network and information systems relevant to essential function(s) are identified, analysed, prioritised, and managed.\n\nYour approach to risk is focused on the possibility of adverse impact to your essential function(s), leading to a detailed understanding of how such impact might arise as a consequence of possible attacker actions and the security properties of your network and information systems.\n\nYour risk assessments are based on a clearly understood set of threat assumptions, informed by an up-to-date understanding of security threats to your essential function(s) and your sector.\n\nYour risk assessments are informed by an understanding of the vulnerabilities in the network and information systems supporting your essential function(s).\n\nThe output from your risk management process is a clear set of security requirements that will address the risks in line with your organisational approach to security.\n\nSignificant conclusions reached in the course of your risk management process are communicated to key security decision-makers and accountable individuals.\n\nYour risk assessments are dynamic and updated in the light of relevant changes which may include technical changes to network and information systems, change of use and new threat information.\n\nThe effectiveness of your risk management process is reviewed regularly, and improvements made as required.\n\nYou perform detailed threat analysis and understand how this applies to your organisation in the context of the threat to your sector and the wider CNI."}
{"page":1,"tags":["Managing security risk","Risk Management","Assurance"],"text":"**Provider.** NCSC\n**Title.** Cyber Assessment Framework\n**Description.** National Cyber Security Centre - Cyber Assessment Framework\nhttps:\/\/www.ncsc.gov.uk\/collection\/cyber-assessment-framework\n\n# Managing security risk\n\n## Risk Management\n\n### Assurance\n\nYou validate that the security measures in place to protect the network and information systems\u2028are effective and remain effective for the lifetime over which they are needed.\n\nYou understand the assurance methods available to you and choose appropriate methods to gain confidence in the security of essential function(s).\n\nYour confidence in the security as it relates to your technology, people, and processes can be\u2028justified to, and verified by, a third party.\n\nSecurity deficiencies uncovered by assurance activities are assessed, prioritised and remedied when necessary in a timely and effective way.\n\nThe methods used for assurance are reviewed to ensure they are working as intended and remain the most appropriate method to use."}
{"page":1,"tags":["Managing security risk","Asset Management","Asset Management"],"text":"**Provider.** NCSC\n**Title.** Cyber Assessment Framework\n**Description.** National Cyber Security Centre - Cyber Assessment Framework\nhttps:\/\/www.ncsc.gov.uk\/collection\/cyber-assessment-framework\n\n# Managing security risk\n\n## Asset Management\n\n### Asset Management\n\nAll assets relevant to the secure operation of essential function(s) are identified and inventoried (at a suitable level of detail). The inventory is kept up-to-date.\n\nDependencies on supporting infrastructure (e.g. power, cooling etc) are recognised and recorded.\n\nYou have prioritised your assets according to their importance to the operation of the essential function(s).\n\nYou have assigned responsibility for managing all assets, including physical assets, relevant to the operation of the essential function(s).\n\nAssets relevant to the essential function(s) are managed with cyber security in mind throughout their lifecycle, from creation through to eventual decommissioning or disposal."}
{"page":1,"tags":["Managing security risk","Supply Chain","Supply Chain"],"text":"**Provider.** NCSC\n**Title.** Cyber Assessment Framework\n**Description.** National Cyber Security Centre - Cyber Assessment Framework\nhttps:\/\/www.ncsc.gov.uk\/collection\/cyber-assessment-framework\n\n# Managing security risk\n\n## Supply Chain\n\n### Supply Chain\n\nYou have a deep understanding of your supply chain, including sub- contractors and the wider risks it faces. You consider factors such as supplier’s partnerships, competitors, nationality and other organisations with which they sub- contract. This informs your risk assessment and procurement processes.\n\nYour approach to supply chain risk management considers the risks to your essential function(s) arising from supply chain subversion by capable and well-resourced attackers.\n\nYou have confidence that information shared with suppliers that is essential to the operation of your function(s) is appropriately protected from sophisticated attacks.\n\nYou understand which contracts are relevant and you include appropriate security obligations in relevant contracts. You have a proactive approach to contract management which may include a contract management plan for relevant contracts.\n\nCustomer \/ supplier ownership of responsibilities is laid out in contracts.\n\nAll network connections and data sharing with third parties are managed effectively and proportionately.\n\nWhen appropriate, your incident management process and that of your suppliers provide mutual support in the resolution of incidents."}
{"page":1,"tags":["Protecting against cyber attack","Service Protection Policies, Processes and Procedures","Policy, Process and Procedure Development"],"text":"**Provider.** NCSC\n**Title.** Cyber Assessment Framework\n**Description.** National Cyber Security Centre - Cyber Assessment Framework\nhttps:\/\/www.ncsc.gov.uk\/collection\/cyber-assessment-framework\n\n# Protecting against cyber attack\n\n## Service Protection Policies, Processes and Procedures\n\n### Policy, Process and Procedure Development\n\nYou fully document your overarching security governance and risk management approach, technical security practice and specific regulatory compliance. Cyber security is integrated and embedded throughout policies, processes and procedures and key performance indicators are reported to your executive management.\n\nYour organisation’s policies, processes and procedures are developed to be practical, usable and appropriate for your essential function(s) and your technologies.\n\nPolicies, processes and procedures that rely on user behaviour are practical, appropriate and achievable.\n\nYou review and update policies, processes and procedures at suitably regular intervals to ensure they remain relevant. This is in addition to reviews following a major cyber security incident.\n\nAny changes to the essential function(s) or the threat it faces triggers a review of policies, processes and procedures.\n\nYour systems are designed so that they remain secure even when user security policies, processes and procedures are not always followed."}
{"page":1,"tags":["Protecting against cyber attack","Service Protection Policies, Processes and Procedures","Policy, Process and Procedure Implementation"],"text":"**Provider.** NCSC\n**Title.** Cyber Assessment Framework\n**Description.** National Cyber Security Centre - Cyber Assessment Framework\nhttps:\/\/www.ncsc.gov.uk\/collection\/cyber-assessment-framework\n\n# Protecting against cyber attack\n\n## Service Protection Policies, Processes and Procedures\n\n### Policy, Process and Procedure Implementation\n\nAll your policies, processes and procedures are followed, their correct application and security effectiveness is evaluated.\n\nYour policies, processes and procedures are integrated with other organisational policies, processes and procedures, including HR assessments of individuals' trustworthiness.\n\nYour policies, processes and procedures are effectively and appropriately communicated across all levels of the organisation resulting in good staff awareness of their responsibilities.\n\nAppropriate action is taken to address all breaches of policies, processes and procedures with potential to adversely impact the essential function(s) including aggregated breaches."}
{"page":1,"tags":["Protecting against cyber attack","Identity and Access Control","Identity Verification, Authentication and Authorisation"],"text":"**Provider.** NCSC\n**Title.** Cyber Assessment Framework\n**Description.** National Cyber Security Centre - Cyber Assessment Framework\nhttps:\/\/www.ncsc.gov.uk\/collection\/cyber-assessment-framework\n\n# Protecting against cyber attack\n\n## Identity and Access Control\n\n### Identity Verification, Authentication and Authorisation\n\nYour process of initial identity verification is robust enough to provide a high level of confidence of a user’s identity profile before allowing an authorised user access to network and information systems that support your essential function(s).\n\nOnly authorised and individually authenticated users can physically access and logically connect to your network or information systems on which your essential function(s) depends.\n\nThe number of authorised users and systems that have access to all your network and information systems supporting the essential function(s) is limited to the minimum necessary.\n\nYou use additional authentication mechanisms, such as multi-factor\u2028(MFA), for all user access, including remote access, to all network and information systems that operate or support your essential function(s).\n\nThe list of users and systems with access to network and information systems supporting and delivering the essential function(s) is reviewed on a regular basis, at least every six months.\n\nYour approach to authenticating users, devices and systems follows up to date best practice."}
{"page":1,"tags":["Protecting against cyber attack","Identity and Access Control","Device Management"],"text":"**Provider.** NCSC\n**Title.** Cyber Assessment Framework\n**Description.** National Cyber Security Centre - Cyber Assessment Framework\nhttps:\/\/www.ncsc.gov.uk\/collection\/cyber-assessment-framework\n\n# Protecting against cyber attack\n\n## Identity and Access Control\n\n### Device Management\n\nAll privileged operations performed on your network and information systems supporting your essential function(s) are conducted from highly trusted devices, such as Privileged Access Workstations, dedicated solely to those operations.\n\nYou either obtain independent and professional assurance of the security of third-party devices or networks before they connect to your network and information systems, or you only allow third-party devices or networks that are dedicated to supporting your network and information systems to connect.\n\nYou perform certificate-based device identity management and only allow known devices to access systems necessary for the operation of your essential function(s).\n\nYou perform regular scans to detect unknown devices and investigate any findings."}
{"page":1,"tags":["Protecting against cyber attack","Identity and Access Control","Privileged User Management"],"text":"**Provider.** NCSC\n**Title.** Cyber Assessment Framework\n**Description.** National Cyber Security Centre - Cyber Assessment Framework\nhttps:\/\/www.ncsc.gov.uk\/collection\/cyber-assessment-framework\n\n# Protecting against cyber attack\n\n## Identity and Access Control\n\n### Privileged User Management\n\nPrivileged user access to network and information systems supporting your essential function(s) is carried out from dedicated separate accounts that are closely monitored and managed.\n\nThe issuing of temporary, time- bound rights for privileged user access and \/ or external third- party support access is in place.\n\nPrivileged user access rights are regularly reviewed and always updated as part of your joiners, movers and leavers process.\n\nAll privileged user activity is routinely reviewed, validated and recorded for offline analysis and investigation."}
{"page":1,"tags":["Protecting against cyber attack","Identity and Access Control","Identity and Access Management (IdAM)"],"text":"**Provider.** NCSC\n**Title.** Cyber Assessment Framework\n**Description.** National Cyber Security Centre - Cyber Assessment Framework\nhttps:\/\/www.ncsc.gov.uk\/collection\/cyber-assessment-framework\n\n# Protecting against cyber attack\n\n## Identity and Access Control\n\n### Identity and Access Management (IdAM)\n\nYou follow a robust procedure to verify each user and issue the minimum required access rights, and the application of the procedure is regularly audited.\n\nUser access rights are reviewed both when people change roles via your joiners, leavers and movers process and at regular intervals - at least annually.\n\nAll user, device and systems access to the systems supporting the essential function(s) is logged and monitored.\n\nYou regularly review access logs and correlate this data with other access records and expected activity.\n\nAttempts by unauthorised users, devices or systems to connect to the systems supporting the essential function(s) are alerted, promptly assessed and investigated."}
{"page":1,"tags":["Protecting against cyber attack","Data Security","Understanding Data"],"text":"**Provider.** NCSC\n**Title.** Cyber Assessment Framework\n**Description.** National Cyber Security Centre - Cyber Assessment Framework\nhttps:\/\/www.ncsc.gov.uk\/collection\/cyber-assessment-framework\n\n# Protecting against cyber attack\n\n## Data Security\n\n### Understanding Data\n\nYou have identified and catalogued all the data important to the operation of the essential function(s), or that would assist an attacker.\n\nYou have identified and catalogued who has access to the data important to the operation of the essential function(s).\n\nYou maintain a current understanding of the location, quantity and quality of data important to the operation of the essential function(s).\n\nYou take steps to remove or minimise unnecessary copies or unneeded historic data.\n\nYou have identified all mobile devices and media that may hold data important to the operation of the essential function(s).\n\nYou maintain a current understanding of the data links used to transmit data that is important to your essential function(s).\n\nYou understand the context, limitations and dependencies of your important data.\n\nYou understand and document the impact on your essential function(s) of all relevant scenarios, including unauthorised data access, modification or deletion, or when authorised users are unable to appropriately access this data.\n\nYou validate these documented impact statements regularly, at least annually."}
{"page":1,"tags":["Protecting against cyber attack","Data Security","Data in Transit"],"text":"**Provider.** NCSC\n**Title.** Cyber Assessment Framework\n**Description.** National Cyber Security Centre - Cyber Assessment Framework\nhttps:\/\/www.ncsc.gov.uk\/collection\/cyber-assessment-framework\n\n# Protecting against cyber attack\n\n## Data Security\n\n### Data in Transit\n\nYou have identified and protected (effectively and proportionately) all the data links that carry data important to the operation of your essential function(s).\n\nYou apply appropriate physical and \/ or technical means to protect data that travels over non-trusted or openly accessible carriers, with justified confidence in the robustness of the protection applied.\n\nSuitable alternative transmission paths are available where there is a significant risk of impact on the operation of the essential function(s) due to resource limitation (e.g. transmission equipment or function failure, or important data being blocked or jammed)."}
{"page":1,"tags":["Protecting against cyber attack","Data Security","Stored Data"],"text":"**Provider.** NCSC\n**Title.** Cyber Assessment Framework\n**Description.** National Cyber Security Centre - Cyber Assessment Framework\nhttps:\/\/www.ncsc.gov.uk\/collection\/cyber-assessment-framework\n\n# Protecting against cyber attack\n\n## Data Security\n\n### Stored Data\n\nAll copies of data important to the operation of your essential function(s) are necessary. Where this important data is transferred to less secure systems, the data is provided with limited detail and \/ or as a read-only copy.\n\nYou have applied suitable physical and \/ or technical means to protect this important stored data from unauthorised access, modification or deletion.\n\nIf cryptographic protections are used you apply suitable technical and procedural means, and you have justified confidence in the robustness of the protection applied.\n\nYou have suitable, secured backups of data to allow the operation of the essential function(s) to continue should the original data not be available. This may include off- line or segregated backups, or appropriate alternative forms such as paper copies.\n\nNecessary historic or archive data is suitably secured in storage."}
{"page":1,"tags":["Protecting against cyber attack","Data Security","Mobile Data"],"text":"**Provider.** NCSC\n**Title.** Cyber Assessment Framework\n**Description.** National Cyber Security Centre - Cyber Assessment Framework\nhttps:\/\/www.ncsc.gov.uk\/collection\/cyber-assessment-framework\n\n# Protecting against cyber attack\n\n## Data Security\n\n### Mobile Data\n\nMobile devices that hold data that is important to the operation of the essential function(s) are catalogued, are under your organisation's control and configured according to best practice for the platform, with appropriate technical and procedural policies in place.\n\nYour organisation can remotely wipe all mobile devices holding data important to the operation of the essential function(s).\n\nYou have minimised this data on these mobile devices. Some data may be automatically deleted off mobile devices after a certain period."}
{"page":1,"tags":["Protecting against cyber attack","Data Security","Media \/ Equipment Sanitisation"],"text":"**Provider.** NCSC\n**Title.** Cyber Assessment Framework\n**Description.** National Cyber Security Centre - Cyber Assessment Framework\nhttps:\/\/www.ncsc.gov.uk\/collection\/cyber-assessment-framework\n\n# Protecting against cyber attack\n\n## Data Security\n\n### Media \/ Equipment Sanitisation\n\nYou catalogue and track all devices that contain data important to the operation of the essential function(s) (whether a specific storage device or one with integral storage).\n\nData important to the operation of the essential function(s) is removed from all devices, equipment and removable media before reuse and \/ or disposal using an assured product or service."}
{"page":1,"tags":["Protecting against cyber attack","System Security","Secure by Design"],"text":"**Provider.** NCSC\n**Title.** Cyber Assessment Framework\n**Description.** National Cyber Security Centre - Cyber Assessment Framework\nhttps:\/\/www.ncsc.gov.uk\/collection\/cyber-assessment-framework\n\n# Protecting against cyber attack\n\n## System Security\n\n### Secure by Design\n\nYou employ appropriate expertise to design network and information systems.\n\nYour network and information systems are segregated into appropriate security zones (e.g. systems supporting the essential function(s) are segregated in a highly trusted, more secure zone).\n\nThe network and information systems supporting your essential function(s) are designed to have simple data flows between components to support effective security monitoring.\n\nThe network and information systems supporting your essential function(s) are designed to be easy to recover.\n\nContent-based attacks are mitigated for all inputs to network and information systems that affect the essential function(s) (e.g. via transformation and inspection)."}
{"page":1,"tags":["Protecting against cyber attack","System Security","Secure Configuration"],"text":"**Provider.** NCSC\n**Title.** Cyber Assessment Framework\n**Description.** National Cyber Security Centre - Cyber Assessment Framework\nhttps:\/\/www.ncsc.gov.uk\/collection\/cyber-assessment-framework\n\n# Protecting against cyber attack\n\n## System Security\n\n### Secure Configuration\n\nYou have identified, documented and actively manage (e.g. maintain security configurations, patching, updating according to good practice) the assets that need to be carefully configured to maintain the security of the essential function(s).\n\nAll platforms conform to your secure, defined baseline build, or the latest known good configuration version for that environment.\n\nYou closely and effectively manage changes in your environment, ensuring that network and system configurations are secure and documented.\n\nYou regularly review and validate that your network and information systems have the expected, secure settings and configuration.\n\nOnly permitted software can be installed.\n\nStandard users are not able to change settings that would impact security or the business operation.\n\nIf automated decision-making technologies are in use, their operation is well understood, and decisions can be replicated.\n\nGeneric, shared, default name and built-in accounts have been removed or disabled. Where this is not possible, credentials to these accounts have been changed."}
{"page":1,"tags":["Protecting against cyber attack","System Security","Secure Management"],"text":"**Provider.** NCSC\n**Title.** Cyber Assessment Framework\n**Description.** National Cyber Security Centre - Cyber Assessment Framework\nhttps:\/\/www.ncsc.gov.uk\/collection\/cyber-assessment-framework\n\n# Protecting against cyber attack\n\n## System Security\n\n### Secure Management\n\nYour systems and devices supporting the operation of the essential function(s) are only administered or maintained by authorised privileged users from highly trusted devices, such as Privileged Access Workstations, dedicated solely to those operations.\n\nYou regularly review and update technical knowledge about network and information systems, such as documentation and network diagrams, and ensure they are securely stored.\n\nYou prevent, detect and remove malware, and unauthorised software. You use technical, procedural and physical measures as necessary."}
{"page":1,"tags":["Protecting against cyber attack","System Security","Vulnerability Management"],"text":"**Provider.** NCSC\n**Title.** Cyber Assessment Framework\n**Description.** National Cyber Security Centre - Cyber Assessment Framework\nhttps:\/\/www.ncsc.gov.uk\/collection\/cyber-assessment-framework\n\n# Protecting against cyber attack\n\n## System Security\n\n### Vulnerability Management\n\nYou maintain a current understanding of the exposure of your essential function(s) to publicly-known vulnerabilities.\n\nAnnounced vulnerabilities for all software packages, network and information systems used to support your essential function(s) are tracked, prioritised and mitigated (e.g. by patching) promptly.\n\nYou regularly test to fully understand the vulnerabilities of the network and information systems that support the operation of your essential function(s) and verify this understanding with third-party testing.\n\nYou maximise the use of supported software, firmware and hardware in your network and information systems supporting your essential function(s)."}
{"page":1,"tags":["Protecting against cyber attack","Resilient Networks and Systems","Resilience Preparation"],"text":"**Provider.** NCSC\n**Title.** Cyber Assessment Framework\n**Description.** National Cyber Security Centre - Cyber Assessment Framework\nhttps:\/\/www.ncsc.gov.uk\/collection\/cyber-assessment-framework\n\n# Protecting against cyber attack\n\n## Resilient Networks and Systems\n\n### Resilience Preparation\n\nYou have business continuity and disaster recovery plans that have been tested for practicality, effectiveness and completeness. Appropriate use is made\u2028of different test methods (e.g. manual fail-over, table-top exercises, or red-teaming).\n\nYou use your security awareness and threat intelligence sources to identify new or heightened levels of risk, which result in immediate and potentially temporary security measures to enhance the security of your network and information systems (e.g. in response to a widespread outbreak of very damaging malware)."}
{"page":1,"tags":["Protecting against cyber attack","Resilient Networks and Systems","Design for Resilience"],"text":"**Provider.** NCSC\n**Title.** Cyber Assessment Framework\n**Description.** National Cyber Security Centre - Cyber Assessment Framework\nhttps:\/\/www.ncsc.gov.uk\/collection\/cyber-assessment-framework\n\n# Protecting against cyber attack\n\n## Resilient Networks and Systems\n\n### Design for Resilience\n\nNetwork and information systems supporting the operation of your essential function(s) are segregated from other business and external systems by appropriate technical and physical means (e.g. separate network and system infrastructure with independent user administration). Internet services are not accessible from network and information systems supporting the essential function(s).\n\nYou have identified and mitigated all resource limitations (e.g. bandwidth limitations and single network paths).\n\nYou have identified and mitigated any geographical constraints or weaknesses. (e.g. systems that your essential function(s) depends upon\u2028are replicated in another location, important network connectivity has alternative physical paths and service providers).\n\nYou review and update assessments of dependencies, resource and geographical limitations and mitigations when necessary."}
{"page":1,"tags":["Protecting against cyber attack","Resilient Networks and Systems","Backups"],"text":"**Provider.** NCSC\n**Title.** Cyber Assessment Framework\n**Description.** National Cyber Security Centre - Cyber Assessment Framework\nhttps:\/\/www.ncsc.gov.uk\/collection\/cyber-assessment-framework\n\n# Protecting against cyber attack\n\n## Resilient Networks and Systems\n\n### Backups\n\nYour comprehensive, automatic and tested technical and procedural backups are secured at centrally accessible or secondary sites to recover from an extreme event.\n\nBackups of all important data and information needed to recover the essential function(s) are made, tested, documented and routinely reviewed."}
{"page":1,"tags":["Protecting against cyber attack","Staff Awareness and Training","Cyber Security Culture"],"text":"**Provider.** NCSC\n**Title.** Cyber Assessment Framework\n**Description.** National Cyber Security Centre - Cyber Assessment Framework\nhttps:\/\/www.ncsc.gov.uk\/collection\/cyber-assessment-framework\n\n# Protecting against cyber attack\n\n## Staff Awareness and Training\n\n### Cyber Security Culture\n\nYour executive management clearly and effectively communicates the organisation's cyber security priorities and objectives to all staff. Your organisation displays positive cyber security attitudes, behaviours and expectations.\n\nPeople in your organisation raising potential cyber security incidents and issues are treated positively.\n\nIndividuals at all levels in your organisation routinely report concerns or issues about cyber security and are recognised for their contribution to keeping the organisation secure.\n\nYour management is seen to be committed to and actively involved in cyber security.\n\nYour organisation communicates openly about cyber security, with any concern being taken seriously.\n\nPeople across your organisation participate in cyber security activities and improvements, building joint ownership and bringing knowledge of their area of expertise."}
{"page":1,"tags":["Protecting against cyber attack","Staff Awareness and Training","Cyber Security Training"],"text":"**Provider.** NCSC\n**Title.** Cyber Assessment Framework\n**Description.** National Cyber Security Centre - Cyber Assessment Framework\nhttps:\/\/www.ncsc.gov.uk\/collection\/cyber-assessment-framework\n\n# Protecting against cyber attack\n\n## Staff Awareness and Training\n\n### Cyber Security Training\n\nAll people in your organisation, from the most senior to the most junior, follow appropriate cyber security training paths.\n\nEach individuals cyber security training is tracked and refreshed at suitable intervals.\n\nYou routinely evaluate your cyber security training and awareness activities to ensure they reach the widest audience and are effective.\n\nYou make cyber security information and good practice guidance easily accessible, widely available and you know it is referenced and used within your organisation."}
{"page":1,"tags":["Detecting cyber security events","Security Monitoring","Monitoring Coverage"],"text":"**Provider.** NCSC\n**Title.** Cyber Assessment Framework\n**Description.** National Cyber Security Centre - Cyber Assessment Framework\nhttps:\/\/www.ncsc.gov.uk\/collection\/cyber-assessment-framework\n\n# Detecting cyber security events\n\n## Security Monitoring\n\n### Monitoring Coverage\n\nMonitoring is based on an understanding of your networks, common cyber attack methods and what you need awareness of in order to detect potential security incidents that could affect the operation of your essential function(s) (e.g. presence of malware, malicious emails, user policy violations).\n\nYour monitoring data provides enough detail to reliably detect security incidents that could affect the operation of your essential function(s).\n\nYou easily detect the presence or absence of IoCs on your essential function(s), such as known malicious command and control signatures.\n\nExtensive monitoring of user activity in relation to the operation of your essential function(s) enables you to detect policy violations and an agreed list of suspicious or undesirable behaviour.\n\nYou have extensive monitoring coverage that includes host-based monitoring and network gateways.\n\nAll new systems are considered as potential monitoring data sources to maintain a comprehensive monitoring capability."}
{"page":1,"tags":["Detecting cyber security events","Security Monitoring","Securing Logs"],"text":"**Provider.** NCSC\n**Title.** Cyber Assessment Framework\n**Description.** National Cyber Security Centre - Cyber Assessment Framework\nhttps:\/\/www.ncsc.gov.uk\/collection\/cyber-assessment-framework\n\n# Detecting cyber security events\n\n## Security Monitoring\n\n### Securing Logs\n\nThe integrity of log data is protected, or any modification is detected and attributed.\n\nThe logging architecture has mechanisms, policies, processes and procedures to ensure that it can protect itself from threats comparable to those it is trying to identify. This includes protecting the essential function(s) itself, and the data within it.\n\nLog data analysis and normalisation is only performed on copies of the data keeping the master copy unaltered.\n\nLog data is synchronised, using an accurate common time source, so that separate datasets can be correlated in different ways.\n\nAccess to log data is limited to those with business need and no others.\n\nAll actions involving all log data (e.g. copying, deleting, modifying or viewing) can be traced back to a unique user.\n\nLegitimate reasons for accessing log data are given in use policies."}
{"page":1,"tags":["Detecting cyber security events","Security Monitoring","Generating Alerts"],"text":"**Provider.** NCSC\n**Title.** Cyber Assessment Framework\n**Description.** National Cyber Security Centre - Cyber Assessment Framework\nhttps:\/\/www.ncsc.gov.uk\/collection\/cyber-assessment-framework\n\n# Detecting cyber security events\n\n## Security Monitoring\n\n### Generating Alerts\n\nLog data is enriched with other network knowledge and data when investigating certain suspicious activity or alerts.\n\nA wide range of signatures and indicators of compromise is used for investigations of suspicious activity and alerts.\n\nAlerts can be easily resolved to network assets using knowledge of networks and systems. The resolution of these alerts is performed in almost real time.\n\nSecurity alerts relating to all essential function(s) are prioritised and this information is used to support incident management.\n\nLogs are reviewed almost continuously, in real time.\n\nAlerts are tested to ensure that they are generated reliably and that it is possible to distinguish genuine security incidents from false alarms."}
{"page":1,"tags":["Detecting cyber security events","Security Monitoring","Identifying Security Incidents"],"text":"**Provider.** NCSC\n**Title.** Cyber Assessment Framework\n**Description.** National Cyber Security Centre - Cyber Assessment Framework\nhttps:\/\/www.ncsc.gov.uk\/collection\/cyber-assessment-framework\n\n# Detecting cyber security events\n\n## Security Monitoring\n\n### Identifying Security Incidents\n\nYou have selected threat intelligence sources or services using risk-based and threat- informed decisions based\u2028on your business needs and sector (e.g. vendor reporting and patching, strong anti-virus providers, sector and community-based infoshare, special interest groups).\n\nYou apply all new signatures and IoCs within a reasonable (risk-based) time of receiving them.\n\nYou receive signature updates for all your protective technologies (e.g. AV, IDS).\n\nYou track the effectiveness of your intelligence feeds and actively share feedback on the usefulness of IoCs and any other indicators with the threat community (e.g. sector partners, threat intelligence providers, government agencies)."}
{"page":1,"tags":["Detecting cyber security events","Security Monitoring","Monitoring Tools and Skills"],"text":"**Provider.** NCSC\n**Title.** Cyber Assessment Framework\n**Description.** National Cyber Security Centre - Cyber Assessment Framework\nhttps:\/\/www.ncsc.gov.uk\/collection\/cyber-assessment-framework\n\n# Detecting cyber security events\n\n## Security Monitoring\n\n### Monitoring Tools and Skills\n\nYou have monitoring staff, who are responsible for the analysis, investigation and reporting of monitoring alerts covering both security and performance.\n\nMonitoring staff have defined roles and skills that cover all parts of the monitoring and investigation process.\n\nMonitoring staff follow policies, processes and procedures that address all governance reporting requirements, internal and external.\n\nMonitoring staff are empowered to look beyond the fixed process to investigate and understand non-standard threats, by developing their own investigative techniques and making new use of data.\n\nYour monitoring tools make use of all log data collected to pinpoint activity within an incident.\n\nMonitoring staff and tools drive and shape new log data collection and can make wide use of it.\n\nMonitoring staff are aware of the operation of essential function(s) and related assets and can identify and prioritise alerts or investigations that relate to them."}
{"page":1,"tags":["Detecting cyber security events","Proactive Security Event Discovery","System Abnormalities for Attack Detection"],"text":"**Provider.** NCSC\n**Title.** Cyber Assessment Framework\n**Description.** National Cyber Security Centre - Cyber Assessment Framework\nhttps:\/\/www.ncsc.gov.uk\/collection\/cyber-assessment-framework\n\n# Detecting cyber security events\n\n## Proactive Security Event Discovery\n\n### System Abnormalities for Attack Detection\n\nNormal system behaviour is fully understood to such an extent that searching for system abnormalities is a potentially effective way of detecting malicious activity (e.g. You fully understand which systems should and should not communicate and when).\n\nSystem abnormality descriptions from past attacks and threat intelligence, on yours and other networks, are used to signify malicious activity.\n\nThe system abnormalities you search for consider the nature of attacks likely to impact on the network and information systems supporting the operation of your essential function(s).\n\nThe system abnormality descriptions you use are updated to reflect changes in your network and information systems and current threat intelligence."}
{"page":1,"tags":["Detecting cyber security events","Proactive Security Event Discovery","Proactive Attack Discovery"],"text":"**Provider.** NCSC\n**Title.** Cyber Assessment Framework\n**Description.** National Cyber Security Centre - Cyber Assessment Framework\nhttps:\/\/www.ncsc.gov.uk\/collection\/cyber-assessment-framework\n\n# Detecting cyber security events\n\n## Proactive Security Event Discovery\n\n### Proactive Attack Discovery\n\nYou routinely search for system abnormalities indicative of malicious activity on the network and information systems supporting the operation of your essential function(s), generating alerts based on the results of such searches.\n\nYou have justified confidence in the effectiveness of your searches for system abnormalities indicative of malicious activity."}
{"page":1,"tags":["Minimising the impact of cyber security incidents","Response and Recovery Planning","Response Plan"],"text":"**Provider.** NCSC\n**Title.** Cyber Assessment Framework\n**Description.** National Cyber Security Centre - Cyber Assessment Framework\nhttps:\/\/www.ncsc.gov.uk\/collection\/cyber-assessment-framework\n\n# Minimising the impact of cyber security incidents\n\n## Response and Recovery Planning\n\n### Response Plan\n\nYour incident response plan is based on a clear understanding of the security risks to the network and information systems supporting your essential function(s).\n\nYour incident response plan is comprehensive (i.e. covers the complete lifecycle of an incident, roles and responsibilities, and reporting) and covers likely impacts of both known attack patterns and of possible attacks, previously unseen.\n\nYour incident response plan is documented and integrated with wider organisational business plans and supply chain response plans, as well as dependencies on supporting infrastructure (e.g. power, cooling etc).\n\nYour incident response plan is communicated and understood by the business areas involved with the operation of your essential function(s)."}
{"page":1,"tags":["Minimising the impact of cyber security incidents","Response and Recovery Planning","Response and Recovery Capability"],"text":"**Provider.** NCSC\n**Title.** Cyber Assessment Framework\n**Description.** National Cyber Security Centre - Cyber Assessment Framework\nhttps:\/\/www.ncsc.gov.uk\/collection\/cyber-assessment-framework\n\n# Minimising the impact of cyber security incidents\n\n## Response and Recovery Planning\n\n### Response and Recovery Capability\n\nYou understand the resources that will likely be needed to carry out any required response activities, and arrangements are in place to make these resources available.\n\nYou understand the types of information that will likely be needed to inform response decisions and arrangements are in place to make this information available.\n\nYour response team members have the skills and knowledge required to decide on the response actions necessary to limit harm, and the authority to carry them out.\n\nKey roles are duplicated, and operational delivery knowledge is shared with all individuals involved in the operations and recovery of the essential function(s).\n\nBack-up mechanisms are available that can be readily activated to allow continued operation of your essential function(s), although possibly at a reduced level, if primary network and information systems fail or are unavailable.\n\nArrangements exist to augment your organisation’s incident response capabilities with external support if necessary (e.g. specialist cyber incident responders)."}
{"page":1,"tags":["Minimising the impact of cyber security incidents","Response and Recovery Planning","Testing and Exercising"],"text":"**Provider.** NCSC\n**Title.** Cyber Assessment Framework\n**Description.** National Cyber Security Centre - Cyber Assessment Framework\nhttps:\/\/www.ncsc.gov.uk\/collection\/cyber-assessment-framework\n\n# Minimising the impact of cyber security incidents\n\n## Response and Recovery Planning\n\n### Testing and Exercising\n\nExercise scenarios are based on incidents experienced by your and other organisations or are composed using experience or threat intelligence.\n\nExercise scenarios are documented, regularly reviewed, and validated.\n\nExercises are routinely run, with the findings documented and used to refine incident response plans and protective security, in line with the lessons learned.\n\nExercises test all parts of your response cycle relating to your essential function(s) (e.g. restoration of normal function(s) levels)."}
{"page":1,"tags":["Minimising the impact of cyber security incidents","Lessons Learned","Incident Root Cause Analysis"],"text":"**Provider.** NCSC\n**Title.** Cyber Assessment Framework\n**Description.** National Cyber Security Centre - Cyber Assessment Framework\nhttps:\/\/www.ncsc.gov.uk\/collection\/cyber-assessment-framework\n\n# Minimising the impact of cyber security incidents\n\n## Lessons Learned\n\n### Incident Root Cause Analysis\n\nRoot cause analysis is conducted routinely as a key part of your lessons learned activities following an incident.\n\nYour root cause analysis is comprehensive, covering organisational process issues, as well as vulnerabilities in your networks, systems or software.\n\nAll relevant incident data is made available to the analysis team to perform root cause analysis."}
{"page":1,"tags":["Minimising the impact of cyber security incidents","Lessons Learned","Using Incidents to Drive Improvements"],"text":"**Provider.** NCSC\n**Title.** Cyber Assessment Framework\n**Description.** National Cyber Security Centre - Cyber Assessment Framework\nhttps:\/\/www.ncsc.gov.uk\/collection\/cyber-assessment-framework\n\n# Minimising the impact of cyber security incidents\n\n## Lessons Learned\n\n### Using Incidents to Drive Improvements\n\nYou have a documented incident review process\/policy which ensures that lessons learned from each incident are identified, captured,\u2028and acted upon.\n\nLessons learned cover issues with reporting, roles, governance, skills and organisational processes as well as technical aspects of network and information systems.\n\nYou use lessons learned to improve security measures, including updating and retesting response plans when necessary.\n\nSecurity improvements identified as a result of lessons learned are prioritised, with the highest priority improvements completed quickly.\n\nAnalysis is fed to senior management and incorporated into risk management and continuous improvement."}
