{"locale":"en","name":"GDPR checklist for data controllers","description":"GDPR.EU checklist for data controllers  (https:\/\/gdpr.eu\/checklist\/)","copyright":"Terms and conditions\n\nThe following terms and conditions govern all use of the gdpr.eu website and all content, services and products available at or through the website (taken together, the “Website”). The Website is owned and operated by Proton Technologies AG (the “Company”). The Website is offered subject to your acceptance without modification of all the terms and conditions contained herein and all other operating rules, policies and procedures that may be published from time to time on the Website (taken together, the “Agreement”).\n\nPlease read this Agreement carefully before accessing or using the Website. By accessing or using any part of the Website, you agree to become bound by the terms and conditions of this Agreement. If you do not agree to all the terms and conditions of this Agreement, then you may not access the Website or use any services. The Website is available only to individuals who are at least 13 years old.\n\nContent of the Website\n\nThe Website and its content, mainly but not limited to its articles and guides, do not constitute and are not intended to constitute legal advice and do not establish an attorney-client relationship. If you need legal advice, please contact an attorney directly. The Company does not make any warranty about the validity of the content, despite its best efforts to keep the content up to date and as accurate as possible.\n\nComments section\n\nComments are welcomed and encouraged on the Website, but there are some instances where comments will be edited or deleted as follows:\n\nComments deemed to be spam or solely promotional in nature will be deleted. Including a link to relevant content is permitted, but comments should be relevant to the post topic.\nComments including profanity will be deleted.\nComments containing language or concepts that could be deemed offensive will be deleted. This may include abusive, threatening, pornographic, offensive, misleading or libelous language.\nComments that harass other posters will be deleted. Please be respectful toward other contributors.\nIndemnification\n\nYou agree that the Company, and any parents, subsidiaries, officers, employees or third-party contractors cannot be held responsible for any third-party claim, demand or damages, including reasonable attorneys’ fees, arising out of your use of this Website.\n\nPrivacy\n\nOur Privacy Policy explains the way we handle and protect your personal data in relation to your use and browsing of the Website. By agreeing to the present terms and conditions and to be able to use the Service, you also agree to our Privacy Policy.\n\nModification to terms of service\n\nWithin the limits of applicable law, the Company reserves the right to review and change this Agreement at any time. You are responsible for regularly reviewing these terms and conditions. Continued use and browsing of the Website after such changes shall constitute your consent to such changes.\n\nApplicable Law\n\nThis Agreement shall be governed in all respects by the substantive laws of Switzerland. Any controversy, claim, or dispute arising out of or relating to the Agreement shall be subject to the jurisdiction of the competent courts of the Canton of Geneva, the jurisdiction of the Swiss Federal Court being expressly reserved.","version":2,"provider":"GDPR.EU","file":"gdpr-checklist.jsonl"}
